{"model":{"name":"model_1","layers":[{"name":"x_100","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_100"},"inbound_nodes":[]},{"name":"x_40","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_40"},"inbound_nodes":[]},{"name":"x_raw","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_raw"},"inbound_nodes":[]},{"name":"lstm_1","class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_100",0,0,{}]]]},{"name":"lstm_2","class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_40",0,0,{}]]]},{"name":"lstm_3","class_name":"LSTM","config":{"name":"lstm_3","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_raw",0,0,{}]]]},{"name":"concatenate_1","class_name":"Concatenate","config":{"name":"concatenate_1","trainable":true,"axis":-1},"inbound_nodes":[[["lstm_1",0,0,{}],["lstm_2",0,0,{}],["lstm_3",0,0,{}]]]},{"name":"dense_1","class_name":"Dense","config":{"name":"dense_1","trainable":true,"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["concatenate_1",0,0,{}]]]},{"name":"dense_2","class_name":"Dense","config":{"name":"dense_2","trainable":true,"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_1",0,0,{}]]]},{"name":"dense_3","class_name":"Dense","config":{"name":"dense_3","trainable":true,"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_2",0,0,{}]]]},{"name":"dense_4","class_name":"Dense","config":{"name":"dense_4","trainable":true,"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_3",0,0,{}]]]}],"input_layers":[["x_100",0,0],["x_40",0,0],["x_raw",0,0]],"output_layers":[["dense_4",0,0]]},"weights":[[[0.0217213817,-0.0665967315,-0.078577444,0.093341127,0.0421340838,-0.0592114516,-0.0265907701,-0.0890891701,-0.0575748682,-0.0030051933,0.0716082454,-0.0163647979,-0.0345763154,-0.021520786,0.0425880104,0.0498160012,0.0939575508,0.0205170978,-0.0023599549,-0.0647620484,-0.0135799227,-0.0813014209,-0.009872566,0.0270558652,0.0192913599,0.001167747,-0.0299204737,0.0460075662,0.0585678667,0.004791704,-0.0487273112,-0.0332817957,0.0379615612,-0.0528387278,-0.0699141994,-0.0110092284,0.0339213759,-0.0659924597,-0.0549164638,0.0656450912,-0.0385778658,0.0235440023,0.0744823962,0.0517289415,-0.0764693245,-0.0524779968,-0.0132442219,0.042097263,0.0939975232,-0.0516040921,0.0380415395,-0.0052460707,-0.0596901514,-0.0034100218,-0.0548284277,0.0076899859,0.0088026635,0.0662746727,0.0475282818,0.0437021814,-0.0869738609,-0.0759327561,0.0287359748,0.0598940067,0.0140229603,-0.0752040595,0.0602430739,-0.0122373123,0.019095296,0.0584654436,0.0312870443,-0.042817682,0.0244914256,-0.0102673005,-0.0620411076,-0.069843322,0.0284982007,0.093337208,0.0472740307,0.0567322448,0.0496782251,0.0935034603,0.0070002456,-0.0767446533,0.0011265092,-0.018142961,0.0147667704,-0.0400025062,-0.0651964396,0.0702969655,0.0341449752,0.0528198704,0.0304177552,-0.0833929256,0.0069458536,0.0192825906,0.0891543403,-0.0668080747,-0.0413312837,-0.0715217292,-0.0151110562,-0.044970002,0.0730603337,-0.056825839,0.0870834142,-0.0723378211,-0.045179788,-0.0663595572,-0.0924670696,-0.0113486135,0.0286826324,-0.0251293853,0.0536492318,0.0452544428,-0.0745039433,0.004839052,-0.0722329468,-0.0154636037,-0.063802354,0.0239464585,-0.0570625141,0.1005762145,-0.0211162791,0.0447361022,0.055614084,0.0223139077,-0.0163853727,0.0444933772],[0.0287687611,-0.0640455931,0.0193871967,-0.0724781901,-0.0673177391,-0.084511295,-0.0643476993,-0.0183746926,-0.048402328,-0.0143265147,0.0691724569,0.076654993,0.0566404797,0.050232511,-0.0636323094,-0.0873409435,0.0551835448,0.0497990847,-0.0185153484,0.0319963358,-0.0254296754,-0.0927428976,0.0380486995,-0.0218364485,0.0547962859,0.0302365255,0.0060524028,-0.0703372285,-0.0017337387,-0.059130799,0.0147007378,0.0413312428,-0.0239483863,-0.0471751504,0.0639736056,-0.0136529729,-0.0418367051,0.0057378733,0.0472632386,0.0090740174,0.0420366935,-0.0744123384,0.0887900516,-0.0056878752,-0.0714929178,0.0327924713,0.028526986,0.0070472527,-0.0015901336,-0.0565360561,0.0686303973,-0.0330093242,-0.0290505588,0.0017080778,0.0129958251,-0.0638771132,0.094492048,-0.0562331267,0.0498524606,0.0203400273,-0.0398166254,0.0876398757,-0.0026807869,-0.0167547558,0.0002165519,-0.0854637027,0.051368352,0.008007315,-0.0067006429,0.0418352894,0.03281812,0.0203955825,-0.0232020076,0.0199634228,-0.0676804483,0.0780650899,0.0320997015,0.0602747202,0.0902371556,0.0804506913,-0.049601566,0.0020904136,0.0787996724,-0.070372954,0.0524602607,0.0112359403,-0.0292735994,-0.0693764761,-0.0769304112,0.0507928543,-0.0769229457,-0.0762663335,0.0872177929,-0.0008626711,0.0175345633,0.0796303973,0.0466252826,0.0120863747,0.0628335178,0.0241006222,-0.0736655295,-0.0454597138,0.0504600853,0.0334765092,0.0043667629,0.010303909,-0.0278166644,0.0322364792,-0.0139468368,-0.0253110733,0.0085320743,0.0694769397,-0.0836175531,0.0265979078,0.0330001004,0.0192218479,-0.0967391059,-0.0114323935,0.065857783,-0.0389899611,0.0468005873,-0.0195343755,-0.0811438337,0.0493113399,0.0707960874,-0.0816222131,-0.0837066025,0.0064142235],[-0.0132318316,0.0408934765,-0.0853035077,0.0184370074,-0.0539907068,-0.0329531729,-0.0345014669,-0.0060610152,0.0051106047,-0.0553518757,-0.051671654,0.0865101665,0.0146528184,-0.0141762616,-0.0029919052,-0.0373959504,-0.0445905365,-0.0829954743,0.0674440786,0.0043496666,0.059506733,0.0425049998,0.0465711541,-0.0032260977,0.0812777057,-0.0280884523,-0.0367169902,-0.0754701793,0.0179305822,-0.0514350235,0.0293110777,0.0358123481,-0.0157605559,0.0640836582,-0.0203474481,0.0929844752,0.0746025667,-0.0268611722,0.0501751713,-0.0363405608,-0.0686699301,-0.017609233,-0.0395965576,-0.0640634671,0.0445305333,0.074450098,0.0361778922,0.0633578524,0.027079016,-0.0756139457,0.0773726404,0.0494998507,-0.0407856107,-0.0414481275,0.0029961825,0.0267125424,-0.01491524,-0.0438805185,0.0022064717,0.0093216877,-0.0525119528,-0.0384816527,-0.056487672,-0.0089466395,0.0811638087,0.0330746174,-0.0607486703,-0.0168927107,0.0315925702,-0.0003931789,0.0619832277,0.0282298513,0.0095625939,0.06675037,0.0350840874,0.0059773815,-0.0854885131,-0.0093089631,0.0930340365,0.0467382856,0.0872292444,0.0255943052,0.0244486444,0.0794675797,0.0876840577,0.0612809695,0.0825708434,-0.0175264813,-0.0404954217,-0.0547607988,0.0295523573,-0.0119585833,0.0494727008,-0.0061337468,0.0338472165,0.0628432333,0.0039195102,0.0627270788,0.0172366947,-0.0215628017,0.0699192137,-0.0904979557,0.0091705527,0.0304209795,-0.0647630468,0.0676653609,-0.0454528183,-0.0443329401,-0.0312918797,0.0594035015,0.0724501386,-0.0238439105,-0.0265477654,0.0582231134,-0.0829982087,-0.0035310469,-0.0957930908,-0.0237880629,-0.0723156855,-0.017360514,-0.0017924139,0.094849214,0.0191500876,0.066338256,-0.0261950549,0.042588979,-0.0774588361,-0.0532335825],[0.0612998977,-0.0348238871,-0.0156170409,0.0904189348,0.0178894829,-0.0436536632,0.0655151978,0.043680951,0.0060735545,0.0512955636,0.0764852539,-0.0444689877,-0.0299551822,-0.0084238853,0.0873607397,0.0181230307,0.048603259,-0.0140568474,-0.0066512595,0.0662200972,0.0448185317,0.015029016,-0.0555172674,-0.0788408592,0.0305030774,-0.0181842372,-0.0596290827,-0.0161126107,0.0775711387,0.0346807316,-0.0708197802,-0.0078846402,-0.076923199,-0.0449749418,0.0452078022,-0.0782060102,-0.011002915,-0.0459616743,0.0249209311,-0.0035410626,0.0765598416,-0.0722832307,0.0162096806,0.0022922447,-0.0244908556,-0.0402862951,0.0368542783,0.0420419276,-0.062229,0.0303528197,-0.004504825,0.0021666992,0.019554913,0.0185650475,-0.0808206946,-0.0815056488,-0.0494340397,-0.0107195796,-0.081132561,0.0193633568,-0.0831551701,0.0057146475,0.0029475561,-0.0309852362,0.0769643188,0.0052991211,0.0771529227,0.0600451864,0.0340701677,0.0346775129,0.00490925,0.0721968934,-0.092858687,0.0851834714,-0.057393074,-0.0211909991,0.024809571,0.0697048381,0.0446935147,-0.061244037,0.0361918025,-0.0333018973,-0.027475331,0.0407872833,0.0425117016,0.0795797259,-0.0503375679,0.0315711312,-0.0415049568,0.0653409734,0.0582579896,-0.0073394352,-0.0439403728,-0.0691787153,0.0814311653,0.0599129274,0.0803802237,0.0313318036,-0.0289270356,-0.002208526,0.0264624227,-0.0887479112,0.0558356866,-0.0174572971,-0.0244605001,0.0609573312,-0.0669334903,0.0191620048,0.0201658439,-0.0716882274,-0.0073846038,0.0237792581,0.0412585996,-0.0290298648,0.024084026,-0.0734796822,-0.0635636151,-0.0105073415,-0.0576260015,-0.0202175621,-0.0036938048,-0.0522418544,0.0009223542,-0.021373814,-0.0388264544,-0.0054409448,0.0659342483,-0.02978554],[-0.0728888065,-0.0878502503,-0.0956352055,0.041921977,-0.0824523419,0.0137414653,0.0682586208,-0.0495058522,0.0726606026,-0.0795848295,0.0187986251,-0.0243245158,0.0391560979,-0.0265103262,0.017613275,0.0267855916,-0.0539898649,0.0012106107,0.0919101462,-0.0773726925,0.0008701113,-0.0626913011,0.0385427959,-0.0075638383,-0.0741939321,-0.0498946086,-0.014989336,0.0834207311,-0.0880528688,0.0787130073,-0.0861124247,-0.0775448903,-0.0121080773,0.0544521697,-0.0179428849,-0.0193435829,-0.0657455325,-0.0941859707,-0.0823801011,-0.0706712231,-0.0484205149,-0.0722104385,-0.0785160288,-0.0085391225,0.07731428,-0.001606034,-0.037281096,0.0288892426,0.0297596753,-0.0664352477,-0.0209611263,0.0139271664,0.0743206963,-0.0935872868,-0.0880964324,-0.0286449697,-0.0351007394,0.0362646468,0.0069247782,0.0056297756,-0.0916448534,-0.0466528386,0.0616322234,0.0651340634,-0.0012220952,0.0831409693,0.0468613356,0.0567561872,-0.037544135,-0.0657949597,-0.0722327232,0.0484125093,0.0700799525,0.0433585867,-0.0539990142,-0.0756519511,0.0776459426,0.0594293214,0.0569350868,-0.0278274287,0.0876464769,-0.0400810353,0.0466297902,-0.0355998278,0.0769067183,-0.020555675,-0.0242074206,0.0664225742,-0.0243686307,0.0012349683,-0.0013249335,0.0178265963,-0.0804922879,-0.0709353834,-0.0314066783,-0.0046256459,0.0475290976,0.0654798597,0.0774948373,-0.0366486609,0.0391265228,-0.0779214874,0.0745565966,-0.0094177844,-0.0484644026,0.0953320861,-0.0882673636,-0.0321628042,0.0541318171,-0.0392150432,0.056932088,-0.0652585104,-0.0548379906,0.0213267542,-0.0291149188,0.0620049797,0.047790166,-0.0041074394,-0.0412511975,-0.0272719599,0.0855354071,0.0412574299,-0.0413971208,0.0610799268,-0.0259754565,-0.0310917553,0.0159624722,0.0302658286],[0.0808763653,-0.0966699272,-0.0115408571,0.0205461551,-0.076125361,-0.0618516803,-0.0450521074,0.0402979255,0.0917945132,-0.0058669373,0.0476353765,-0.0025470862,-0.0715747252,-0.0811350495,-0.0008874647,0.0230982825,0.0105454875,-0.0321682245,-0.0066394578,-0.0660128668,0.0845742375,-0.0678765103,0.0813881308,-0.0441006422,-0.0713358894,-0.0154507505,0.0450121686,-0.0123688243,-0.0012955825,0.0047330377,-0.0086379312,0.0725030228,0.0677864999,0.0457792617,-0.0917718634,0.0677871332,-0.0195815209,-0.0793780088,0.0290134531,0.051096987,-0.0609676316,-0.0544446371,-0.0055315001,-0.0467812195,0.0295805503,0.0092856893,-0.0277190264,-0.0498177521,-0.015027727,0.0370734744,0.0309936758,0.0313195959,0.0489476025,-0.0442489907,0.0760556608,0.0112562058,0.0038770498,-0.0324158929,-0.0110511165,0.0857157335,0.0291872323,0.0256340299,0.0045666718,0.0015251865,-0.0588944629,-0.0550135747,0.0515409112,-0.0228880141,0.0150657808,-0.0512751378,-0.0148930755,-0.0320215598,-0.0068285894,-0.0248982646,-0.0804561004,0.0379903726,0.0388048217,-0.0389763936,0.0823512748,0.0096545052,-0.0397931784,-0.0542159118,0.0744801909,0.0012883495,0.0862958953,0.0119198784,0.054431852,0.0771321133,0.0828594267,-0.0671066865,-0.0427194461,0.0234051365,-0.0066027106,-0.0368488468,-0.082574971,-0.0920461044,0.0013757724,-0.0043936633,0.0434996262,-0.0297539737,-0.0526190773,-0.0033225622,-0.0084064053,-0.0200068858,0.0333330482,0.0383940972,-0.0180841014,0.0026010773,0.0430602245,0.0666318312,-0.017573176,-0.0382720903,-0.0376054943,-0.0342243351,0.0513384081,0.0166031811,0.0645601377,0.0622037463,0.0388084576,-0.0400943682,-0.0639157519,0.0859643072,0.0016387212,-0.0146034081,0.0088837082,-0.0852640346,0.0571934283,-0.0245574825],[-0.0140907709,-0.0764292702,-0.0678375065,-0.0288864113,0.058259353,0.0689732283,0.0574781187,-0.0564986542,0.0332277752,0.0754503086,0.0360485129,-0.0051732515,0.0120650344,0.0043919045,0.0140594868,-0.0017421761,0.0740388259,0.0572447106,0.0199066326,0.0189978182,0.0477090441,0.0390376635,-0.0674066767,0.084999755,0.0451143831,0.0862189084,0.0406690314,0.0618664213,0.0747769028,-0.0486738719,0.0099535808,0.0036520888,-0.0519985259,-0.0869167671,0.0011426139,0.0013173006,-0.0346799493,0.0381386057,0.0464495979,0.0342287533,-0.0482618883,-0.0223696399,0.0884939954,-0.0097925728,-0.0764326602,0.0686710849,-0.0796430558,-0.0082536796,-0.0114309154,0.0670575947,-0.0299711451,-0.0400914885,-0.0567813478,-0.0288752802,0.0284818094,-0.0510734767,-0.0355912559,-0.0035927547,0.0082415063,-0.0082314583,-0.0099450862,-0.0705213472,-0.0847216994,-0.0142558264,0.0066752741,-0.0361911245,0.0647238642,0.0038046429,0.0512212776,0.0008362636,-0.0713789538,0.0431604013,0.008587067,0.072360009,0.0448481217,0.0122306412,0.0135258986,-0.0323337987,0.03487413,-0.0149599053,0.0037474066,-0.0692829043,0.0604880638,0.0344078429,-0.0762513131,-0.0674156919,-0.0364369899,0.0712539777,-0.0377069302,-0.020072408,0.079133518,0.035259258,0.047698047,-0.052275259,0.0802706182,0.07868132,-0.0320834368,0.017696524,-0.0300652683,-0.0099688778,0.0536357164,-0.0688287318,-0.0368385687,0.0465725698,0.0538850948,0.0057164654,-0.0224065818,0.0335217379,-0.015564369,0.0278478861,0.0146821523,0.0299557522,-0.0574016683,-0.0792570636,-0.0507056899,-0.0254344512,-0.0840220898,0.0153243607,-0.0911086276,-0.0310979113,0.096548453,-0.0641325563,-0.0483202636,-0.0385141633,0.0819883272,-0.0125493919,-0.0755385533,0.0443512574],[-0.0492924191,0.0167046133,-0.0755927116,-0.0476994552,-0.0720665753,-0.0063521732,0.0169799365,-0.0814754516,0.0365081988,-0.0592126623,0.0261814129,-0.0388520993,0.0593631752,-0.0893880054,-0.0279353391,0.0027280154,0.0361251086,0.0347580612,0.0181815568,-0.0699604973,-0.0880587548,-0.0356158651,-0.0597942434,-0.0286540091,-0.0765004084,0.0126110911,-0.0526705384,-0.0042134561,-0.0781321451,-0.0713812187,-0.0172522906,-0.0013327812,-0.0003769282,-0.0884070322,-0.0747681484,0.0047978698,0.0677154884,0.0707911402,0.0219990518,0.0444545411,0.0538569912,-0.0777708963,-0.0113588935,-0.0373387933,-0.0413886867,0.0355613567,0.0779102668,-0.0360412039,-0.004071855,-0.0143862637,0.016607549,-0.0099101169,0.0725474432,0.0378861539,-0.0428912491,-0.0610164441,0.0792775899,0.0376976244,0.0038093906,-0.0429551713,0.0619377345,0.0236012284,-0.0703343898,-0.0725731179,0.0062136585,-0.0333244726,-0.0161837135,-0.0043422272,0.0862247422,0.035194464,0.0773563981,0.0307322033,0.0060453126,-0.0627990514,0.0268300641,0.0102727553,0.0301798172,0.04140177,0.0505711883,-0.0787888989,-0.0425468013,0.0601970367,0.037842799,0.0518860705,0.0719678774,0.0561318807,0.0464019738,-0.0027483329,0.0831970423,0.0272729397,-0.0795026496,-0.0779925436,-0.0244733505,0.0651714131,-0.0447741039,-0.0330781378,-0.0046316842,-0.0225051101,0.0305812545,0.0568902269,0.0421484485,0.0028943717,0.0235249531,0.0786847398,0.0053085857,0.097900182,0.0788955614,-0.0755846277,0.0020836554,-0.0246466976,-0.0399875008,0.0622628666,-0.002976126,-0.0560117774,-0.0296466444,-0.073868677,0.0701676682,0.0070213443,0.0530376509,0.0584949329,0.0643329546,-0.0297012161,-0.0880558342,-0.0261001829,0.0718309209,-0.0000619331,-0.055916585,-0.0239081867],[-0.0000978195,-0.017901374,-0.044849135,0.0182091016,-0.0734596103,-0.0171494577,-0.0780036077,-0.0943280905,0.0888951793,0.0371692516,-0.0094418619,-0.0491989814,-0.0938614234,0.0586251132,0.0725990683,0.0035051117,0.0136509771,0.0264873281,0.0005529695,0.0533740446,0.0776102841,-0.0267881397,0.0806124359,-0.0632775873,0.0820951089,-0.0418272167,-0.0201419499,-0.0746267438,0.0066638039,0.0469574146,0.0224589314,-0.0812329575,-0.0293000266,-0.0076355143,-0.0143540837,0.0942196026,0.0336203948,0.0423465744,-0.0626310706,-0.0214670207,-0.0504740514,0.0195804387,-0.042193722,-0.0322025567,-0.0900117382,-0.0851211399,-0.0157836508,0.0055025262,-0.0395396203,-0.0179791935,-0.0757689849,0.0637249127,-0.0208764002,-0.0200717784,0.0331564248,-0.0343678333,-0.0679901391,0.0871502683,-0.0172449648,-0.0189723466,-0.0572896302,0.0874786749,0.0680937171,-0.0504381731,-0.0432068221,-0.0206229202,-0.0496662483,0.092684634,-0.0443178639,0.0801244974,-0.0217611548,-0.0050474368,-0.024914518,0.0120652691,0.0322041549,0.0788114369,0.0431626216,-0.0370175429,0.0124313431,0.0006495983,-0.0760484263,0.0458943956,0.0538190939,-0.0324749053,0.0039163795,-0.0788595974,0.0727678761,0.0509688668,0.0481828563,0.0775230303,0.0160428975,-0.0563139543,-0.003995053,0.0709104016,0.0482935831,-0.0915441886,0.0452659987,-0.0185194537,-0.0898194462,-0.0741822794,0.0018361718,-0.0944146067,-0.0876690671,0.0366826393,-0.0333015695,-0.0201275386,-0.0426524989,0.0067576058,0.0106670354,-0.0882768258,0.0605390333,0.0411918461,-0.0445409678,-0.043502938,-0.0074909548,-0.0568701774,-0.0730733126,0.0103752501,0.0477298573,0.0494527817,0.0962986946,0.0408714488,0.04209546,-0.0847404152,0.0306235515,-0.0118934307,0.0635893717,-0.0219711941],[0.02088622,0.0202892888,-0.0450147018,0.0288149957,-0.0468700454,-0.0169267002,-0.0202441085,-0.0155424625,0.0032718503,-0.0696113408,0.0252504554,0.0613860004,0.0562631972,0.0287749432,0.010183434,-0.0827520937,-0.0281517822,-0.0164114423,-0.0465352684,0.0787616298,-0.0381052643,0.0545577444,0.0161148757,0.0829657316,0.0622004271,0.022723034,-0.043045342,-0.0538016893,-0.0895185992,0.013080393,0.0277386047,-0.0562317409,0.0223345608,-0.0667854398,-0.0660816878,-0.0464910828,0.0022580838,-0.0945710912,0.0306568202,-0.0153645221,-0.0489903651,0.0309751984,0.0716931,-0.0082565518,0.0600425303,0.0412402935,0.0011077647,0.0025128368,-0.0035264587,0.070024237,0.0450877324,-0.0687453374,-0.0398680717,-0.0489779934,-0.0320670381,0.0784638226,0.0050581843,-0.064500846,-0.0793862343,0.0668616071,-0.0850237086,-0.0487974249,-0.0726295263,0.0714082569,-0.0178759769,0.010914769,0.0787875354,0.0101770768,0.0852425918,0.0827905238,-0.0220021661,0.0830077752,-0.0795287639,-0.0556360334,0.048997663,0.034316346,-0.0553140938,0.0717426017,0.0685041621,0.06938719,0.0481058471,-0.0202761292,0.0230866037,0.0000961223,0.0236084741,0.0696625262,-0.0511957109,-0.0511675552,-0.0482898355,-0.0758726671,-0.0094300369,-0.0246595796,-0.0243707336,-0.0462336652,0.0651223212,0.0090814568,0.065685086,-0.0563091151,0.0056760716,-0.0241065342,0.0332400128,-0.0456731953,0.04255943,-0.087054044,0.0258171204,0.0069707115,-0.0347741358,-0.0084922407,0.029863013,-0.0872245356,-0.0774040669,0.0153062837,-0.0067047575,-0.0658646896,-0.0635083914,0.0997579917,-0.0153909447,-0.0105968155,0.034550868,0.007913189,-0.0037879501,0.100178495,-0.0631932914,0.0311218537,0.0038955326,-0.0772737339,0.0552803427,-0.0626614019],[-0.0284026712,0.0008254737,0.0692170486,0.0174288843,-0.0128394458,-0.0775199831,-0.0466457345,-0.0586449057,-0.0395638347,-0.0009308232,-0.0786509886,-0.0204797331,-0.0199073609,0.0444825925,0.0068557728,0.02833011,-0.0755451173,0.0157556683,0.0533547439,0.0288038719,0.0429233275,-0.0088883191,0.0048224377,0.0838494748,-0.0601619966,-0.0060946727,-0.088650167,-0.070619382,0.0712857246,-0.0036013175,-0.0272207577,0.0403305292,-0.0035499807,-0.0275323205,0.0370574929,-0.0596536919,0.0119464453,-0.0532498173,0.0722490251,-0.05132984,-0.068165116,-0.0219201799,-0.017710004,0.0742855072,-0.0240216628,0.0025698366,0.0315100998,0.0478001982,-0.0220803134,-0.03098852,0.0880543888,0.0076563577,-0.0257535577,0.0411533527,-0.0879267007,0.0853994638,0.0539250933,-0.0022522779,-0.0281789582,0.0809888318,-0.0809833854,-0.0515604913,-0.0415368862,0.0522814281,0.0002504902,-0.0682508647,0.0560998917,-0.0368237086,-0.0625401586,0.0714982152,-0.0192815829,-0.0442800112,-0.0404626541,-0.0565060601,0.0174854193,-0.0394266173,-0.0018569146,-0.0117934579,-0.0395980552,0.0155670242,-0.0653292015,-0.0218038782,-0.0445025451,0.0753100216,0.0041124644,-0.0392230451,0.0556122027,-0.0567721613,0.0795600861,0.0397185385,-0.0431611873,0.0013912772,0.0878491476,-0.0412572138,0.0450531021,0.0164646432,-0.0598569997,-0.05495831,0.0128109735,-0.0057163239,-0.0311454702,0.0367936715,-0.077457197,-0.0130457021,-0.0089073759,-0.0048724553,0.0305600911,0.0574277081,-0.0895228907,-0.0067884414,-0.0181055088,0.0496766865,0.0586591884,0.0353760831,0.0770686492,-0.0426430218,-0.0244325344,0.0129985362,0.0560813136,0.0632535294,-0.0464192629,0.0144307222,-0.0105652567,0.0208709631,0.0066731176,-0.074461244,-0.0332681164,-0.0823640823],[0.0915086865,0.0322767161,-0.0924286693,0.0934325606,0.0083035743,0.0610058792,0.0620377697,-0.0155666471,0.0627211854,0.07161019,-0.059348356,-0.0480175875,0.0443680324,-0.066168502,0.0562249869,-0.0250817835,-0.031280674,0.0631528497,0.080254145,0.0382077172,0.0097985901,-0.0261471141,-0.0610589199,0.0633261874,0.0642884001,0.0474384092,0.0092289243,0.0363921188,0.0494387336,0.0703252479,-0.0720047876,-0.0660853162,0.0600775629,-0.0858983323,0.0035015421,-0.0215374287,0.0547043122,-0.0900486261,-0.0747029856,0.0162800159,-0.0087075466,0.0016714495,-0.0382006392,0.0554797873,0.0497986004,-0.0462588854,0.0597509705,-0.0157100316,0.0254826397,0.0307344366,0.009559026,-0.0322477967,0.0045490828,-0.0779553279,-0.0893150866,-0.0139799332,0.0233044717,-0.0459577627,-0.0339829698,-0.0255467128,0.073857151,0.007156603,-0.0424020104,-0.0307634547,0.0700560212,0.0712105632,-0.0426695719,0.0211357083,0.0753756687,0.0485485941,0.0132688219,0.0841575935,0.0338649265,0.0486088991,-0.0285073612,0.0852432847,-0.035413567,0.0961533934,-0.0440302938,-0.0207960699,0.0901935473,-0.0644222572,-0.0165523309,0.0572595783,-0.0768577382,0.0073433304,0.0127856173,-0.0060381703,0.0446770303,-0.0153778959,-0.0894230157,-0.0328523517,0.0304684527,-0.0438948013,0.0568395481,-0.0884861797,0.0837426111,-0.0659865364,0.0649691448,-0.0201420449,-0.0647897348,-0.0781130344,-0.0601234809,0.0723403022,0.0729563311,-0.0326123349,-0.0070963418,0.0090704719,-0.0518770553,-0.0470114537,0.0460656546,-0.0775051862,0.0144557664,0.0362574421,-0.0546254553,0.096774511,0.0722563788,-0.0001109858,0.0031007833,0.057163354,0.0332132354,-0.0135973701,-0.0004689145,-0.0556519516,0.0302742515,-0.0135157295,-0.0320771784,0.0234898869],[-0.0406603068,-0.0110645099,-0.0498522371,0.0438402407,0.0621715002,-0.0586222224,0.0813932642,0.0324235111,0.0102832261,-0.0205529593,0.0433113575,0.0687486976,-0.0634410754,-0.0622967742,0.01854573,-0.0922814682,0.0737642422,-0.0106537687,0.0794477239,-0.0437561385,0.043830093,0.0104167815,-0.0071534687,0.0800788552,0.0469397008,-0.0462599397,-0.035488911,-0.0805869177,-0.0830722749,0.0410627313,-0.0898133516,0.0418862551,0.0765858665,-0.0577869825,0.0569967516,0.0109362043,0.0143559333,0.0104272887,-0.0379238091,0.0138460752,-0.0252962783,0.0585202836,-0.0430450886,-0.0125712212,0.0347700343,-0.0206438452,0.0201819763,-0.0418221429,0.09034089,-0.017302746,0.0792110562,-0.047640115,-0.0821680278,-0.0354453363,-0.085067533,-0.0437694564,0.0618343018,-0.0365757197,-0.0254612621,-0.0426966175,-0.0342071131,0.0285836328,0.0074898521,-0.0629028007,0.0136413043,0.0553375259,-0.0797110647,-0.0630067885,0.0313945711,-0.0358810946,-0.0763909519,0.036360085,-0.0039875796,-0.0605576262,0.0623759851,0.0452916808,0.0681271106,-0.0151143987,0.001024839,0.068429403,0.0201456416,0.0314151049,0.0547626801,0.0674628019,-0.052705735,-0.0199265927,0.0024657401,-0.0585869178,0.0165253002,-0.0183562338,-0.0767486691,-0.0008881322,0.0431261323,-0.0599950291,-0.0292334147,-0.0841234177,0.0778730288,0.0479452871,0.0807388499,0.0393019021,0.0341438875,0.0709335133,-0.0545910746,0.0767775998,0.0413175151,-0.0697585419,-0.0048942552,-0.0700113848,0.082002528,0.0155213745,-0.0205528978,0.046661064,-0.0413144864,-0.0215746611,-0.027327016,0.0578361265,0.0500397049,-0.0354840159,0.0595236011,-0.0633124784,0.0089956811,0.0991045535,-0.0534012057,0.0110222213,0.0325545557,-0.0556073748,-0.0911089778,-0.0833980516],[-0.0784830004,-0.0576433055,0.0301736966,-0.056374725,0.0332574248,-0.0651869103,-0.0163104851,-0.0453473255,-0.0675958768,0.0311727636,-0.0642080531,-0.0734012574,0.0604122244,0.0066602952,-0.0404651724,-0.0951218307,0.0276312754,-0.0598378293,-0.0822191462,-0.0502962023,0.0508417897,-0.0424572825,-0.0823720172,0.0384505019,-0.0209257063,-0.0764748156,-0.0478606224,-0.0770757496,0.019912757,0.0011530556,0.0458661728,0.0296980813,-0.0171299949,0.0623462684,0.078585811,0.0265515838,0.0038715701,-0.0746973157,0.0886049867,-0.0913301557,0.0198620372,0.0476279072,-0.0640564486,-0.0142684141,0.0718863681,-0.0758795962,-0.0338800102,0.0171780288,0.049228508,0.0679124594,0.0052393582,0.0356274992,-0.0909915492,-0.066161558,0.0079378244,0.060146369,0.0551729463,0.0254748687,-0.0891811848,-0.015936831,-0.0642100871,-0.0137769757,0.0039618039,0.0677554607,0.0522332042,0.0496232286,0.000758823,0.0194273572,-0.066512391,-0.0041046203,0.0638730824,0.06724298,0.0799542516,-0.0372700505,0.0676344335,0.06364806,-0.0283063035,0.0413358919,0.0139109315,-0.0767781809,0.0443897806,0.0485805683,0.0417916663,0.082243517,-0.0291086715,-0.0025947448,0.027987659,-0.07573957,-0.0268445052,0.0293521732,0.0052933674,0.0277465824,-0.0116534345,-0.0826350227,0.0377210304,0.0435508825,0.0157372206,-0.0647126883,0.0082111862,-0.0138705028,-0.0721291155,-0.0455439091,0.0143696684,-0.0650952458,-0.0531027243,-0.0676737949,-0.0539551564,-0.0782193169,0.0442874841,-0.0907876119,0.0706780776,0.0634571984,0.0268610567,-0.052110713,-0.0800503269,0.0264427867,0.0042992923,-0.029472379,-0.0000536747,-0.0468856581,0.07740511,0.0902426094,0.0287436098,-0.0129655097,-0.0366204344,-0.0283680353,0.0621483587,-0.0487053543],[0.0093617039,-0.0205746368,-0.0848852396,-0.0423584469,0.0141699463,-0.0266705044,0.0678077117,-0.07226827,-0.0774533153,-0.0438616984,0.0756728128,0.0227424074,0.0397892036,-0.0786589459,0.0520177633,-0.003584268,0.0629844517,-0.0308512151,0.0293674637,0.0914221182,-0.0028725828,0.0437190272,0.0829324126,-0.0026260421,-0.0116939284,0.039609421,0.0005497599,0.0473243929,-0.0174304657,-0.0025392442,-0.0801453292,0.0598750487,-0.0354478881,-0.0243885256,-0.0418826155,0.0511021279,-0.0099326046,-0.0113006029,0.0377060212,0.0365753286,0.0460146591,-0.016287582,-0.0326286741,0.008433152,-0.042944327,0.0218244474,0.0485015474,-0.0257805511,-0.0252033286,0.0690252185,0.0526221916,-0.0229575429,-0.0523226112,-0.0818438157,-0.0823519826,-0.0781142861,0.0415301882,0.0438500382,0.0082746763,-0.0467786044,-0.0783536434,0.0878167674,-0.0087632332,-0.0610103309,-0.0461040959,-0.0354044102,0.0195076969,0.0501748808,0.070647113,0.0647776723,-0.0039011065,0.0753143206,-0.0709895939,-0.002264091,0.0852599293,0.022710463,-0.0496319607,0.0479447953,-0.0581099093,-0.0209487472,0.0683803931,-0.0566574149,0.0328109898,0.0604744069,0.039791137,-0.0012960607,0.0247940421,0.0738365278,-0.0675802529,0.0017734821,0.066258423,-0.0060863444,-0.0518778674,0.0315123126,-0.0291853771,-0.0184873138,0.0931293443,0.0383675359,-0.083659485,-0.1035459191,0.0053969738,-0.0213781446,0.0369218439,-0.0417531356,0.0255785529,-0.0072792759,-0.0296235979,0.0090291211,-0.0637732819,-0.0867574289,0.0627693981,-0.0139238918,-0.0197357442,0.016245354,0.0141958464,-0.0091123311,-0.0886604637,-0.0832223818,-0.00177528,0.0559419319,0.0285826903,0.0523409992,-0.0115678431,0.0594895147,0.0184036139,-0.0567991324,-0.010875266,0.0658500791],[-0.0615594164,-0.0757480487,-0.0295579825,0.063789472,-0.0148390094,0.0598060675,0.0171646066,-0.0246459357,0.0355602056,0.0492350608,0.0505577624,-0.0704117566,-0.004457728,0.0158453826,-0.0423546582,-0.0445956998,-0.0413670093,-0.0065344791,-0.0333692469,-0.0690150931,0.0471460782,-0.0617303699,0.0594282225,0.0847884864,0.0177127831,-0.0158313215,-0.0797360912,-0.0285907276,0.0204683691,-0.0007625333,0.0621591583,-0.0452678092,-0.0238896944,-0.0206795651,0.047758732,0.0821282342,0.0103854043,0.0301592443,0.0918996036,-0.0523470901,0.0440522358,0.0752995387,0.0694739893,0.0630843937,0.076075457,0.0728831217,-0.0046499204,-0.0518452115,0.0067093889,0.0165273566,-0.0722381771,0.0356840342,-0.077966027,0.0179499127,-0.0063131326,0.0575425699,0.0496162735,-0.0778224841,-0.0743700117,-0.042746529,0.0660035983,0.050749436,-0.0723262206,0.0645348281,0.03099069,-0.0240702145,0.0619543791,0.0736378804,0.0271355826,0.0205013715,0.0126336459,0.0020283402,0.0436892025,-0.056616202,0.0348888226,-0.0137194935,-0.0601043627,-0.0303607713,-0.0532587767,0.0178608652,-0.055084791,-0.0786538199,-0.0138903707,0.0136723621,0.0561943203,0.0171715841,0.0498989932,-0.0612444431,0.0795736462,-0.0167624,-0.0045417342,0.0549075715,-0.0736902058,0.021272622,0.0842989385,-0.0521558113,-0.0247733388,0.0257554371,-0.0856384635,-0.0844103172,-0.0736677796,0.0758018717,-0.021869963,0.0494336076,0.004183854,0.0345106237,-0.0898925886,0.0938398093,0.0000232828,-0.0429546423,0.0576881729,0.0001166798,-0.0711167455,-0.0896892473,0.0350885577,0.00561869,-0.0265670549,0.0035349962,-0.0482764132,0.0033967819,0.0597822964,0.0928786993,-0.0039542583,-0.0346471928,-0.0045289653,-0.0636657253,0.0507797897,-0.0280851759],[-0.0057415683,-0.0363911949,-0.0025148331,0.006503643,0.0684285834,-0.0363591984,0.033235807,-0.0533204526,0.0509639941,-0.0175111927,0.0752743557,0.0291321296,-0.0831580982,0.0185673926,0.0908215046,-0.055309847,0.0061740717,-0.0681903958,0.0438616015,-0.0759384707,-0.0305159967,-0.0168121867,0.045138482,-0.0044583264,-0.059940286,-0.018540591,-0.0415194631,-0.0763901845,-0.0919022635,-0.028186636,0.0435853861,-0.0011215945,0.0375807807,-0.0877436697,-0.0754855201,-0.0655693114,-0.0935661122,-0.0482689068,0.0215875264,0.0276186597,-0.0728333369,-0.0356994011,-0.0341890678,0.0070098462,-0.039849326,-0.0157946888,0.0547846816,-0.0424104407,-0.0464231409,-0.0386545956,-0.036123246,0.0221276637,0.0086370278,-0.0474478267,-0.0419616178,0.0096929567,-0.063923955,0.0492847152,-0.0784498155,-0.0830478892,-0.0920168906,-0.0397019908,0.0800786912,0.0241599083,0.0044090529,0.0787899196,0.0003030269,-0.0572495461,0.0868984535,0.0384404585,0.0197341423,0.0339674614,-0.0698120147,0.045827955,-0.0394543409,-0.0133717442,-0.0382227786,0.0851596743,-0.0239006486,0.0622860789,0.0678217933,0.0651950836,-0.0348861404,-0.0595386587,0.0379330143,-0.0143221468,-0.0687059239,-0.0773243532,0.0218706671,-0.0109291915,0.005902146,-0.0091453781,-0.034281984,-0.0159127805,0.0619911328,-0.0709890276,-0.0654996857,0.0536059402,-0.0749050081,0.024690723,0.0454233214,0.0057011866,0.0630706623,-0.0131210424,0.0186308641,-0.0204681344,0.0159067586,0.0689999759,0.0478794686,-0.023141494,-0.0069727059,-0.0009401703,0.075351648,-0.0597480573,-0.0622173063,0.0504398905,-0.0927243829,-0.0141271614,0.0480357185,-0.0942338631,0.0087039005,0.0321065634,0.0568574369,-0.0355206244,0.0099973092,-0.0950633213,0.0620219596,0.031629391],[-0.0328750648,0.0661359057,0.0152074778,-0.0143033406,-0.0537911505,-0.0058393199,-0.0632738993,-0.0379586071,0.0844018087,0.0049934308,0.0253209826,0.0531522147,0.081272535,0.0425555296,0.0613547266,0.0498231165,-0.0740982592,-0.0872308761,0.0202601496,-0.0760023072,0.0148572819,0.0152303902,0.0810589939,-0.0139443139,-0.0301634017,-0.0398672707,0.0572369546,0.043620605,0.0386747159,0.0872430727,-0.0090012886,0.020992117,-0.0596808568,0.0627717003,-0.0366786383,0.0631233975,0.0376817062,-0.0837770998,-0.0723969042,0.0009386506,-0.0692332461,0.0482472442,-0.0302735437,0.0285040345,-0.0201873779,0.0448873676,-0.016475236,0.0030286547,0.0764827207,-0.023231145,-0.0366826244,-0.0240884777,-0.0664015114,-0.0795013532,0.0006705661,0.0154407509,-0.0189740527,0.0847551003,-0.0913030654,-0.0375759043,-0.0538540296,0.0470432043,0.0673597306,0.0186988711,0.091867134,0.0308837034,0.0071464442,0.0894871131,0.0406020097,0.0702871531,-0.0487832539,-0.0387038626,-0.012049566,-0.0424105972,0.0571824834,0.0027273737,-0.0652882904,-0.0117907459,-0.0380198658,-0.0026481969,-0.0322409123,0.0742375702,-0.0486994274,0.0221591908,0.0499449074,0.0580455326,-0.0194264203,0.0758341029,0.0767750442,-0.045358859,0.0037780681,-0.0419045202,-0.0033741386,-0.0735773668,0.0841789246,0.0660030395,-0.0475836322,-0.0669537336,-0.0388131738,0.0483069271,0.0170931052,-0.0217911154,-0.0729773417,-0.025648592,0.0062241647,0.047675658,-0.0009230278,0.0610972233,-0.0687121525,-0.0447781496,0.0933771655,-0.0501245894,-0.0332918055,-0.0655505732,0.0222423449,-0.0577889569,0.0732720271,0.004437557,-0.0093116099,-0.0853974819,-0.0674988329,0.100680992,-0.0414934047,0.0695471913,-0.0735654235,0.0701478943,0.051495567,-0.0637494549],[-0.0246862061,-0.0819377378,-0.0314421877,-0.0092860451,-0.0443926156,-0.0460604392,0.063480027,0.0233049374,0.0802318379,-0.0046123113,-0.0065603405,0.0053012734,-0.0096998494,0.0236704592,-0.054645434,-0.0796866044,0.0653246567,0.0511996001,0.032972753,-0.0522430427,-0.0863210186,-0.0912645161,0.0428994186,0.0160065945,0.0934688523,-0.0639388412,-0.0457360148,0.0231407136,-0.0236490518,-0.0114163561,0.0580723323,-0.0500056706,-0.0110070528,0.0268010199,-0.0941771865,0.0371628962,-0.0720435679,-0.0878872722,0.0188788529,0.038843479,0.0434611812,-0.0516494364,0.0361675583,-0.0339568071,0.0268788934,-0.0947223604,0.087147899,-0.0084520131,-0.0235354789,-0.0066993535,0.0792077035,0.0471849106,-0.0422861241,-0.0124551011,-0.0823679641,0.0006480682,-0.0198161695,0.0283626541,-0.0469638184,0.0482580997,-0.0708004311,0.0198193137,0.0188850146,-0.0838504732,-0.0390270129,0.0592210516,0.0904246718,-0.042559009,0.0125911338,0.0245241486,0.0568504035,0.0617058203,0.0678675324,0.0788897872,0.0557449684,0.0907602161,0.0594592765,-0.065396443,0.0810019895,0.0550991483,0.0282172803,-0.0610476471,-0.0103002274,-0.0737254173,-0.0744158402,0.0626817197,-0.022295706,-0.0539705195,0.072444424,-0.0052046631,0.0516426228,-0.0184019413,-0.0416724719,-0.0517806411,0.0643410683,0.0179720148,0.0056618359,0.00724982,-0.0099838832,-0.0724635944,-0.0393082276,0.0262314044,0.0495612323,-0.055257462,0.0689013228,-0.0122822765,-0.0211558528,-0.0601522215,-0.0251102168,0.0062215016,-0.0561115369,-0.0955866203,-0.050866317,-0.0404930525,0.0344508179,-0.0307725649,-0.0239491034,-0.0826801062,-0.0570864566,0.0765214041,0.0883150101,-0.0446587577,-0.0180498473,-0.0077646836,-0.0457442813,-0.05167377,-0.0602908805,-0.0757960007],[-0.0369704515,0.0126525303,0.003424308,0.0568855666,-0.0590505525,-0.0216520075,-0.0233235639,-0.0466451943,-0.0114803296,0.0705331042,-0.000236194,-0.0511910357,-0.0194733124,0.0787549242,0.086352393,0.0273193289,0.0312708803,-0.0781620592,0.0249797273,0.081866689,0.0195989143,0.0297808535,-0.042586077,-0.0061991899,0.0890599862,0.084982574,-0.0878609046,-0.0599897318,0.0669519156,0.0855702832,0.0422560833,-0.0815823078,0.0766027942,-0.0778838769,-0.0346650258,-0.0297362506,0.022080522,0.0014889725,0.0741284192,-0.0628019571,-0.0407995544,0.0425050221,0.0725343153,0.0724491626,0.0149560003,0.0271747224,0.0463159494,0.0481861383,-0.0553736202,0.0512388311,0.0523619875,-0.0023270226,-0.010918743,-0.0812837034,0.0112988446,-0.0198297519,-0.0287427381,0.020998925,-0.000055792,-0.0120174186,0.0457153171,0.0013427901,0.0651052743,-0.0618384592,0.0339962058,0.0543788001,-0.0617259443,-0.0212122407,-0.0658487305,0.0122935688,-0.0002306804,0.0592688099,0.0267625973,0.0436439142,0.0430526361,0.0900271833,0.0491602793,-0.0488615744,-0.01951834,-0.0336098596,-0.0192497429,0.0225359462,-0.0822471231,0.0466903634,-0.0506466217,0.0177902952,-0.0811549574,-0.0219980869,-0.0125637008,0.0211273432,-0.0657772943,0.0025658919,-0.0323286653,0.0681876615,-0.0124399941,-0.0224160925,-0.013228233,0.0359520726,0.0076710344,0.0617308989,-0.0083693471,-0.0985023528,0.0780051276,-0.0077165463,0.0470827371,-0.0657005757,-0.0944598243,-0.0236503799,0.004808702,-0.0341205522,-0.055455789,0.0137119703,-0.0604334883,-0.0523599871,-0.0607990287,-0.0139751863,-0.0701513663,0.0335506275,-0.0684847608,0.0007868024,0.065271683,0.0091567496,0.0192234535,-0.058951322,-0.0225137975,0.0066754008,-0.0238826293,-0.0497111864],[0.0040114666,0.0290827062,-0.0655082986,-0.0288744457,0.0522635877,-0.0557658337,0.0084534045,0.0389364809,-0.0399105325,-0.0390253216,0.0506854504,0.071807906,-0.0872930512,-0.0277897697,0.0022507103,0.0717978626,-0.0165449157,0.0684397668,-0.0641518235,-0.0538662598,0.0096410997,0.0107948612,-0.0829287469,-0.0480601378,0.0240597259,0.0497081243,-0.0209380277,0.0619315542,0.0570109673,-0.0147964945,-0.0490472019,-0.0116853612,-0.0563610792,-0.0485569052,0.0771221891,0.0737305507,-0.0816057697,-0.0229502209,0.0392740034,-0.0944066495,0.0591720417,0.0937715545,0.0701531544,0.017172711,0.0154432822,0.0527939685,-0.0163708534,-0.0202695392,-0.0031991175,-0.0013118638,-0.0183180962,0.0160506275,-0.0079758465,-0.0637884066,0.0422578156,0.0237767752,0.0326534733,-0.0010254127,-0.0878708065,-0.0758185759,0.0085859606,0.0052694753,-0.0782396644,0.0321404673,0.0072310125,0.0153311677,0.0564974248,-0.061973352,-0.0286155324,0.0045315255,-0.030733658,-0.0124259023,-0.005915178,-0.0058597028,0.0793439001,0.0049776034,-0.063384302,-0.0277301837,0.0137575837,0.0171417426,0.0635139868,-0.0806324407,-0.0043822187,0.0237103645,0.0611347556,0.0097140446,-0.0714217797,-0.0798080713,-0.0303640105,-0.0774430111,-0.0735802203,-0.0850613639,0.0162919536,0.001007741,-0.0719918385,-0.072668165,0.01847139,0.0399742834,0.0264409911,0.0349308103,0.0515096262,-0.0817183629,-0.0057313358,0.0382269211,0.029115716,-0.0137519948,0.0305412579,-0.0271386635,-0.0596390553,0.0585180558,-0.0369198434,-0.0478116348,0.050994236,-0.0549446829,0.0374653377,0.0117826061,0.0467044525,0.0170144904,-0.0097784633,-0.0663455799,-0.0372280478,0.0367853791,-0.0797695518,-0.0208245348,-0.0897696093,-0.0604668856,0.0350468606,-0.0300854184],[-0.0086182551,-0.0235424563,-0.029335456,0.0701981783,-0.0069553559,-0.0516540222,-0.0408141054,-0.0939942822,-0.0296937097,-0.033723101,-0.0157464538,-0.0355613269,0.0471236743,0.0687629953,-0.0499394611,0.0249786582,0.0482975766,0.0088374708,-0.0023287239,0.0568411276,0.0588027537,-0.0902392268,-0.0025033976,-0.0482322648,-0.0734821558,-0.0468681119,0.0742762983,0.0026939625,0.0728843361,0.0860324129,-0.0914707407,0.0306071397,0.0772395954,-0.0937425271,-0.0939203426,-0.025555959,0.0317235813,0.0297603998,0.0536151193,-0.068056792,0.0315813795,0.0791709349,0.0809704587,0.0461020395,0.066752784,0.0063565751,-0.0460217968,0.0061281375,0.0685833916,-0.0547812358,0.0296622869,0.00177617,0.0408371985,0.0410125069,0.0555119216,0.0178706292,-0.07174775,-0.0145010306,0.078250289,-0.0377272777,-0.0861353725,0.0500586331,-0.0018056777,-0.0506743863,-0.0727415085,-0.0371296108,-0.006360386,0.0154794231,-0.0370194167,0.0401425213,0.0205280539,0.0200211462,-0.0690692961,0.081480369,0.0834804177,-0.0189226363,-0.0228657108,-0.0478798039,0.0064428397,0.0401047356,-0.0674458817,-0.0048945858,-0.0035550797,-0.0141588263,0.0102958996,0.0459587239,0.0840871707,0.0591628067,-0.00371531,-0.0696857199,-0.0273653176,0.0106787989,0.0946091786,-0.0811529979,0.0036471812,-0.0558126271,0.0116772251,-0.0430193841,-0.0498565659,-0.0292970445,-0.0800030306,-0.0096152434,0.0094216354,-0.0748674199,-0.064231284,0.0356138386,-0.086488612,0.0221970659,0.0195551496,-0.0557060912,-0.0610681511,0.0585518777,0.0515652187,-0.0103025464,0.0116288625,-0.0406638756,0.0249981098,0.0190326963,0.0397617593,0.0467917137,-0.0149342734,0.0799951404,-0.0227868687,-0.0617372505,0.0165825207,0.0318125188,-0.0713759735,0.0554439835],[-0.0138606979,0.0470317863,-0.0503799804,-0.0674380809,0.0033063635,0.01621655,-0.0670902207,0.0686803982,0.037266355,0.0052015851,0.0269093048,-0.0456858985,0.044508446,0.0315610059,-0.0485858805,0.02705051,0.0045376932,0.0475808233,-0.0455753505,0.0771412775,0.0766499788,-0.0603233241,0.0315012373,0.0270413477,0.0902029797,0.0736988336,0.0137137892,0.0405010469,-0.0102099441,0.0854159966,0.0614561886,0.0349274874,-0.0407384634,0.069650434,0.0517344363,0.0717257634,0.0556534603,0.0784917176,0.0757158995,0.0425259881,0.0619144365,-0.0559711047,0.0404097959,0.0179889798,-0.0528455302,0.0258542728,-0.0489212982,0.0074602189,0.0669834241,0.0545613058,-0.0456983671,-0.0641455352,-0.0817334354,0.0458493941,-0.0451493263,-0.0160983969,-0.0773257911,0.0823613182,0.0252399314,-0.0731781274,-0.0225471146,-0.0471633784,-0.066899173,-0.0831028596,-0.0084630633,0.0800643563,0.0284921583,0.0901902393,-0.06942489,0.0167702232,-0.0570337959,-0.013240356,0.0433567129,-0.0603170805,0.0037751195,0.0456897207,-0.0142744379,-0.0199255031,0.0806143507,-0.0110351387,-0.0462801307,-0.0203746222,0.0745798498,-0.0549309701,-0.0422420166,0.0248051882,0.0711129233,-0.0295953471,0.0604045354,-0.0890326947,0.0243504588,-0.0689805523,-0.0620747097,0.0603430197,-0.0057222247,-0.0714284554,0.0480041169,0.0277863946,0.0108775701,-0.0719444454,0.066330716,-0.0685984716,0.0344471335,0.0486929603,-0.0034024355,0.0600462146,-0.082149528,-0.0146597847,0.026562361,-0.0017352455,0.060798388,0.0076067378,0.0639423355,-0.0944771245,0.0613386966,0.0969037339,-0.0767310634,0.03957697,-0.0343490988,-0.0303348154,-0.0476181284,0.0620080084,-0.0142962318,0.011056859,-0.0746246353,-0.0270944368,-0.0823203847,-0.0607593693],[-0.0802081451,-0.028065091,-0.0943878591,0.0528986566,-0.0282919351,-0.0793227702,0.0351287909,0.066444777,0.0290291924,0.04168576,-0.0186318848,0.0830406249,0.0273578092,-0.0766139701,-0.0576166548,-0.0951387659,0.0233186036,-0.0877362937,-0.0514878295,-0.0729461312,-0.0090901302,0.0075560384,0.0709801912,-0.0176595803,-0.0354295522,-0.0493697226,0.0597298294,-0.0149057247,0.0602649711,-0.0028740589,0.0391699336,0.0496576875,-0.0261040702,-0.0667099133,0.0534841903,0.0851786509,-0.0942938998,0.0043511055,0.0337674059,-0.0548622049,0.0500979051,0.0624404661,-0.0810873583,0.0823481679,-0.0893883556,0.0076855305,0.0346693546,-0.0628707781,-0.0546814017,-0.0445855558,0.0568569973,0.0855760127,-0.0707401186,-0.0707264543,0.0132952407,0.0148818381,0.0643967316,0.0404326282,0.0029551589,0.0459044464,0.0452768952,0.0182540808,-0.002570665,0.0622070096,0.0106722033,-0.0773118958,0.0278484654,-0.0520218797,-0.0594042875,0.0694311112,-0.0036891876,-0.0159984119,-0.0801396668,-0.0327071361,-0.0531631857,0.0629429147,0.0591413304,0.0643042549,0.0353004821,0.0534862913,0.0164321624,0.0709095895,0.0782025009,0.0739857852,-0.0154321762,0.010913603,0.0675122067,-0.071184054,0.0925731361,-0.0043170759,0.0257482249,0.0668986514,0.028533686,-0.0821205899,-0.0409970656,0.0498025902,0.0251322854,-0.0623866953,0.0234074071,-0.0672786534,-0.0333128907,-0.011603578,-0.0667508766,-0.0854931027,0.0410962179,0.0972522199,0.0282724611,-0.0430458449,0.0268360544,-0.0452561304,-0.0636097491,0.0404289365,0.0140316943,-0.068437092,-0.0042835376,0.0062204874,-0.0018448762,0.0655167997,-0.0292343646,-0.0628809258,-0.0285483077,-0.0103955446,-0.043491438,0.0485549867,0.054563988,0.0109605724,0.0039703106,-0.0450635739],[0.0703615248,-0.0568533503,0.0045162281,-0.0569074079,-0.0536110699,-0.0948674232,0.0375827663,0.0307479948,0.0368773974,-0.0675427392,-0.0125609273,0.003596327,0.0725882277,-0.0710740983,0.0083225695,-0.0302105919,0.0769876316,-0.0199408364,0.0886015669,-0.0105398148,-0.0911688954,0.0117018586,-0.0518106259,0.0411064699,0.0531364232,-0.0792181939,-0.0926929265,-0.0250923261,0.0267038867,0.0910797641,0.0379217677,-0.0281601232,-0.0408882573,-0.0595710389,-0.0306039341,0.0306021515,0.0582008809,0.0725812465,-0.0592626594,0.05817068,-0.0566659048,-0.0236134548,0.0900531784,0.0740665793,0.0723044649,-0.0244447831,-0.06029227,-0.0357640386,0.0733956173,-0.0461565703,0.0052652266,0.0832787603,-0.0010082236,0.0577792451,-0.0698052794,0.0646226034,0.0173238199,0.0408200063,-0.0735535324,0.0008976136,-0.0288962238,-0.0780060589,0.0059260163,-0.0149387689,0.0232896358,0.072821334,-0.0256945174,0.0002281553,0.0826618597,0.0403048098,0.0642497167,0.049584724,0.0499470197,-0.0498708487,-0.0587181859,0.0720882267,-0.0433434695,0.0916588902,0.0426579118,-0.0052064769,0.0241611842,-0.0191186555,-0.0075637894,0.070878014,0.0708943978,0.0696460903,-0.0036814583,-0.0383964814,-0.0140435537,-0.0114923138,-0.0648432672,-0.0682471097,0.0447298251,0.0685498938,0.0852476209,-0.0104729068,0.045906689,-0.0386762805,0.0180616453,-0.0275473837,0.0244333614,-0.0596628413,-0.0400505923,0.0693575963,0.0918176249,0.0429148711,-0.0372336879,0.09351255,-0.0680228099,-0.0044976119,-0.0519859754,-0.0380497575,0.0630213842,-0.0940816775,0.0338619091,0.005327879,0.0172213651,0.0187775511,0.0076427897,-0.0513977557,0.0792950392,0.0814912766,0.0120562324,-0.0148767028,-0.0305220466,-0.0047424403,0.0353238583,0.0465976223],[-0.0711661726,0.0275153853,0.0727459714,0.0449548922,0.0283230655,-0.0282563232,0.0506956615,0.0273586344,-0.0437956341,-0.004397444,0.067882143,0.084094137,0.0360122062,-0.0402716585,0.0914071947,0.0381115191,-0.0180242062,0.0194825232,-0.0494518504,-0.0468353853,-0.0429272987,-0.0384668484,0.0754482895,-0.0638059378,0.0174875222,-0.030351175,-0.0154644148,0.0860765353,-0.0112230368,0.0062797642,0.0011502804,0.0625776276,0.0022212462,-0.0928841755,-0.036434222,-0.0714104623,0.0626725778,0.0732042044,0.0853840113,-0.0943348631,-0.0030818477,-0.0029989991,0.0440109745,0.0892296582,-0.0419846587,0.0544595756,0.0530616157,-0.0940319598,-0.0427891649,-0.0650402531,0.041782096,0.0424643643,-0.080620192,0.0770744234,-0.0740852207,0.0652790964,0.0760167241,-0.0524062067,0.0542052314,0.0778187886,0.0111873308,-0.0282365084,-0.057971485,-0.0657988191,-0.0475848168,0.0018167438,-0.0402710624,-0.0713220909,-0.0132425474,0.0095127523,0.0344396234,-0.0462158322,0.0177106187,-0.0721907094,0.0362738743,-0.0277137887,-0.0177965891,-0.0713712797,0.047935769,0.0652437285,0.0929899737,-0.0818659887,0.0325371809,0.0306827947,0.0428374112,0.0329407863,0.0546096824,-0.0118056284,-0.0249129515,0.0063500456,0.0235018004,-0.0656725094,-0.0050996537,-0.037394952,0.0337001346,0.0735993683,-0.0270187594,-0.0471709445,-0.0347612016,0.0491220728,-0.0797921866,0.0306955017,-0.0717066079,-0.0844008923,0.0399594754,0.1000650227,0.0168292224,0.0581919141,-0.0592953451,-0.0608436316,0.0781870112,0.0765094534,0.0784484521,-0.0114069078,-0.0511170886,-0.034751229,0.0610315576,0.0649293512,0.0634259358,0.0705384687,0.0631971955,-0.0068064099,-0.0706749409,0.0217336286,0.0125913424,-0.0262673628,0.0692586079,-0.0920711309],[-0.0469686761,-0.0936423615,0.0729016438,0.0709804446,0.05053702,0.03086132,0.0778769478,0.0024271475,-0.0584160611,0.0759742036,0.0019075082,0.093963623,