{"model":{"name":"model_2","layers":[{"name":"x_100","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_100"},"inbound_nodes":[]},{"name":"x_40","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_40"},"inbound_nodes":[]},{"name":"x_raw","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_raw"},"inbound_nodes":[]},{"name":"lstm_4","class_name":"LSTM","config":{"name":"lstm_4","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_100",0,0,{}]]]},{"name":"lstm_5","class_name":"LSTM","config":{"name":"lstm_5","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_40",0,0,{}]]]},{"name":"lstm_6","class_name":"LSTM","config":{"name":"lstm_6","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_raw",0,0,{}]]]},{"name":"concatenate_2","class_name":"Concatenate","config":{"name":"concatenate_2","trainable":true,"axis":-1},"inbound_nodes":[[["lstm_4",0,0,{}],["lstm_5",0,0,{}],["lstm_6",0,0,{}]]]},{"name":"dense_5","class_name":"Dense","config":{"name":"dense_5","trainable":true,"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["concatenate_2",0,0,{}]]]},{"name":"dense_6","class_name":"Dense","config":{"name":"dense_6","trainable":true,"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_5",0,0,{}]]]},{"name":"dense_7","class_name":"Dense","config":{"name":"dense_7","trainable":true,"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_6",0,0,{}]]]},{"name":"dense_8","class_name":"Dense","config":{"name":"dense_8","trainable":true,"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_7",0,0,{}]]]}],"input_layers":[["x_100",0,0],["x_40",0,0],["x_raw",0,0]],"output_layers":[["dense_8",0,0]]},"weights":[[[-0.0172131974,-0.0624206439,-0.0215088818,0.0404541716,-0.0032901862,0.0778844729,0.0415928289,0.0318007767,-0.031264361,0.0002106804,-0.0885623097,0.0163278561,-0.0117115797,0.0031530533,0.0388756171,-0.0522696413,0.0305986796,0.0151052494,0.0721042082,-0.0466865189,0.0541950464,0.0621659048,-0.0485752225,0.0112345964,0.0324149765,0.0548306406,0.0784667879,0.0084875403,0.0408648141,-0.0571369268,0.0023443219,-0.002383712,-0.0160377398,0.0629343465,0.0698370934,-0.0458840616,0.0290714223,-0.0455251299,-0.0555558428,-0.0250132345,0.0540887006,-0.0038198584,-0.0640404746,-0.0124771129,0.0680715963,0.0347843468,-0.0889101997,0.026488319,-0.0900706053,0.0658656731,0.014493634,-0.0070799403,0.0806443915,0.02758893,-0.0194472373,0.0314987563,-0.0779209062,-0.0691001713,0.0433781333,-0.0101633258,0.0439676978,-0.0421758704,-0.0646287948,-0.0505549274,0.0008732676,-0.0432434343,-0.0338199027,-0.0403534994,-0.0383164771,-0.04091933,0.0780362263,0.0034485476,-0.0812752619,0.0413380116,-0.0632479042,0.0208928585,-0.026893001,-0.067304343,0.0164394006,-0.0681745782,0.0843703523,0.0753274709,0.0256901756,-0.055222217,-0.0369930267,-0.0604296662,0.0256788712,-0.0727960989,-0.0688480586,-0.000559765,-0.0424412154,0.0370993055,0.0366864093,-0.0860866159,0.0777098238,0.0909238234,0.0712247267,0.0393580385,0.0507919565,-0.0038555926,-0.0707566515,0.0282527115,-0.002810399,-0.0694613159,0.0333678834,0.0511388704,-0.0832729787,0.0585075952,0.0615379326,-0.0288105588,-0.0722835734,-0.1029979363,-0.025946131,-0.0215811804,0.0076835942,0.0056601418,0.0881576166,0.013379232,0.0755423605,-0.0130591067,0.0847382843,-0.0579954013,-0.0328797102,-0.0750092342,-0.0112717953,-0.029237682,-0.0328228883,-0.0477068909],[0.0936690941,-0.0285707209,0.0290142205,-0.0687939599,0.0513143875,-0.0295044258,0.0452280715,-0.0313849673,0.0009670819,-0.0132931396,-0.0557970218,-0.0398298949,0.0711903721,-0.0413987972,0.0141345505,0.017705163,0.0353606194,0.0931381956,-0.0292449929,-0.0681611001,0.0577711426,0.0242132358,0.0540277176,0.0126880966,-0.009100318,-0.0128635233,0.0423519164,-0.0517920144,0.0362381637,-0.0124112936,-0.0574057661,-0.0724117383,0.0103664203,0.0551779792,0.073637262,-0.0204943717,0.0106557403,0.033205539,0.067271769,-0.0087794466,0.0577849783,0.0667699203,-0.001706091,0.019906247,0.0623641573,-0.0636331066,-0.0125705507,-0.0809350088,0.0521617718,-0.0420434587,0.0450122133,0.0294852406,0.0854848102,-0.0804932788,-0.0721049905,0.0141232852,0.0368433073,0.0905651301,0.0723108351,0.0063436646,0.0836935267,-0.0471325256,0.0801308304,-0.0115783606,-0.0769102052,0.0381646678,0.0938810036,0.0024540885,-0.0801459998,-0.0454687998,-0.0144313024,0.0115117431,-0.0005086614,-0.0280217063,-0.0384299904,-0.0045043388,-0.0676131099,0.0255233888,-0.0055307248,-0.0022694783,-0.0227013063,-0.0682134032,-0.0906209946,0.0077597769,-0.0524112657,-0.0337596796,0.0367290117,-0.0064706421,-0.0344373621,0.0393077545,-0.0264901761,-0.0022175645,0.0715540051,-0.0526734553,-0.0042010793,0.0119715193,-0.0982200876,0.0880123898,-0.0664197654,-0.0039530881,-0.025372168,0.0561645105,0.0316524729,0.033873722,0.0494593829,-0.0419535935,0.0404119901,0.0108095724,0.0437366292,0.0585880652,-0.0540028252,0.0122374259,-0.0424510837,-0.0700999126,0.0197624974,0.0083171194,-0.0368099399,-0.0145986071,-0.0192429963,-0.0295284428,-0.0207655206,-0.0478728265,-0.0663268343,0.0747310147,-0.0274949856,0.0577684045,-0.0166942365,-0.052666802],[0.0010475729,0.0322723612,-0.0519456193,0.0786118805,0.0821505859,0.030810032,-0.0404751413,0.0644322857,0.0773969963,0.0449219458,-0.0637287721,-0.0403124616,-0.0291606076,-0.0105859004,0.061908666,-0.0233542193,0.0468665436,0.0748602748,-0.0060595176,-0.0231231339,0.027890468,0.0931463093,0.0276481472,0.068854019,0.0520451814,-0.0639564395,0.0716767088,-0.0334544964,-0.0247032102,-0.0322323889,-0.0922272354,-0.059105292,-0.0500843935,0.0265195817,-0.0763186663,-0.0517766923,-0.0671509728,0.0409568772,-0.0525083654,0.0400723442,0.0677322894,-0.0033507696,0.0537893847,0.009859845,0.0331065059,-0.0849088654,-0.0012174838,-0.0212342069,0.0240408313,-0.005260827,-0.0646583214,-0.0888956413,-0.0014953255,0.0027451799,0.0330647826,0.0334934071,-0.0785781443,-0.0032341953,0.0149347233,-0.0818770304,0.0058947671,-0.0867702365,0.0757862926,-0.0752825588,0.0771989524,0.0436190814,0.0683077872,0.0756025985,-0.0589621291,0.0164515339,0.0758099109,0.0127629116,0.0116932485,0.0014523744,0.0750026405,-0.0754351988,-0.0222287662,-0.0088091157,-0.0792267323,-0.0899587944,-0.0671142489,0.0885237008,-0.0201318413,-0.0445482805,-0.082594417,0.0088445693,0.0122432727,0.0436357968,0.0381171182,-0.043390777,-0.0083459364,0.0524230301,-0.0576226749,-0.022296967,-0.0002611448,-0.0408601388,0.0438489057,-0.0708516389,0.0505046062,-0.077917099,-0.0676464289,0.034093488,0.0773470029,0.0694621354,-0.0303329937,-0.0948068723,0.0552386716,-0.0657402053,-0.0210674107,-0.0365239158,-0.0541688539,-0.0978662893,-0.002008955,0.0976980925,-0.0462064855,-0.0042357254,0.0015823423,0.04212882,0.0048449058,-0.015364673,-0.0630904064,-0.0416394956,-0.0512801223,0.005827419,0.0386079662,-0.0097633293,-0.0225900002,-0.059941709],[0.0871972218,-0.0003985167,0.0734674037,0.0578061678,0.038928587,-0.0591800474,-0.0161590278,0.0468810797,-0.0841497257,-0.0549066067,-0.0613747463,-0.0930961221,0.0530927181,0.0672082379,-0.0202441104,-0.0166855846,-0.0566536039,-0.0312373471,0.0751369223,-0.0104754204,0.0254903156,0.0225438979,-0.0812149495,0.0048596314,-0.0370524935,0.0868898779,0.0245965496,-0.0998677835,-0.0636559501,0.066868186,0.0493202917,0.0284784622,-0.0056719929,-0.0424792804,-0.082466051,0.0790866017,0.0674230233,-0.0253129583,-0.0169449486,-0.0520704053,0.0670788586,0.0066994736,-0.0622385815,-0.0086811082,0.0227405019,0.0188391302,-0.0260775387,0.0295868032,-0.0280827004,-0.0278100278,0.0646751821,0.0685175806,0.0571822561,0.0731469989,-0.0787288398,0.002571706,-0.0604184903,0.0018066737,0.0397115536,0.0544133559,0.0825786814,-0.0015964013,-0.066325061,-0.0495358743,-0.0005532348,0.0545289963,0.0596650839,-0.0028901584,0.0405739211,0.078012675,0.0725658536,0.0536634102,0.0410552286,0.0499907508,0.0778440237,-0.0710507929,-0.0174818989,-0.0067040292,0.0769643411,-0.0783924162,0.0574541502,0.0873551518,-0.0879812464,-0.081533365,-0.0858764797,-0.0169363879,-0.0410072058,0.0095339185,-0.0498150736,-0.0419736803,-0.0576766767,0.0679552555,0.0446610041,0.0767839178,-0.0439128652,-0.026091313,0.0073163025,-0.0608834364,0.0293923635,0.0552630685,0.0346131809,-0.0897376388,0.0703514889,0.0034298634,0.0078571318,-0.0913170949,-0.0702676848,0.0406815931,0.0955174416,0.0610275827,0.0355490334,0.0686179996,-0.0939564258,0.0587211773,-0.0197125841,0.0156835709,0.0129788006,-0.0332063362,-0.0727069452,0.0781120807,0.0076412545,-0.060148865,0.0173310582,0.0609393455,0.0494578257,-0.0294038411,-0.0090086851,0.0810006782],[0.0911697075,0.0372158773,0.02287158,0.0035230254,0.0665701181,0.0736707896,0.0463464633,-0.0404940024,0.0739816502,0.0017557606,0.0586862452,-0.0320832022,-0.0746497512,0.0817947909,-0.0137895783,-0.0379964262,0.012613737,0.0454566032,0.0773541704,0.0588291213,-0.0767721236,0.0857357681,0.0248452462,0.0301159192,-0.0706462413,0.0925907344,0.0084344791,-0.0769129619,0.0821882412,-0.0621174723,-0.0779429674,-0.0776035488,0.0126402713,0.0555600896,0.0807892829,-0.0336771086,0.0694955215,-0.0295720827,-0.0090236953,-0.0296338312,0.0298407879,0.0191334803,-0.0111039132,0.0288862716,0.037615329,-0.0344708897,-0.0493082739,0.0707447678,0.0783229917,0.0840290561,-0.0131507367,-0.0402781814,-0.0160140283,0.0835954845,0.0537821054,-0.070221521,-0.0545836538,-0.0077681295,-0.0267326981,-0.0260818433,-0.0712828636,-0.0868569538,-0.0589740537,0.067948252,0.0388912633,0.0479924679,0.0510079861,-0.0691816732,0.0332994573,-0.0385194011,-0.0757726356,-0.0538307913,0.068830207,-0.0714841932,-0.0339290388,0.0634528846,-0.0512225889,0.0290806107,0.0600331277,0.051711008,0.0904756859,0.0349653549,-0.0486265607,0.022996394,-0.0551666282,0.0388937518,0.0717458352,-0.0472900905,-0.0529887117,-0.0823147073,0.0562758856,0.0251188334,0.0321377106,0.0183485001,-0.0275351051,0.0497985929,-0.031560719,-0.0259137284,-0.0312154479,-0.0951489583,-0.0499603935,0.0328365304,-0.0495308712,-0.0275066514,0.0464957319,-0.0878016576,-0.0870294571,0.0614079013,0.0656185523,-0.0892717242,-0.0419570096,-0.0610359199,-0.0174910575,-0.0702130944,0.0194461066,0.0487072468,-0.064370133,-0.0428443812,-0.0900830552,0.0143184075,0.0806827247,-0.0907739103,-0.0050419942,-0.0938175023,-0.0100724632,0.0590258315,-0.0812480003,-0.0703047737],[0.0601935908,-0.0269097444,-0.0286141206,0.0566699989,0.0554806776,0.0799819082,0.0753143281,-0.0288011171,-0.0224942807,-0.0505688265,0.0658294559,0.0735420883,0.0613513738,0.049850177,-0.0435421057,0.0236107167,-0.0614884868,-0.0122015551,-0.0657384172,-0.0940917656,0.0876345336,-0.0012352417,-0.0674447492,-0.0449083671,0.0775855109,-0.0331824496,0.0877482966,-0.0789393112,-0.0139571549,0.0799111575,0.0411270522,0.0681437925,0.025920894,0.0452186093,-0.0118423048,0.0111222845,0.0802185908,-0.0290706065,0.0173657853,-0.0073836083,-0.0616919622,-0.0250893775,-0.0320472308,-0.001293708,-0.0782370418,-0.0052586845,-0.0082878554,0.0800250769,-0.0527802557,-0.0372370668,0.0278928336,-0.0164058637,0.0927286744,0.0074447584,-0.0436802469,0.007465099,-0.0469709374,0.0021657024,0.0776700377,0.0771651268,0.0813090429,-0.0101845581,0.0103543652,0.0323776081,-0.0083006127,0.0452654958,0.0533377826,0.0805049017,-0.046417281,0.0813200176,0.0039383988,-0.0081616789,-0.0051182103,-0.012776426,-0.0320892073,0.0270293355,-0.0486546196,0.0624872074,0.0586042404,-0.0006679755,-0.0600833036,0.0547754504,0.0787711665,0.050048355,0.0223993771,-0.0643118992,0.0737120733,0.0707081035,-0.0571176857,0.0644821078,0.0735834166,0.0057525905,0.0733014941,-0.0709687173,-0.056900721,0.0235134214,0.038049031,-0.0243906043,-0.0917112455,0.0623181611,-0.0431244075,-0.0364978984,0.0348366201,0.0252669249,-0.020066889,-0.0025682114,0.0133094341,0.0545691624,0.0404218398,0.0476102494,-0.0724578425,-0.0602039844,-0.0331258662,-0.0344774723,-0.0639045462,-0.021947654,-0.0103366068,-0.0073112436,0.0241464395,-0.0073431158,0.0263448749,-0.0266936459,0.0364645831,-0.0025177039,-0.0262228008,-0.0360249206,0.0418386981,-0.0088644382],[-0.0046572373,-0.0081534116,-0.0345258638,-0.0582439899,0.0256559979,-0.0778968632,-0.0305793192,-0.0226321071,-0.0031164545,0.0569565706,-0.0673616379,0.019740101,0.0034702767,-0.0392656997,-0.0425377525,-0.0017995163,0.0012068662,0.061876595,0.0815341249,-0.062688008,0.025028782,-0.0547694378,0.0301079713,0.021968158,-0.0074846335,0.0895400941,-0.0513353609,0.061764732,0.059486784,-0.0618032515,-0.0375047885,0.0112417061,-0.0296322815,0.0410590172,-0.0891205668,-0.0456302091,-0.0575030968,0.0151471244,-0.0634538755,-0.0429431684,-0.0875405297,-0.013905366,-0.012060672,-0.0624824464,0.019645609,-0.01926337,-0.0279028118,0.0054342337,-0.0856110454,0.0830948427,0.0396832936,-0.0693396926,-0.0685130581,-0.0014040859,-0.0004223287,0.0915152952,0.0216500163,0.0182373561,0.007661853,-0.0745004714,-0.0058097737,-0.0420646891,0.0081294123,0.0404863879,0.0813578516,0.0149154356,0.000828163,0.0196295716,0.0012069138,-0.0701306984,-0.0131857693,-0.0538539477,-0.0094373804,0.0713401884,-0.0097173313,0.0712963343,-0.0966991186,0.0392795578,0.0464612991,0.0417485535,0.0588782094,-0.0468113087,-0.0174522307,0.0163302869,-0.0671650842,0.0225676484,0.004315393,-0.0421390273,-0.0240655877,0.0767747611,0.0218374394,0.0764535815,0.0029893371,0.0481351428,-0.028212117,0.0100775659,0.0213352628,0.0946995616,0.0345214866,-0.0008357117,0.0075928341,-0.0655741766,0.0315595567,0.008604439,0.0432613604,0.0711482391,0.0317198448,0.0746952966,0.094448477,0.0732274055,0.0211049058,-0.0784817263,0.0681271628,-0.058543101,-0.0654124245,0.0398465097,0.0384863131,-0.0771103948,-0.0588171519,0.0174043551,-0.0147224152,0.0214126483,-0.0120363748,-0.0436612293,-0.0310394075,-0.0869076177,-0.0708914623,0.0295390077],[-0.0714107305,-0.0795833841,0.0538733378,-0.0779900625,0.0268468093,-0.0667817295,0.0218260437,-0.0061382842,-0.0956047624,-0.032815516,-0.0900064036,0.0425694734,0.053379491,-0.04083848,-0.0932853073,-0.0709553957,-0.0541432649,0.0533533245,0.0142890019,-0.0573620461,0.0499283522,-0.0487130135,-0.0464666039,0.0687418431,0.0358842164,0.07177414,-0.0809828788,0.0415680856,-0.0627648309,-0.0911055133,0.0374151133,0.0428503305,-0.0058466042,0.0036136042,-0.0030903134,0.0876159668,0.0391712338,-0.0057430053,-0.0564484037,-0.0812397227,0.0279541109,0.0697215945,-0.0185365491,0.0237849299,0.0157146025,-0.0320596695,0.0717623234,0.021636609,0.0229224768,-0.075981833,0.0714013949,-0.0563610569,-0.028881764,-0.0139963878,-0.0623917058,-0.0335667096,0.0773517266,-0.044599209,-0.0139910309,-0.03850694,0.0207056329,-0.0929766148,-0.0519238301,-0.0845903903,-0.0223237202,-0.0509294197,0.0351517685,0.0834229663,-0.0334708877,-0.0779030472,-0.012913174,-0.0561770573,-0.0151797691,0.0369375944,0.0500520281,-0.0924793407,0.0526190922,0.0420166254,0.0585077554,0.0776200071,-0.0042219288,-0.0598620251,-0.0422878005,-0.0274853017,-0.085266605,0.0937838033,-0.0494303368,0.0808769539,0.0742575526,-0.0133773172,-0.0589497052,0.0499426872,-0.0228162948,0.0097514493,0.0696997195,-0.0022268242,-0.0061939405,0.0656077191,-0.0693799183,-0.0569327436,0.0264722612,-0.0919710472,0.0074742269,0.0111201201,-0.0189699233,-0.0270136874,-0.0330923833,0.0156010389,-0.0227133185,-0.0048772995,-0.0527333505,-0.0454749018,-0.0551086143,0.0357509255,-0.0948141143,-0.0833259597,-0.0230880529,-0.0995275229,0.0371035375,0.0430504344,0.0718719214,0.0779210776,-0.0957360938,0.0592638887,0.0343222581,-0.0977539346,-0.0740756243,-0.0526174754],[0.0152439447,0.0860870257,0.0538797751,0.0601978637,0.0724590942,-0.0638877675,-0.080738157,-0.0619007722,0.0192034971,0.0639901832,-0.0111413896,0.0381982177,0.0665899664,0.00036296,-0.0215439722,0.0764072686,-0.058299832,-0.0529193208,-0.0502795614,0.0127152456,0.0107693952,-0.0509413108,0.0425183438,0.0643640459,0.0030846249,0.0478274152,-0.0724761859,0.0700596198,-0.0805191249,-0.0733046979,-0.0442930125,-0.0564117357,0.029888358,0.0246396437,0.0615480803,0.0102755409,0.0089096241,0.0085359029,-0.0123555418,-0.0558028966,-0.0491769984,0.055118151,-0.0314900018,0.0516271777,-0.0522953644,-0.0645726547,0.0758926123,0.0791146457,0.0118767517,0.0291235261,0.0177045409,-0.0814179182,0.0839197636,0.0321706645,0.0411659479,-0.0701622069,-0.0530161932,-0.0359781384,-0.0213763826,0.0687852353,-0.0558151416,-0.0386774614,0.0158530604,0.0140165435,0.0705553889,0.0347561426,-0.0078339046,0.0574694462,0.0673375875,-0.0217012577,-0.0185109414,0.0572801158,-0.0735931471,0.0085114175,0.0711315423,0.071640268,-0.0758346766,-0.0711686239,-0.0562096089,0.0375885069,-0.0746702626,0.0727551728,0.0127639361,0.0665684938,-0.0137991589,0.0257745199,0.0065995101,-0.0075875977,-0.0688107908,-0.0454624258,0.0418130793,0.0248849895,-0.0743608251,-0.0522179119,0.0713011026,-0.0675702468,-0.0085031614,-0.0469914004,0.0092363469,0.0538036339,-0.0145582668,-0.0238694213,-0.0302002374,0.0714603513,-0.0542370789,-0.0418157279,0.0569740981,-0.0816926137,0.074016273,0.0062757712,-0.0431701355,0.0725937933,0.0037786108,-0.0036931748,-0.0866420791,0.0184344146,0.0504878722,-0.0188534465,-0.0891968384,0.0164765492,0.0405771919,0.0010489404,-0.0934303552,-0.0087015601,0.0025830891,0.057381276,0.0031399797,0.0826436952],[0.0747196898,-0.0035947266,0.0649682507,-0.0530694388,0.0789392963,-0.0430692397,-0.0386065803,0.0891102999,-0.087989457,-0.0698046461,0.0215916764,-0.0045048506,0.0633722916,-0.0064811269,-0.0681426227,-0.0781723633,0.0486636683,0.0791005641,0.019622134,0.0359685309,0.0541156679,0.0266685169,-0.0251057856,-0.0643910617,-0.0057830722,0.0723644495,-0.052099552,-0.0749547705,0.0757706091,0.0793135017,-0.0864382386,0.0373455882,0.0380872153,-0.0507069826,-0.0659745187,-0.0464513376,0.0848878697,-0.0202952474,-0.0363202654,0.0389410332,-0.0598247908,0.073639825,-0.0133308852,0.0269575585,-0.0698357597,-0.0313250571,-0.0611837059,0.0440587625,-0.0005430584,0.0134856282,0.0406909771,-0.0358499996,-0.0159667246,0.0519335866,-0.0051368028,0.0154963164,-0.0586033203,0.0714264289,0.0201824699,-0.0191919114,0.0310927704,0.0603760183,0.021614356,-0.0141420746,0.0484774485,0.0923915356,0.0813685432,0.0711231604,-0.0660038739,0.031945046,0.0576878823,-0.0066793761,0.0814523399,0.011479619,0.0396024697,0.0389093831,-0.0883425921,0.0380781665,-0.0779088363,0.03976354,0.0235735346,0.074148789,-0.029090168,-0.0134889046,-0.0878114328,0.0788049027,-0.0218010638,0.0255225096,0.0560850427,0.0289879031,-0.0710179582,-0.0332902782,0.0450443067,-0.0852734894,-0.0722702816,0.0827713907,-0.0332036689,0.0937077999,0.0246906113,-0.0169123765,0.0409562923,0.0720313415,0.0745706782,0.0012124815,-0.0817209184,0.0030601413,0.0648014545,-0.0755372569,-0.0226145908,-0.0922978446,-0.0363976695,0.0019601658,-0.0125797875,0.0513781086,0.0228775274,-0.0658651441,0.0462244414,-0.0122316042,-0.0567798726,-0.0711473301,0.0610394739,-0.058784157,-0.0816213936,-0.0270755328,0.0059726625,-0.074025251,-0.0878259018,0.0161989424],[0.0047857184,0.0290080439,0.0028193216,-0.0319899172,-0.0478064641,0.0635746568,0.0453222618,-0.0334527418,0.0371978618,0.0568204634,0.0418446511,-0.0101473406,-0.0812605694,0.0682737008,-0.0949778482,0.0273440685,-0.0015633709,-0.0279927179,0.0404805429,0.0384791233,0.0329873674,-0.0501505993,-0.0375383161,0.0258952845,0.030413324,0.0315767303,0.0180123784,-0.0391294807,-0.0533596724,-0.078687951,-0.07646586,-0.08157482,0.0028522247,-0.0426840521,-0.0462804288,0.025594376,0.0819753632,0.0354124531,-0.0377037525,0.0503664836,0.0132592069,0.0539994761,-0.0937116444,0.0639701188,0.0668347478,0.0255788062,-0.0006363562,0.0468351021,-0.0369806625,0.0235022865,0.0052851383,-0.0164424982,0.0359001197,0.0477627069,-0.0265286528,-0.008769271,0.0217052698,-0.0186139904,0.0070147105,0.0442044623,0.079669781,-0.0627658516,0.0446037129,-0.0713927448,0.0202126354,-0.0710181668,-0.0207214598,-0.076114513,-0.0571866594,-0.0404601432,0.0094727958,0.0555796251,0.0771731287,0.0305073671,0.0427336805,-0.0551301688,-0.0881105438,0.0923864841,0.019404972,-0.0837976784,0.0146852974,0.0595847704,-0.0150039224,0.0533920117,0.0202668197,0.0060840538,0.0566313341,-0.0469219796,0.0282751583,-0.0483037531,0.0504112057,-0.0072971839,-0.0354452245,0.015014044,0.0118044289,0.0713271648,-0.0076247258,0.0730870962,0.0598404929,0.0430677421,-0.0208632592,-0.0390347131,0.0093636345,-0.0705151185,-0.0398727395,0.0034075158,0.0121661127,-0.0474901237,0.0328075103,0.0638532937,0.027727209,-0.0712094605,-0.0722602382,-0.0623033904,-0.0829422995,-0.0991071239,0.0589436553,0.0544098653,0.0274246763,-0.0421403535,0.0305724833,0.031735599,0.0573753603,-0.0443434753,-0.0473509878,-0.0289277267,0.0148946038,0.0312243868],[0.0329290368,0.0022254202,-0.011011431,-0.0217152815,0.0378960855,-0.0823255926,-0.0108581856,0.0033985546,0.0637145713,-0.0601560175,-0.0822094455,0.0210835598,0.0242075305,-0.0148596875,-0.0284269676,0.0220565703,0.0291273277,0.0262962189,-0.017995296,-0.0739265755,-0.0723375082,0.042965468,0.0113379704,-0.014875059,0.0206471477,0.0287491642,-0.0265183989,0.0610775501,-0.0281979982,0.0268869828,0.0298220403,-0.0546624959,-0.0409390703,0.0408417955,0.0103564095,-0.0407156162,-0.0415487476,0.0345944986,-0.0457312465,-0.0737656355,-0.0278168693,0.0680481493,-0.0480595157,0.048462335,-0.0302735455,-0.0031343752,-0.0322702006,0.0199789368,0.0503163263,-0.0451005697,0.0348337144,0.0717437565,-0.0291023944,0.0468509048,0.0271052346,-0.0469410792,0.0212321281,-0.0795309469,0.0873489231,-0.0526506566,-0.0735987797,0.0219790395,-0.0573506914,0.0034389123,-0.0184253454,-0.02983132,0.0446677729,0.0916880295,0.0739669055,-0.0930339172,0.073724106,-0.0864503309,-0.0025770993,-0.0563573763,-0.0145813394,0.0374331102,0.0738188177,0.0833740532,0.0384048671,0.0629870668,-0.0622763559,0.0809871107,0.0786421821,0.0386563577,-0.064739354,-0.0751857683,0.0123065207,-0.033893723,0.0272848718,-0.0434578918,0.0580578409,0.0426503122,0.0000679642,-0.0909809247,0.0649302453,-0.0807489678,0.053664621,-0.0005829428,-0.0485680699,-0.0154846068,-0.0912564397,-0.0401384868,-0.0227970295,-0.0741484016,-0.0203695092,-0.0567397252,0.0055415193,0.0305688269,-0.0386196375,-0.0829425752,-0.0063511687,0.0014848699,-0.055208452,0.0563315526,-0.0673268586,0.0351075828,-0.0243833326,0.0053957738,0.0106434906,-0.0404882617,-0.0291130487,-0.0285387505,-0.0548795424,0.0018688111,0.0464785174,-0.0851923749,-0.0924894735,0.0393177941],[0.0595235601,-0.0167177115,-0.0545676425,0.0400048606,-0.0200756211,-0.0027906448,-0.0065323468,-0.0187291279,0.0070244931,0.0116246138,0.044028461,-0.0420457609,0.0831270143,0.0154429097,-0.0420627557,0.0091362102,0.0778593644,0.0388708189,0.050835263,-0.0425840355,-0.0588656291,-0.0728465691,-0.0441944562,-0.0737744942,-0.0267752428,0.0521870926,0.0020776724,-0.0315918028,0.0232252833,0.0614097938,0.0533598177,-0.0870791599,0.0275338925,0.0620691851,-0.0172659438,-0.0704194084,0.0665199831,-0.070441395,-0.000754217,0.0923433676,-0.0663546994,0.0004947307,0.0033198604,-0.0537629277,0.0035708586,0.0394347161,0.0001879008,0.0051782918,-0.0456330292,0.0081133926,-0.0566856824,-0.0122709367,0.0504975207,0.008170817,-0.0310938582,0.0624276772,0.0400674865,-0.0654222965,0.0388688929,0.0688559711,-0.0125242136,-0.0468168259,0.0610096268,0.0239411034,-0.0196883455,-0.0611493848,-0.0710359365,0.0610869266,-0.0752179846,0.0317888372,-0.0785683468,0.024946833,-0.0827009901,-0.0412119776,-0.0488424748,-0.0334848538,-0.0555547141,0.0384247154,-0.0172006339,0.0201071054,-0.0000847556,-0.0569079258,-0.0174742695,0.0611738749,-0.0819052905,0.0416070744,0.047925882,0.0849093273,-0.0539625101,0.0082532903,0.0315400138,-0.0120224701,0.0007184073,-0.0933848396,0.0812695771,0.0427789688,-0.0132670356,0.0770557523,0.0460726582,0.0421608724,-0.0540312342,-0.024273891,-0.0615408272,0.0461016633,-0.0694562867,-0.0549748763,0.0634555519,-0.0774698332,-0.04453611,0.0674730092,-0.0301562287,-0.04250855,0.0741821602,0.0442124233,-0.0824403092,-0.0060521611,0.029772304,0.0122942189,-0.082218498,-0.0456017368,0.055966612,-0.0679149702,-0.0237389412,-0.0010928242,-0.0325185731,-0.0088117616,-0.0549711846,-0.0074428734],[0.0708156899,0.076583989,-0.0052114232,0.0377895199,0.0810153857,-0.0849042684,0.0449104533,0.0521723926,-0.0421648957,-0.0577417947,0.0076470361,-0.0133617576,0.039582707,-0.0385820419,-0.0004413674,-0.0677078664,-0.0165937785,0.0815835893,0.0873902813,0.0683493763,-0.0101611707,-0.056628406,-0.010065305,-0.0794464052,0.0090301828,0.0720404536,-0.0299031455,0.0454198271,-0.0188207049,-0.0776216537,0.0144604677,-0.0348718166,0.0326100439,0.0533992425,-0.0696643591,-0.0615974367,-0.0116730304,-0.0724128634,0.0724201277,0.0829600766,-0.0907830298,0.0099265967,-0.0154326037,-0.0289232936,0.0398010537,-0.0805925801,-0.0484570526,-0.0671010613,-0.019436622,0.0476808473,0.0812173113,0.0410059988,-0.0397999138,0.0508438349,-0.0240136832,0.06120006,0.0435108244,0.0496978536,-0.0826771483,-0.0921468288,0.0331146419,-0.0361282304,-0.0520417392,0.0249885805,0.0353832021,-0.0621156543,0.0518972278,-0.0200526081,0.0619766749,-0.0444944687,0.042012956,-0.0425811373,0.0067293742,0.0457800701,0.0102014747,0.0354223326,-0.0851950347,0.0826590806,0.0258536432,-0.0138361575,0.0135098193,0.0571546443,-0.0171970632,-0.0117484489,-0.0124128293,-0.0540717468,-0.076960355,0.0470867418,0.0161380433,0.0516440459,-0.0241187047,-0.0343014747,0.0690037161,-0.0028274548,0.0604188144,-0.0130382273,-0.0366300792,0.0310747754,-0.0258851461,0.0059057567,-0.0008337916,-0.0135502424,-0.0085004708,0.0894563794,0.052946981,-0.0699818134,-0.0817282423,-0.0254178457,0.0769804269,0.0560297295,-0.0759014487,-0.0204229001,-0.0923471153,-0.0338321775,0.0006351152,-0.0391375944,-0.0773340091,-0.0321062133,0.0309128147,-0.0279696174,0.0044576898,0.0347492695,-0.0849502236,0.0777966008,0.0528156981,0.0079508564,0.0810389891,-0.0422897562],[0.0131460251,-0.0368101634,0.0400420204,-0.0541328341,-0.0519714244,0.0116070285,-0.0100027546,0.0075390521,-0.054329779,-0.0125217792,-0.0159948338,-0.0210684277,0.0291292202,0.081230469,0.0543761514,-0.0626437739,-0.0613051504,0.0155314337,0.0502639674,-0.0353505872,0.079598397,-0.0007715616,0.0875622034,0.0461838394,-0.0514115542,-0.0529856831,0.0069534881,-0.0412639715,0.0262183975,0.0237122439,-0.0606619082,0.0464671105,-0.0630813614,-0.021743577,0.0173369683,0.0380325168,-0.0682346895,-0.0452078581,-0.0071622641,-0.0748017132,-0.0107583674,0.0935689062,0.0486164764,-0.0179372188,-0.0618018806,0.0524756014,0.0170458555,0.0041358587,0.0171787422,-0.0468591079,-0.0640441552,-0.0417382047,0.0230892785,0.0939491391,-0.0698840097,0.0786854997,-0.0706776232,-0.0209152885,0.0731627643,0.0535399355,0.0834137574,-0.0219995119,0.0649059713,-0.0140239531,-0.0934184492,0.0755857825,0.0309677254,-0.0551001914,-0.069400467,-0.0747406632,0.0464823283,-0.0379123054,0.0632368401,0.0756496638,0.0696092546,-0.0216756314,0.001191017,-0.0454172902,-0.0045546112,0.0540959835,-0.0241873693,0.0603259392,-0.0179898571,-0.0536592379,-0.0648907647,-0.0606060736,-0.0331030451,-0.0291487183,0.0120360125,-0.0677574798,-0.0503575616,-0.0073668021,0.0674406886,0.0341063701,-0.043736212,-0.0766609088,-0.0111895865,0.0431644171,0.0423140191,-0.0263028871,0.0232960787,0.016602546,0.0072654989,0.0891970843,-0.0867979676,0.0399611965,-0.0129118357,0.0452047065,-0.0099111041,0.0504548699,0.0546311326,0.0493698232,-0.0030561786,-0.0723542944,0.0496929996,-0.0320505872,-0.0094092032,0.0627290681,-0.0282986891,-0.0824699625,0.0945708156,0.0572998449,0.0295862537,-0.0652927384,0.0653083697,0.0242254436,0.0746522769,-0.0100659113],[-0.0113666886,0.0904501304,0.0264879726,-0.0444068909,0.0490031578,-0.0542543456,0.0239665732,-0.0096810246,-0.0913736969,0.04043727,-0.0156490244,0.012877211,-0.0658478886,0.0274515115,-0.0685488582,-0.0743638426,0.02523279,-0.0249744002,0.0336257145,-0.0492253304,0.0744099766,-0.0630940348,0.0098826932,-0.0194569957,-0.0586664453,0.0941294432,0.0645055994,-0.0045505855,0.024633674,0.0468281135,-0.0714611188,-0.0650569946,0.0250059254,-0.0322237201,-0.0536743626,0.0191672146,-0.0133818649,-0.0257868823,-0.0154313501,-0.0037428108,-0.0048440606,0.045010902,-0.078204155,0.0384813882,0.0488534942,0.0291335974,0.0487372018,-0.0044058752,-0.028363796,-0.0566828102,0.0010320123,0.0500498116,-0.0289460625,0.0653023645,-0.0143673271,-0.0122425584,-0.0195459649,0.0492200777,0.0363534167,0.0709816217,-0.0154800443,0.0253991373,0.0504391417,0.0740275383,0.0697318912,-0.0357411355,0.065447934,0.093778111,-0.0780582428,0.0173230954,-0.0466009006,0.0804707482,-0.024190411,0.0739748329,-0.0327742808,0.0460919961,0.002426262,-0.0093107857,0.0543162078,-0.0576198027,-0.0076486492,0.0578015782,0.0223855656,-0.0155135654,-0.0139218625,-0.0056613386,-0.0670585558,-0.0149864471,0.0655236989,0.0806761831,-0.0570022129,-0.085309878,0.0623099841,0.0230786428,0.0270811841,0.0557945222,0.0409321226,-0.0179161262,-0.0478715822,0.0416096337,0.0776286945,-0.085108228,0.0127796279,-0.0753356367,0.0723548308,-0.0644461587,-0.0006106841,0.0331556574,0.0036253294,0.0430274718,-0.0390248187,0.0170041602,0.0181084201,0.0334628187,-0.068096064,0.0742901191,0.0414360799,0.0252225958,-0.096786797,0.0431554876,0.0300402436,-0.065698266,-0.0643996447,-0.082341142,-0.0761648715,-0.0963042304,-0.0416643545,0.0258294586],[-0.0035554126,0.0500748269,0.0422710106,-0.0642346144,-0.0058565056,0.0563449599,0.0613662079,-0.0575227886,-0.0602662526,0.0613694452,0.0680927932,-0.036483556,0.0867820606,0.0067780893,-0.045097407,0.0689371824,-0.0731268078,-0.051902134,0.0182652473,-0.049296841,0.0202957187,0.0449664705,0.0363303013,0.0024192447,0.0173230432,-0.0628133714,-0.011453812,0.0447904766,-0.0357054882,0.0315476432,-0.0876263827,0.0581112504,0.0546938367,0.0260292515,-0.0199768357,0.052166298,0.0716952756,0.0808159858,0.0632489622,0.040116176,0.0357855111,0.0279288236,-0.0520264767,-0.0127874911,-0.0055011068,-0.0325986072,-0.0090466533,0.0131302895,0.0490613505,-0.0019763443,-0.0081498232,-0.0918775946,-0.0126659013,-0.0110696489,-0.0409581102,-0.0318534337,0.0875606313,-0.0817245618,-0.0598178804,-0.0372819118,0.0081545291,0.0639471188,-0.0653634071,0.0538356677,0.033447288,0.0597158819,-0.0416868255,0.0588788874,0.0777024627,0.0538585745,-0.0474867001,-0.0336984061,0.0026357132,-0.0306922384,0.0609648563,-0.0927577466,0.0717017353,-0.0248991549,-0.0491549894,-0.045661062,0.0713541135,-0.0019810374,-0.0316325277,-0.020870829,-0.0505916625,-0.0283785313,0.0069417451,0.0922944471,-0.0335940197,0.029191453,0.0418480299,-0.0041517499,0.0523094125,-0.0257335752,-0.0246349294,0.0228160247,-0.0878726542,-0.0616739243,-0.0313163698,0.0413380452,-0.0779262856,0.0114266593,0.0644359812,-0.0030417419,-0.0027945542,0.0333962962,-0.0275596734,0.0720052049,-0.0430875458,-0.0593214147,0.0541966595,-0.0180977043,0.062970303,-0.0753053725,0.0310073365,0.053273946,-0.0658270046,0.0072274366,-0.0805359557,0.0630661845,-0.0499958284,0.0778351128,-0.0447265804,-0.0135917347,-0.0021182639,-0.0257504005,-0.0569702499,0.0764706209],[0.0489473566,-0.047599338,-0.0283230506,0.0742059499,0.0590785332,-0.0393511765,-0.0713640004,0.0934190303,-0.0189235471,0.0272169951,0.0065528294,-0.0581569262,-0.0326817073,-0.0519071482,0.0555929132,0.0843729377,0.0127512673,0.0800228864,0.0634438097,-0.0343951732,0.0836276561,0.0786840469,-0.0050803986,-0.0738029331,-0.0748198628,-0.0810305551,0.0068734987,-0.0134172048,-0.0243541356,0.0079754787,-0.0941549763,0.0452020615,-0.0422984138,0.0867769122,-0.0206632651,-0.0660839379,-0.0314136818,-0.0839567631,-0.0590338744,0.0333572701,0.0113319028,0.0069541717,-0.0601597838,0.0591860339,0.039714545,-0.079693526,-0.0737145096,0.0148737468,0.0591376089,0.0693197921,0.0639603734,0.0172700435,-0.0346177444,0.0555924624,0.0133118406,-0.0729342103,0.0614403784,-0.0025429672,0.0525802784,-0.0338442586,0.0348367281,-0.0225620382,0.0085976738,0.0357571766,-0.0648885742,0.0562811196,-0.0335121267,-0.0746297315,0.0661661923,0.004304565,0.0082847401,0.0619944893,0.0512163378,0.0411300436,-0.0467943847,0.0554381981,-0.0027770908,-0.037535049,-0.013915346,-0.0796070397,-0.0772308484,-0.0317772552,0.0381980948,0.0816674978,-0.0074239327,-0.0451980345,-0.0650731474,-0.0632476956,0.0250361525,0.041638542,0.0153464554,-0.0819232613,-0.0320612229,0.0206461176,-0.0248601828,0.0226364732,0.0633535832,0.0094303163,-0.007313245,0.0554712489,0.0195115339,-0.0368011855,-0.0002105588,0.084238857,-0.002766704,-0.024806872,0.071333155,-0.0814135745,-0.0490143076,0.0221647415,0.0182303451,-0.093657203,-0.0860659406,0.0132436184,-0.0768567696,0.0458430201,-0.0069474056,-0.0075798295,0.0372195579,0.064393729,0.01492598,0.0201822072,-0.045170404,-0.0560947098,0.0129459044,0.0378725007,-0.0248131417,0.0384401903],[-0.0060907668,-0.0493442453,0.0616706796,-0.0216193963,-0.0169813577,0.0052582426,-0.0713631809,0.0655888692,-0.0937500373,0.0828141645,0.0398411453,0.0001000131,0.082218565,0.0649635419,-0.0411827005,-0.0200907532,-0.0413499773,-0.0065511116,-0.081201531,-0.0899731666,-0.0605788007,0.0902337283,0.0342093743,0.0647141635,0.05011262,-0.0159889944,0.0616230927,-0.0173750054,0.0189224742,-0.0223422311,-0.0243966933,-0.0881056711,-0.0140282223,0.02130723,-0.0871733576,0.0774972886,-0.0315350816,0.0148354229,0.0203783624,-0.0078002778,-0.0456791259,0.0551253036,-0.0294782035,0.0369966663,0.0056324913,0.0590619594,0.0288261771,-0.019240696,-0.0089038117,-0.0726307184,0.0222256389,0.0397963822,0.0096889781,0.0017433451,-0.0680778325,0.0726460293,-0.0227734484,0.0603957251,-0.0426874831,-0.0679552183,-0.0099397125,-0.0931375399,-0.0691903755,0.0813869238,0.0614469945,-0.0517308153,0.0226793513,0.0344566293,0.0361105315,-0.0413500629,0.0287477337,-0.0276359152,0.0065750801,0.0116325421,-0.0059121097,0.0320878699,0.0008696429,0.038547419,0.0840787217,0.0364327282,-0.0049356204,0.041762244,-0.0791013539,0.0376601405,-0.06020239,0.0873135254,0.0877606943,0.0673754588,-0.0269028582,0.0035479018,-0.0066179587,-0.0050606681,0.0126669072,-0.0267094746,-0.0888427719,0.0245855227,-0.0145633882,0.0287168529,-0.0503039323,0.0482700616,0.0583278127,0.0736596361,0.0225175451,0.0930145681,-0.0895326212,0.0042888597,0.0095204934,-0.0408911295,0.0051907976,-0.0890558884,-0.0561650358,-0.0420721062,-0.0174592808,0.0444839299,-0.060701903,-0.0257988553,-0.0165297985,-0.0507887416,-0.0938639641,0.0209069625,-0.0059277075,-0.0549111739,0.000297664,-0.0016536741,0.0146166598,-0.063203156,0.0273408666,0.0601233654],[-0.0562637374,0.0032393476,0.0349599421,-0.0659178719,0.0339306407,0.0006211859,0.0489188656,0.007724497,0.0325365253,0.0169085525,0.0070485845,-0.0206903704,-0.027149437,0.0811621323,0.0574066751,-0.0397520624,0.051280506,0.0721903145,0.044526305,0.0521415547,0.0019380334,0.0068397773,0.0194813348,0.076720655,0.000916083,0.0186519586,0.0412851833,-0.0336656161,-0.034896709,0.0336515382,-0.0445792638,-0.0831786022,0.051794935,-0.0448042415,-0.0764341056,0.0499718636,0.0820254162,-0.071427539,0.0425145812,0.0819259956,-0.0655540302,-0.0779905468,-0.045929417,0.0504413582,0.0529322699,0.081867151,-0.0285935178,0.0395529345,-0.0902452171,0.0232482143,0.080656074,0.0528723449,0.0817530006,0.0018436521,0.022642985,0.0599517897,-0.0609812327,0.0835586414,-0.0092202323,-0.0221737511,-0.0627389401,-0.0795221776,-0.021492634,0.0727117509,-0.093106553,-0.0261991024,0.0655691251,-0.0102220038,-0.0064568641,0.0599544495,-0.0530343913,0.0162448529,0.0332078636,0.0321191438,0.0198392011,0.0664229095,-0.0036530478,0.0442800894,0.0357009694,0.0381209403,-0.0480892994,0.074580282,-0.0190631468,0.0320576578,0.0807697251,0.0732777342,-0.0175762046,0.0715351924,-0.0794147551,0.0586588718,0.0281690471,-0.026374815,-0.076526992,0.036144834,-0.077816397,-0.0080196187,-0.0502621271,-0.0289899409,-0.07836283,0.0299837925,0.022398686,-0.091470249,-0.0872277096,0.089793548,-0.0726060271,-0.0914738253,0.0400592946,-0.0803657249,0.0968871862,0.0084168883,0.0409214385,-0.0727474466,0.0494323075,0.0183536336,0.0497879796,-0.0199250281,-0.0368626714,-0.0965691656,-0.051096458,0.0788858384,0.0703375936,-0.0914367288,0.0668960363,0.0110058039,0.0593504831,-0.048964154,-0.0191804562,0.0389432833],[-0.0073432829,-0.0061989361,0.0570913032,-0.0211607646,-0.0711512715,-0.0919292569,-0.0672107562,0.0172477551,-0.0270309616,-0.0582677796,0.0046059284,-0.0118344724,0.0099577494,0.0410717465,0.0527601652,-0.0604675189,-0.0018148131,0.0404495522,0.0848133042,-0.0873241574,-0.0421942249,-0.0518999659,0.0560552441,-0.0450902581,0.0340996049,-0.0749565288,-0.0670947954,-0.0721617565,-0.0280999262,-0.0103022344,-0.0771618187,-0.067391254,-0.035416428,0.0487184003,-0.0227747746,-0.0771511793,0.0088216038,0.0479655042,-0.0650885105,-0.0616837032,0.0404489487,0.0746404827,0.0451700017,0.0185802374,-0.0152034163,-0.0625635684,-0.0057695159,0.0626866519,0.0366795585,0.0633599758,0.0618828721,-0.0784255117,-0.0150069129,-0.0571197048,-0.0340846628,-0.0160290804,0.0641673803,-0.0791394264,-0.0037051036,0.0778454691,0.0742555186,0.0193255544,0.0107749058,0.0547182783,-0.0538220145,0.0030923637,-0.0170272049,-0.0097791711,-0.0271099042,0.0517555736,0.029556822,-0.0874875635,0.0020597014,0.0647327527,0.010150848,0.0157734826,-0.0303244628,-0.0379241891,-0.0086365752,-0.0131827043,-0.009609608,-0.0150177218,-0.0705274642,0.0294145998,-0.0625222623,0.0355869755,0.0509487018,-0.0663879365,0.0746788532,-0.007867489,0.0113451956,-0.0156793762,-0.0238681454,0.0678220615,-0.0432160385,0.0240021497,-0.0370039344,0.0398333818,-0.0647139996,-0.0273214448,0.0302290022,-0.0108793201,-0.0100112837,0.0020657659,0.0081473766,-0.063808836,0.0097287968,-0.0732248724,-0.0754606798,-0.0902309865,0.0121307401,0.0742411911,0.0163184553,-0.0360162854,0.0623708218,-0.0372428112,-0.0575178638,-0.0034469264,-0.0231640544,-0.0156118227,-0.0740396306,-0.0425969511,0.0546068177,-0.0723135248,-0.0005745487,-0.0340297893,0.0222263373,0.0414257124],[0.0700636134,0.0941387936,-0.0370039195,-0.0640287846,0.0111926589,-0.0401491039,0.0822608322,0.0114603033,0.0528029688,0.0498080216,-0.005780342,-0.0544168837,-0.0191622954,-0.0704921708,-0.0225829482,0.035781268,-0.0040794965,0.0664918795,0.0336340219,0.0553351194,0.0421208441,-0.0460234769,0.0564939193,-0.0201508533,0.0027642574,-0.0679329336,0.0754591301,-0.0166985374,0.0687370822,-0.0939232856,-0.0628249869,-0.0493432358,0.0733729079,0.0470926687,-0.0469790399,-0.0397788957,0.012079115,-0.0263822284,0.0747850463,0.0101765795,0.075525105,0.0755293667,0.0545493886,0.0219380576,-0.0187749453,0.0854822919,0.0424513109,-0.0609690472,-0.0130280489,-0.0305732377,-0.0041213157,0.0417419374,-0.0143081965,0.071437791,0.0525308251,0.0564150885,-0.0288679115,0.0447346494,-0.0192742385,-0.0459460393,-0.0599180944,-0.0286015272,0.077615425,0.0344570205,-0.0697691068,-0.0793201774,0.068860203,0.0166986622,0.0126354499,-0.0348384008,-0.0116109317,-0.0009930856,-0.0818609372,0.0176188014,-0.0766277313,0.0183968097,0.0101333186,0.0724247098,0.0218789447,-0.0864871293,-0.0008373169,-0.0451783128,-0.0723298565,0.0681544989,-0.075759083,-0.0272359252,0.0185637828,-0.0222445149,0.0532181785,-0.0616614446,0.0710295364,-0.0721981227,0.065247938,0.0683524981,0.0685182512,-0.0556522384,-0.0042358018,0.0145131312,0.0264219344,-0.0441703945,0.0661429837,-0.0941907689,-0.0633742213,0.0837711096,-0.0660504922,-0.0919200853,-0.0987519622,-0.0193017982,0.0273030624,0.018192945,-0.0254967399,0.0773129463,-0.0829318166,-0.0157146677,-0.0207471866,-0.0072256662,0.0392477252,0.0667890683,-0.0268232226,0.0719827116,0.095901534,-0.0137212127,-0.0341483317,-0.0874404386,-0.0758436695,-0.0607408397,-0.0846507475,0.0365237072],[-0.0333410427,0.0531115644,0.0408368483,-0.0543215573,0.0532270558,0.0802432001,0.0718952417,-0.0310369059,0.0473774709,-0.01767697,0.0172756854,0.0109930485,0.0484865606,0.0253789015,0.0197924264,-0.0781791583,0.0489965901,-0.0194339026,-0.0327207372,-0.0970589519,0.0036554744,-0.0719955713,0.0401726626,0.0627321079,-0.049125798,-0.0758388788,-0.0762201548,-0.0356730595,0.0422058254,-0.0455049872,-0.0400984176,0.0283500422,-0.0800498277,0.0430830047,-0.0199043341,0.0457513332,-0.0117201852,0.0198963229,-0.0085073477,-0.0466563739,-0.0737240389,-0.0812709033,-0.091725491,0.0273625161,-0.0306786094,0.0371279716,-0.0867856964,-0.0530786514,0.0576752461,0.0208600052,0.0670551881,-0.023992531,0.0548684634,0.036799781,-0.0268770754,-0.0441418588,-0.0354764685,0.0296618529,0.0346259214,0.0007703587,-0.0789622664,0.0531993434,0.0632073879,0.0211131535,0.0605415329,0.0191226788,-0.0519056618,0.026654195,0.0118454946,0.0565212332,0.0090323174,-0.0602649972,-0.0620356388,-0.0305682067,0.0112221297,-0.0304648057,-0.0608088151,0.012276601,-0.0554850623,-0.0494919866,0.0441106819,-0.0191838983,-0.0153455539,-0.0402425751,-0.0332550853,0.0880393609,0.0435056016,-0.0057211583,0.0153954672,-0.0382034779,-0.0265100859,-0.0643305182,-0.0331627429,-0.0159564745,-0.0699926019,0.0262647942,0.0401581563,-0.0122711463,-0.0411178507,-0.0545064695,-0.0848767906,-0.0216391683,-0.0418373942,0.0360933319,0.0620968789,-0.016949499,0.0600712672,-0.0460957177,-0.0655000359,0.018277375,-0.066189982,-0.095810622,0.0561827421,0.0053480356,0.07460659,-0.0807425529,-0.0308509711,0.0257109962,-0.0654784217,-0.0930897444,-0.0016695079,-0.0593017861,-0.0801406652,-0.0884622559,0.0314797126,0.0383912399,-0.0804168433,0.0034944869],[0.0905639306,0.0208535101,0.0247451253,-0.0093083959,-0.0076814243,-0.0247972868,0.0822975934,0.0317046717,-0.0655187368,0.0424024798,-0.0169707816,-0.0300837047,0.0704990327,0.0477404557,0.0368629731,0.0251552742,0.0740587488,-0.0115381703,-0.0654391423,-0.0460009798,0.0358697847,-0.0621677227,0.0783870071,-0.0480499752,-0.0273692179,0.0726932585,-0.0171588957,-0.0657225922,0.0252041128,0.0072538531,0.0550929122,0.0015736127,-0.0439723842,0.0523472205,-0.0450878926,-0.0816709995,-0.0384464301,-0.0096008247,0.0664720163,-0.0690868571,0.0520213097,0.0622344986,-0.0929340124,-0.0868171826,0.070389621,0.0618368909,-0.055399105,-0.0059877825,-0.0555873848,-0.069908075,-0.0774606094,0.0607989132,0.0533148088,-0.0278979372,-0.0835677832,0.059940435,-0.070440501,0.0749691799,-0.0503029302,0.0426106639,-0.0272209663,-0.0593760461,0.0149142109,0.0249138065,-0.0235598385,0.0279928111,0.0315747224,-0.0057087508,0.033783894,0.0714637339,-0.0517386496,-0.0138108348,0.0243244208,0.0770159513,0.0667534173,0.0013302502,-0.0433807299,-0.0763896778,0.0130283972,-0.0737023652,-0.0288808141,0.0330426209,0.0275977235,-0.0007313994,-0.060169138,-0.025563471,-0.0356824361,-0.0399121381,0.0580516942,-0.0339159369,-0.0225360766,0.0773971826,-0.0028957119,0.04427002,0.0806781501,-0.0022022522,-0.0868174732,-0.0226624459,0.0692022517,0.0058257496,0.0639353171,0.0478155799,-0.0216444097,0.0587356873,0.040119525,0.0318940803,-0.0781590641,0.0671115741,0.0494137257,0.0710600019,0.0576090775,0.0678804368,-0.0888451189,-0.0574993864,-0.0812054649,-0.0948763341,0.0612724833,-0.0491965823,-0.0940058678,-0.03658076,0.0012007824,-0.0915195346,0.0641152263,-0.0699177757,-0.0139862914,0.0459479168,0.0249133669,-0.0394307598],[-0.0579530969,-0.0653046593,-0.0336979032,0.0824373066,-0.0815283805,0.0146098714,0.0515260473,0.0701800585,-0.0113521265,-0.0218056645,-0.0701114535,-0.0308482759,0.026792055,0.0391189046,0.0152542293,-0.0637673885,0.0416138098,0.0517622679,0.0397659652,0.0647366196,0.0724392682,0.0356516652,-0.0291962065,0.0495057404,-0.0293256324,0.0824831277,-0.0100897979,0.0225589741,0.010635132,-0.0878919587,-0.0368005596,-0.089402318,0.0921940431,0.0059345709,-0.0573840961,-0.0466924086,-0.0722416937,-0.0226495694,0.0881134793,-0.0205194149,0.0695958585,-0.0784724429,0.0525446758,-0.0438729115,-0.0804533735,0.0110458564,0.0175140128,0.0762937218,0.0530412868,-0.065432705,0.0762581155,-0.0229169354,0.0552775003,-0.0418505929,0.0770339966,-0.0603847839,0.0836839899,0.0184983648,-0.0135000283,0.0391476192,-0.0321654491,-0.0680133179,-0.0541673116,-0.0317091383,0.007834482,-0.0020494389,0.0575996935,-0.008572706,-0.0935559124,0.044060301,0.0186468028,0.0526689962,-0.0571990944,0.057712473,-0.0112358872,-0.0755368695,-0.0354300961,0.0782535523,0.0704477057,-0.0781516209,0.0397424884,-0.0629696622,-0.0586207956,0.0064956853,-0.0814965069,0.0115772206,-0.0009073104,0.0010557255,-0.0924088508,0.0669430792,0.0207495131,0.0208992157,0.0139026223,-0.0900191739,0.0731159151,-0.0580102764,0.0777712762,-0.0025054773,0.0704799071,0.0424893089,-0.0868019313,0.0461127944,-0.0916311741,-0.0446601473,-0.0278802328,0.0271465369,-0.024057908,0.0537075773,0.077358067,-0.0065737865,-0.0383932628,-0.08690501,0.0672352687,-0.0638547987,-0.0843920782,-0.0154003818,0.0691465363,0.0296380781,-0.0747325271,0.0573071577,-0.0571196564,0.0709852278,0.0603206903,0.0138845565,-0.004305989,0.0090849707,-0.0024860124,-0.056112323],[-0.045735091,0.001033619,0.0167119969,-0.0736776441,0.0720443949,-0.0274124108,0.0137707815,-0.0650504157,-0.0555634312,-0.0248497445,0.0182785038,0.0518488139,-0.0306547675,-0.0338164605,0.0051926561,0.0163493678,0.0066873617,0.0737405866,0.0681075528,0.0216844697,0.0347482935,0.0231138151,0.0429957621,0.0003305123,-0.0644050092,-0.0125002414,0.0495980643,0.0507580042,-0.0191407558,-0.0454134271,0.0018265034,-0.0277622771,-0.0251134932,0.0443341956,0.0468634441,0.0360958502,-0.0194997638,0.0374243632,-0.0206599422,0.0620150492,0.0588514693,0.094107464,-0.0218198933,0.0249111298,0.0201163329,0.0034409857,0.0232760683,0.0501806214,0.0496331081,0.0301178508,0.0745866969,0.0445915759,0.0300501175,-0.0638154149,0.083521843,-0.0695546865,-0.0051712086,0.0531952009,0.0077938922,0.0187986139,-0.0335876979,-0.0316831321,0.0583568066,-0.089398548,0.0776040554,-0.0571883619,-0.0545135774,-0.0240609832,-0.0370629802,0.0692714602,0.0815275609,-0.0012124309,0.0856435299,-0.0059062666,0.0496849976,-0.0226194561,0.036033608,0.0174685698,-0.0316260383,0.0759666935,-0.064200446,0.0353837982,0.0773715302,0.0514051355,0.0496801324,-0.0166771822,0.037144132,-0.0482939668,0.0319138244,0.0594465658,0.0180940945,0.0124454917,0.0152577795,-0.0119197732,0.0328565165,0.0234874636,-0.029415302,-0.0704777613,0.057934422,0.0492734388,0.0490029044,0.0389132835,-0.0514609106,0.0037303902,-0.0911853462,-0.0945676044,-0.0654177442,-0.0625922903,0.0559986234,0.0687149763,-0.0654202774,-0.0893977433,-0.040444836,-0.0644532889,-0.0762976632,0.0459007323,0.0379581861,-0.0663899928,-0.0598998144,-0.0945540816,0.0215315018,-0.0551697016,-0.0228829645,-0.0697772801,-0.0668170899,-0.0034718763,-0.0632091537,0.067785196],[0.0328774266,-0.0637244359,0.0779337883,-0.0535952486,0.021160258,0.0068736551,-0.0169577375,0.0119675687,