{"model":{"name":"model_2","layers":[{"name":"x_100","class_name":"InputLayer","config":{"batch_input_shape":[null,100,246],"dtype":"float32","sparse":false,"name":"x_100"},"inbound_nodes":[]},{"name":"x_40","class_name":"InputLayer","config":{"batch_input_shape":[null,100,246],"dtype":"float32","sparse":false,"name":"x_40"},"inbound_nodes":[]},{"name":"x_raw","class_name":"InputLayer","config":{"batch_input_shape":[null,100,246],"dtype":"float32","sparse":false,"name":"x_raw"},"inbound_nodes":[]},{"name":"lstm_4","class_name":"LSTM","config":{"name":"lstm_4","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_100",0,0,{}]]]},{"name":"lstm_5","class_name":"LSTM","config":{"name":"lstm_5","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_40",0,0,{}]]]},{"name":"lstm_6","class_name":"LSTM","config":{"name":"lstm_6","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_raw",0,0,{}]]]},{"name":"concatenate_2","class_name":"Concatenate","config":{"name":"concatenate_2","trainable":true,"axis":-1},"inbound_nodes":[[["lstm_4",0,0,{}],["lstm_5",0,0,{}],["lstm_6",0,0,{}]]]},{"name":"dense_5","class_name":"Dense","config":{"name":"dense_5","trainable":true,"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["concatenate_2",0,0,{}]]]},{"name":"dense_6","class_name":"Dense","config":{"name":"dense_6","trainable":true,"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_5",0,0,{}]]]},{"name":"dense_7","class_name":"Dense","config":{"name":"dense_7","trainable":true,"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_6",0,0,{}]]]},{"name":"dense_8","class_name":"Dense","config":{"name":"dense_8","trainable":true,"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_7",0,0,{}]]]}],"input_layers":[["x_100",0,0],["x_40",0,0],["x_raw",0,0]],"output_layers":[["dense_8",0,0]]},"weights":[[[0.051138632,-0.057821326,-0.1012180448,-0.0291384608,-0.0907326713,-0.107940957,0.0787673444,-0.0561549552,0.1304841936,0.1269002557,0.0216488801,0.0865332261,-0.0648819208,0.0044384105,-0.0753625557,-0.0537662245,0.0674164519,-0.0201227888,0.0726385787,0.1044791341,-0.0965247676,0.1264085621,-0.0477659032,-0.1125212908,-0.0043586055,0.1005843431,0.0388957486,-0.01328965,0.1063847765,-0.1208843589,0.0149943121,-0.1213970259,-0.0417108499,-0.1061948687,0.0216398127,-0.0128690749,0.0864694044,-0.14877747,-0.0408220142,0.0550007373,0.1101443693,0.0441005789,0.119932197,-0.002988003,-0.0577569418,-0.0847035423,-0.1199666336,-0.0817925483,-0.0055607269,0.0984835178,0.0443555899,-0.0756699294,-0.0415715948,0.0730112344,-0.1358468533,0.0376931541,0.0142693054,-0.0245290194,-0.0938775688,-0.0105489371,0.0925006047,-0.0990155339,-0.0953921229,-0.0417735055,-0.0347127654,0.0377978161,0.0280385613,-0.0727406517,0.1160162464,-0.0363514908,-0.1077793166,-0.0884932056,0.1118113548,0.0294743162,-0.0122982617,-0.0903147981,0.0764407516,0.0967192426,0.0089263069,-0.0459758565,-0.1176884025,-0.0307524893,-0.0701607391,-0.1250198036,-0.06903442,-0.0902988538,0.0843957961,-0.0809907839,-0.0560703687,-0.1150737256,-0.0954214334,-0.1002297774,-0.0605091974,0.0733203366,0.0855840966,-0.0469716378,-0.0637663305,-0.0137562854,-0.0416596122,-0.0094778091,-0.0621343479,-0.1026859656,0.0741445869,-0.0678401589,-0.1044770703,-0.00695812,-0.0621895082,-0.0025333641,0.0030210665,-0.0341124237,-0.0496923663,0.0847856104,-0.1267172694,0.0605724677,-0.0425491743,-0.055726435,0.0461540967,-0.05874395,-0.0087496014,0.0591406859,-0.108700417,0.054465495,-0.0195411593,-0.0140706515,-0.0132189877,-0.0854570568,-0.0008718098,0.100766249],[0.1027509198,-0.0267328378,-0.1033976376,0.0651259348,-0.1264956594,-0.0845160559,-0.0754664838,0.0812494606,0.0248305965,0.134817034,0.0396895036,-0.1064363867,-0.0806578696,-0.0179664642,-0.0611092411,0.0152396448,0.0325815603,0.0927319154,0.1262333989,0.0884560943,-0.0225573629,-0.1151847914,0.0264241565,-0.0154712955,-0.1078479514,0.0381855033,-0.0967832804,-0.0257612243,0.0052479575,-0.0671522617,0.1024241969,-0.1055027917,0.1133907437,0.0903710574,0.0277556665,-0.0350438356,0.1054688767,-0.0443802662,0.002747712,0.0726297274,-0.0358457938,0.0608225539,-0.054144986,0.0020236175,-0.0310009234,-0.0624402985,-0.0520023294,-0.116549775,-0.1046130806,-0.0183998104,-0.0722752288,0.0670389384,-0.0252860133,-0.1042531282,0.0182719696,-0.0678256825,-0.1356845796,-0.0841302276,0.0762380809,0.084519811,0.0359271914,0.0024975489,-0.0791578367,-0.0521615483,-0.1165345162,-0.0732490495,-0.0541335568,0.0037452828,-0.0059496667,0.0954032093,-0.1232168823,0.1011637822,-0.105516471,-0.0519173071,-0.0783427507,-0.0005950015,-0.0951409787,0.0874813721,0.1020508185,-0.0532760061,-0.0330514126,0.0410990007,0.0065319459,-0.0747999102,0.1011308506,0.1111444831,-0.1161046401,-0.0598589219,-0.0649103075,-0.0930146948,-0.0129039222,0.0939541608,-0.0955163613,0.0347823501,0.0486566611,-0.1090366393,-0.0487566106,-0.0329122692,0.0372231305,0.1106955186,0.0006092319,-0.1200038567,0.0206324849,0.0554527938,-0.0804144889,0.0779845938,0.0859019011,0.0521546043,0.0896195918,-0.0464706533,-0.0762107447,-0.0276864097,-0.0055255154,0.0797121227,-0.041436933,-0.1228264123,-0.0206946507,0.1002781615,0.0782256871,-0.0230572373,-0.0165303722,-0.0087616965,-0.0984416232,-0.0883375704,0.0564235188,0.0265810546,-0.0653961152,0.0937742814],[-0.0429784432,-0.1188912913,-0.1267678291,-0.0816379786,-0.0306684803,-0.0983778611,-0.0452057533,0.0785613209,-0.0905962214,0.0685596615,-0.0601160303,0.1162794009,-0.0500914119,0.0125382841,0.0416889191,0.0449822061,-0.0001808191,-0.0225929134,-0.0476748832,0.0955555663,0.007092624,0.0020807136,0.1065982357,-0.0545198955,0.0708439127,-0.0619388595,0.0069110226,0.03799152,-0.0885360539,-0.0086475909,-0.0995110199,-0.0853822529,-0.0347798876,-0.0568321943,-0.1382978857,0.0958656147,-0.130179435,-0.1148292497,-0.0942042843,-0.0036620614,0.0061967368,0.0627900511,0.1272203326,0.0091207577,-0.1301920414,0.0050241887,-0.117947571,0.0117020635,0.0059571061,0.0903206542,-0.0544119775,0.0065989327,0.0573139749,0.0297598373,0.0758400261,-0.1029779762,-0.0174215529,-0.1006671414,-0.1011461243,-0.0715717971,0.1265443563,0.0767012089,-0.0880625173,-0.0536824428,-0.0323169529,0.1228717119,0.0665594861,-0.0303527787,-0.0618660115,0.0369876884,0.0168342665,-0.0139629552,-0.0566961169,0.0067968224,-0.0861909166,0.0541125536,-0.0100028412,-0.0559631996,0.1025999114,0.1034808606,-0.0674241334,0.1252309382,0.042603977,0.0720409229,0.0539641529,0.0533230305,0.0316274576,0.0878649503,0.0324387103,-0.1081336364,-0.0208500512,-0.1103586257,-0.0667348653,-0.0712474734,0.0007767638,0.0888046026,-0.004020568,-0.109845452,0.0159007534,0.0505734831,0.0339830816,-0.0587478019,0.0312761813,-0.0232245196,0.0696951523,-0.0883982927,0.0824238881,0.0346046574,-0.1240108162,-0.002439176,-0.1413473338,0.0797075704,-0.0719249547,0.0365080163,-0.1323889047,0.0723844841,0.0449383371,-0.1257698685,0.1056562737,-0.0192023683,0.0200668834,0.1017357036,0.0442161746,0.0436006635,-0.0609043203,-0.0015473618,0.0430729091,0.0713422522],[-0.1051683724,-0.0369971804,-0.0348158032,0.0165070537,-0.1278693676,-0.0326271467,-0.1092741564,0.1037682965,-0.1150968373,0.0320832133,0.0658215582,0.104832001,0.0532946661,0.0900482759,-0.0910068527,0.0178364422,-0.0364294574,0.103697136,0.0803120583,0.052574072,0.0115658771,0.0094754491,0.0631882101,-0.0815124065,0.0292886794,-0.0956502408,-0.1123231426,-0.0477439947,0.0433494858,-0.0629561394,-0.0981562138,-0.0333150998,-0.0638002232,-0.0350024365,0.0443206094,0.1243696734,0.0322291479,-0.1327829808,0.0570579432,-0.066527985,-0.0451486744,0.0105818016,0.0780713558,-0.0281199198,0.0558012202,-0.0084255449,0.0325794518,-0.012660644,0.0860389546,0.0554470345,-0.1099911928,-0.1068638638,-0.1237960234,0.0179894771,-0.0036331755,-0.125054419,-0.0419857427,-0.0477825888,-0.1103026867,0.0506193973,-0.0650903732,-0.0461384244,0.0421229377,-0.0770230815,0.0560191385,0.0177397989,-0.0714821965,0.1225126088,0.0590242594,-0.1184045672,0.1205066666,-0.1289421916,-0.1230718717,-0.0989074036,0.1237892732,-0.0913555846,0.0854968205,0.0450965762,0.0062915795,-0.1310083121,0.0857816637,-0.0211460218,-0.0465317667,-0.0221354198,0.0250585191,0.0596266314,-0.1087551266,0.0252310913,-0.0627211183,-0.0148983784,0.0599842556,0.0816223696,-0.0768437013,-0.0202452131,0.0934590772,0.0705517903,0.0041126744,0.0730858222,0.0395956449,-0.0676377341,0.0103446096,-0.0771002918,-0.1271127909,-0.0037757186,0.0862543732,-0.0361743569,0.0572644435,0.1164133698,-0.0915785208,-0.0827436969,-0.1183959171,0.0828289613,0.0171817075,-0.0658445433,-0.1620035022,-0.0691821054,-0.0682304427,-0.024496818,0.0227568112,0.0704752877,-0.1074418575,-0.0424139835,-0.0757849663,0.0892328545,-0.0611012578,-0.0419772863,0.0833001137,0.1084431037],[0.1107350662,0.0860775784,-0.0064395415,0.1022608355,-0.0675281733,0.0725417584,0.0641002879,0.0205653645,-0.074812673,-0.0992062613,-0.0274473783,0.0474450402,-0.1219530553,0.0714914203,-0.1065574139,0.0156334117,0.0656260923,-0.0023425166,-0.0070337923,-0.001448635,-0.0610493757,-0.0563514605,-0.1007826403,0.1070001721,0.0841233134,-0.0882896483,0.0235206913,-0.1039140448,0.0641616434,-0.1209234744,-0.0568653308,-0.0236560591,-0.0368155614,0.0806128681,0.0342816859,-0.0188693125,0.1081750244,-0.0609093048,-0.0059235776,0.0145006515,0.0522302426,0.0541216619,0.0995699167,-0.0390333384,0.0809870362,-0.0987767503,0.0265748091,0.091702573,0.0629326999,-0.038568303,0.1235803664,0.094543688,-0.1252213269,-0.1222002208,0.1086832955,0.0341661833,-0.1057595313,0.0161043499,-0.0473019853,-0.0775444731,-0.0692381114,0.0045822458,-0.0462523326,-0.0861042142,0.0817965344,-0.1241528913,0.0188917741,-0.1212131158,0.0156554896,0.1065281406,0.0197438411,-0.0132062715,0.040963836,-0.053247869,-0.0152523005,0.105158478,-0.0102491481,0.0055884495,0.0836425722,0.1301591992,0.0934925973,-0.0648258626,-0.0090977028,0.0747773796,-0.0965047032,-0.0556467511,-0.0689842254,-0.0808839798,-0.0869135261,-0.0351479612,-0.0284869466,-0.0167302191,0.0137266451,0.0216426309,0.0448171571,-0.0844323039,0.0917963535,0.0393388458,0.0019572,-0.0733523667,-0.1270759851,-0.0547554642,0.0708285868,-0.0615145341,0.0704683438,-0.0727557465,-0.0833493173,-0.0756532699,0.0876249745,-0.0123508843,0.0625542328,0.0121045206,0.0316512845,-0.0527429171,0.0560042486,-0.0290747825,-0.0978846401,0.0140932342,-0.1353408098,-0.1277132332,-0.0119748712,0.0876605958,0.0053357952,0.0864053965,0.0861666948,0.0860017166,-0.1408862621,-0.0883837342],[-0.0770119131,-0.0194990337,0.0156235276,-0.0886372253,-0.1119388789,0.1078020483,0.0391455814,0.1102311909,-0.0655518472,-0.0699813515,0.0954393148,-0.0764031038,-0.145689413,-0.127045542,0.0445067771,-0.0696059912,0.023921214,0.0125620961,-0.0394165926,-0.1133188754,-0.1050939411,0.1131254956,-0.0759679452,0.0616869628,0.0412312187,-0.0278044064,-0.06706357,-0.0286412314,0.0039653028,-0.0435827412,0.034686055,-0.0408244431,-0.1121357381,0.1064781472,-0.0649820045,0.0623971373,0.1109285355,-0.0992159918,0.0604533292,0.0130328182,-0.0116971135,0.0776279122,0.0605814233,-0.0057630972,0.0930350423,-0.1063646227,-0.0848322883,-0.0245212186,-0.1105859205,-0.0997777581,-0.0414823256,0.0745202452,-0.1204939485,-0.0131785255,-0.0043420596,0.0587026514,0.0113475285,-0.0729380101,-0.069864668,-0.0901212767,-0.072546117,-0.0411577076,-0.0216240827,-0.1262749881,0.1062729135,0.060690552,0.0073215761,0.030218808,0.0086275795,0.1083121747,-0.0644049495,0.0611669011,-0.0770610124,-0.1168930382,0.0773947015,-0.079046607,-0.0890482515,0.0537698306,-0.0220344551,0.0313093625,-0.0183101185,0.0579070076,0.014730392,-0.0232837144,-0.0346421078,-0.0330433473,-0.0815882608,-0.0445068926,-0.0992965102,-0.000682719,0.0882373303,0.0856267363,0.0773345158,0.1034396812,-0.0209438186,0.0274920668,-0.1221299395,-0.1306960136,-0.126137495,-0.0046985173,-0.0175543968,0.0232229903,-0.0459365435,0.0147434678,-0.1181949675,-0.0795050189,-0.1198866814,-0.0315354727,0.0438358039,0.0016882436,-0.0229899716,-0.0085910941,-0.015247412,0.0340889022,0.1283632964,-0.1118942201,0.0278466269,0.0234711505,0.0239399951,0.0158611815,0.0488480851,-0.0814417601,-0.085412018,0.0652065724,-0.0516492389,0.0909199119,0.0441189744,-0.0797948167],[0.110518232,0.0380306095,-0.14217484,0.1203182414,-0.0172935911,-0.0872212723,0.0530191585,-0.0281381682,-0.087841846,-0.0162544083,-0.1017388776,-0.1038021222,-0.1357205659,0.102360338,-0.0775835663,0.0949311852,-0.0824647322,-0.139351666,0.1122689545,0.0646013319,-0.1388750374,-0.1158550382,0.0710727498,0.0128910057,0.0544233248,-0.0464212261,-0.0886139348,-0.1260541528,0.0158465244,-0.0497117601,-0.0060981656,0.1042547449,-0.0110140378,0.0168022327,0.0288737044,-0.1038784534,0.0667117387,-0.0887681097,0.0263352096,0.1057500988,0.0474710539,-0.1017317027,0.1044963598,-0.0437511057,-0.1072757766,-0.095503889,0.0168782193,0.0450464189,0.0325275622,0.0797570497,-0.0608029291,0.0731469169,-0.0230292697,-0.0987383351,0.0046823816,-0.091647841,-0.1293645948,0.0037042731,-0.0267088767,-0.1155726537,0.1195200905,0.0001995452,0.0043574376,0.085023202,-0.0625518113,0.0835665166,-0.1044366285,0.0123980707,-0.0925755501,-0.0972922221,-0.112967588,-0.0660421997,-0.0506225005,0.0681905523,0.1073315814,-0.0845397934,0.041113764,-0.0625315383,0.0101550519,0.1075870842,0.0144177582,-0.0071804165,-0.0601217374,-0.1014003381,-0.1147915348,0.0756080374,-0.0425505489,-0.0817476064,-0.1254824251,-0.1223527864,-0.0205393992,0.0802696198,0.0146359988,-0.1139793769,0.1062812209,0.0962775648,0.0228132177,0.07150466,0.0554855652,0.0685259327,-0.012127704,-0.024554655,-0.1470066458,0.041640278,0.0847871006,0.080409646,-0.0626333654,0.1373995394,-0.1225587055,-0.0108170547,-0.0131538603,0.0923376903,-0.0769517124,0.0101820659,-0.0435082614,-0.0984724015,-0.0737028494,0.0871336088,-0.003104205,0.0956834778,0.0796095282,0.1057633385,-0.0289381705,-0.090680182,-0.0870019197,-0.1162024885,0.0235260706,0.1117002666],[0.0409895889,-0.0580199435,-0.1132757589,-0.0105635691,-0.0428645164,-0.0291327033,-0.1104054227,-0.1044170037,0.0851733088,-0.0331477784,0.0768736079,-0.0031304315,-0.0010014039,-0.1317913681,0.0810899511,-0.1289867461,-0.0386322774,-0.012118523,0.0992796347,0.006134938,0.0721919984,0.0771343336,-0.0914536044,0.0635748208,-0.023547994,-0.0882287398,0.0642722696,0.0925464779,0.0111232428,0.0972104594,-0.095677346,0.0155252023,-0.0498815291,-0.1090710163,0.0056039803,0.0931224972,0.0832559317,0.0986847281,-0.0210513808,0.0554605946,-0.0803212449,-0.0342889801,-0.0098761702,-0.0500679314,-0.0238799267,0.0643725172,0.032241907,-0.0166127272,-0.0788955986,-0.0668264255,-0.0584591404,0.0809258223,-0.0964779556,0.0059053474,-0.1133227348,-0.1289126426,-0.0255641714,-0.0750904977,0.0574726798,0.0938881636,0.0379260592,-0.05441707,0.0631765127,-0.0681777298,-0.1207075641,0.0795216784,0.054293409,-0.0948931947,0.0944127068,0.1252591163,-0.0801276714,-0.0261414777,0.0107237734,-0.0598529875,0.0033294957,-0.0348513313,-0.0614829957,0.0715422854,0.0047984156,-0.1134073138,0.0853801891,-0.1168447807,0.1014601216,0.0848260075,0.1046840996,0.0537054464,-0.106351763,0.063528657,0.0764924586,0.1032939106,-0.0150467567,0.1078835055,-0.1315803379,0.0116333915,-0.0704987496,-0.0788073987,-0.0181087591,-0.0536278002,0.0827890038,-0.1280009449,-0.0252992008,0.045224756,-0.0790342987,-0.0066543757,0.0793149173,0.0839680657,0.0123760458,-0.0322085209,-0.0897456557,-0.139208436,-0.0955631882,0.0980526656,0.0142610893,0.0298639834,0.0726782754,-0.048297137,-0.0303922612,0.0642960221,-0.0334541909,-0.1460914761,-0.0180477276,-0.1292341799,-0.0817560703,0.0885460153,-0.0296807438,-0.1148117483,0.072525695,-0.0054224813],[-0.0430129245,-0.1283434778,-0.1338354796,0.0727799013,0.0955560058,-0.128436923,-0.0871013477,-0.1051573008,-0.0329901204,0.0941404626,0.1222001389,-0.0839360505,0.0661183372,0.1015417576,-0.0334222987,-0.0074711079,0.0402407758,-0.059661448,0.0598986335,-0.0737341121,0.0858822837,-0.0914107859,0.0867203102,0.0646711811,-0.1001316085,-0.0936368927,-0.0050606928,0.0281207226,-0.1147408783,-0.0771846026,0.071812287,-0.017726047,0.0796895549,-0.1368877441,-0.0697490796,0.1217005774,0.0960147977,0.0632205606,-0.0292999037,0.0489763655,0.0488524586,0.0943373516,0.0180758592,-0.1091882288,-0.0086094877,-0.0067417198,-0.0298186801,-0.1149394363,-0.053555645,0.0743176714,0.0521879271,-0.1152061895,-0.0024560397,-0.0546693988,0.032723926,-0.1441939175,0.0815068334,-0.0168331936,0.1141325086,-0.0500626154,-0.0328545235,-0.1183858141,-0.0914223343,-0.0286072437,-0.0560091287,0.0126562826,0.0144658573,0.1166490018,0.0698445737,0.1238704696,-0.0380178839,0.0913816169,-0.0400002189,-0.1198956668,0.0169375818,-0.0785709769,-0.0554179102,0.0876269117,-0.0280954298,0.0134831583,-0.1097952127,0.0521922112,0.0846263543,-0.1080106646,-0.1037057713,0.0056847925,-0.0773284212,0.0828209892,-0.0157180857,0.0807310045,0.0326875597,-0.0003426086,0.0158517864,-0.0662578791,0.0107590351,-0.1105018407,-0.141026035,-0.035856273,-0.0108131496,0.0445832685,0.1229150072,-0.0075882431,-0.0766192749,-0.0456932485,-0.0963459015,-0.0296164621,0.0471822023,-0.0165094621,0.0637932718,0.0988947451,0.0123418197,0.081463173,0.0594968572,0.0920940787,-0.0016451748,0.0256890245,-0.0296530295,-0.0779684633,0.07292144,-0.0289089773,-0.1587221026,-0.1205586866,0.0038388777,0.1055045277,-0.1141429767,-0.002430988,0.0756512806,-0.0163713768],[-0.1104483902,0.0723856464,-0.1158644408,0.0547475964,0.0703198388,0.1322831213,0.107069619,-0.0709726587,-0.0585648753,-0.059106268,0.1228693202,0.1126501113,-0.0155531634,0.0928690359,-0.0954108685,0.0179178119,0.0935587883,0.0410541333,-0.0806753188,0.0828428566,-0.1219802052,0.1274076551,-0.0416610129,0.0079857456,-0.0402081311,-0.0896753669,0.0492247716,-0.0846642777,-0.0128168566,-0.0754740834,-0.1409029663,-0.0144491252,-0.0162219033,-0.1138087437,-0.056011714,-0.0186459981,0.0945813283,0.0860885605,0.051259052,-0.0026522931,-0.1161768809,0.0853101686,0.0296064336,0.1075341627,-0.0068884208,-0.0194173455,0.0438439958,0.0688851625,-0.0656484887,0.0730317235,0.0199112389,0.0379928611,0.0205382854,-0.0633408576,-0.1044859439,-0.1147569865,0.0682241619,0.0507616587,0.0214253664,0.012718454,0.0387692228,0.0333588459,-0.094151035,-0.1236288324,-0.0619829819,-0.073686406,0.0470170788,-0.0225501712,-0.0569987707,-0.0831716359,0.0213267207,-0.017717436,-0.0152143035,-0.0371502452,-0.0120794699,0.0540360101,-0.1020547673,0.0355726406,-0.0983395651,-0.0284144972,0.1112859324,-0.124634631,0.038427487,0.0658289492,0.0795454085,0.0918121412,-0.0685828477,0.0694379285,-0.0216704141,0.0263867378,-0.085695006,0.0891373456,0.0947907567,-0.0273276549,-0.058556851,-0.0216565337,-0.0714477226,0.0584951453,-0.0194864962,0.0011409069,0.0132030016,0.026210364,-0.0457580052,-0.1377720684,-0.0970774591,0.0664910674,-0.0325827636,0.0090094311,0.1101366729,0.0887951255,-0.0306316111,-0.1138934419,-0.1351426989,0.0339293741,0.1542560309,-0.1249453947,-0.059144333,-0.0702197999,0.0101400614,0.0088277627,-0.1509116441,-0.0303354282,0.0831326842,-0.0061597475,0.0344004519,-0.0465323702,-0.1471525878,0.0593247451],[-0.0589746907,0.0772069097,0.0950260609,-0.0007291465,-0.1030199379,-0.0258635618,-0.0841707215,-0.0896938518,-0.1146155149,-0.0120133534,-0.0582730398,-0.009727302,0.1007501855,0.0844058245,0.1115932092,0.0702396035,0.0053034374,0.0751979202,0.1095733121,0.0142191444,0.0962970033,-0.0461564697,-0.0219040494,0.0103478413,0.0099809105,0.0019846119,-0.1030400842,0.0468160957,-0.0555571914,-0.0020158158,-0.0167181212,0.0504653715,-0.0766186938,0.0585810244,-0.0278304424,-0.1028133109,-0.0824100897,-0.0538363457,-0.0400173776,0.0106421383,0.0872590393,0.0296379812,0.0196970906,-0.0155028962,-0.1254584789,-0.0439421646,0.0672256947,0.0942920819,0.0282403845,-0.0041377991,0.1145497635,0.0035398467,-0.1228693649,0.0382575616,0.0054660286,0.0817650259,-0.1170744896,-0.040024858,0.0983529761,0.0458323769,0.025862094,0.0460617691,0.006439724,0.0956166312,-0.1094992757,0.0186856538,-0.0295009091,0.0244279988,0.1021801233,0.0763735995,-0.0125448694,-0.0680657253,0.0385080613,0.0732694566,0.0585784502,0.0827284232,0.0306178182,-0.0888686553,0.0585210249,-0.0544180088,-0.1203349903,0.1113512442,0.1094358489,-0.0739783868,-0.1206676736,0.044404462,0.0163534805,0.0723146647,-0.0683533847,0.1222575903,-0.0442791469,-0.0768248886,0.0860095769,0.0910706371,-0.0214288644,-0.0443280973,0.0827367902,-0.0545023121,0.0776195675,-0.0973436832,-0.0478606746,0.0529081337,-0.0107723307,-0.0336327814,0.0638390109,-0.1019960418,-0.0016297078,-0.0132479845,-0.1258985251,-0.0643687546,-0.1388185322,-0.1101080775,-0.0104197171,-0.0939683691,-0.030671563,-0.0901991054,0.0651208982,0.0097959181,0.0793947652,-0.0481419787,-0.1416827887,-0.0221072398,-0.0167950783,-0.0109859053,-0.1063774526,0.0216975566,-0.014599815,-0.0793508366],[0.022071952,0.0136806453,-0.0929827467,0.0323321782,-0.0139250159,-0.0842490122,0.0989106372,0.0027513548,-0.0154690258,-0.0889095068,-0.0465481542,-0.0031407555,0.0526433699,-0.0349712893,-0.0810112581,0.0402765945,-0.1086455733,-0.1286127269,-0.1195692644,0.080052942,-0.1517715603,0.0895975754,0.080826655,-0.0886287168,-0.1342912018,0.0119560547,0.0995213836,-0.0784854442,0.1065291911,-0.0028240136,0.0962738022,-0.0169642437,0.0723720565,-0.112781249,-0.1092372686,0.0752530396,-0.0907308608,-0.0576530583,0.0143704908,-0.0223208033,0.1056649387,-0.0003462672,-0.0761143491,-0.1074266583,-0.1104267985,-0.1345634609,0.0247806236,-0.1361783296,0.0049819429,-0.0854920372,0.1130557582,-0.0550041236,0.0786768124,0.0153193185,0.0344620533,0.0269615632,-0.0067633786,-0.0538201332,-0.0234102812,-0.1052973792,-0.077811271,-0.1033287868,-0.1111177579,-0.0497131944,0.0498402454,-0.0999785066,-0.0008361353,0.0380590297,-0.014696396,-0.038566038,0.1199155971,0.0328725055,-0.0208904967,0.0284313932,0.0966508836,0.0655025765,-0.024587255,-0.0227861088,0.0391629711,-0.0182850547,0.1108046249,0.0527028851,-0.0681589767,0.1121149883,0.038233608,-0.0391948968,0.0666284785,-0.1015988439,0.1126368567,0.1154364422,-0.0717332885,-0.103117317,-0.0712158009,0.0350814126,0.0431244038,0.0926295072,-0.0445771776,0.0568207838,-0.016629979,-0.1075918972,0.0822570026,0.0133864759,-0.0254019853,0.0281769391,-0.0485773906,-0.0211295485,0.0196010843,-0.0751909241,-0.0874740332,0.0983039439,-0.0851038024,0.0774371922,0.0869617909,-0.0533424839,0.105838649,-0.138671726,-0.0062584574,-0.0741813555,-0.0386553183,-0.1495755762,0.0056967828,-0.0540435128,-0.0071251909,-0.1182866693,-0.1144665703,0.0284997635,-0.0309158601,-0.0326549113],[-0.0052976133,-0.0315676145,-0.0898422897,0.0259347279,-0.0759021416,0.0572247431,0.1206215024,0.0938049704,-0.0612380542,-0.0597902685,-0.1105882749,-0.0154412743,0.0353587978,-0.0297902711,-0.0349687226,0.0319794714,0.0437934101,0.0520014241,-0.0584570691,-0.0445063002,0.034673091,-0.0242022723,-0.0507093444,0.0796523914,-0.0711627156,0.0542703941,0.0679418296,-0.121034205,0.0346727334,-0.0598735511,-0.0517254546,-0.0287508368,0.0224944595,0.0450150855,-0.09663295,0.095025979,-0.0069087865,0.0753460601,-0.0392424725,0.1277911514,0.0575712472,-0.0062341532,-0.0194876119,-0.0605111979,0.0355890021,-0.0382331572,-0.0419594347,-0.0440760776,-0.012300428,-0.0237893704,0.1118728071,-0.0548435189,0.0556718409,-0.0246967413,0.0694882497,0.0737471208,-0.1164441407,-0.0464624353,-0.1021797135,0.0893954784,-0.0323851109,-0.0118846949,-0.1394702494,0.0916357264,0.0901614353,-0.1231052503,-0.1015541703,0.0008765038,-0.1199608594,0.0408355966,0.0562942252,0.0878008679,-0.0277075227,-0.1169288307,-0.0934483781,0.0455566123,0.0841513053,0.0933748856,0.1089905724,-0.0245812666,-0.000958443,-0.047534924,0.1109018698,0.0308604483,-0.0395949371,-0.0826086923,-0.030570887,-0.0279756449,-0.0097784474,0.0097741475,-0.057203114,-0.0475497358,0.0050207293,-0.0590850003,0.008856291,0.020166019,-0.0617564209,-0.0520789027,0.0481962673,-0.1086308807,-0.0228613596,0.0212767739,-0.0417483635,-0.1278568059,-0.0224677529,-0.1019443348,-0.0117632281,-0.1063644215,0.020966528,-0.0880195722,-0.0933659077,0.0661511868,-0.1375804693,0.0009353281,-0.0356090143,-0.0837203935,-0.128234148,-0.0085234856,-0.1038794219,0.0363338664,-0.0657693669,0.0549460091,-0.0748249963,-0.0875198171,-0.0828686059,0.0575409159,-0.100533396,-0.0996548459],[0.0425573513,-0.0139095569,-0.1234812066,0.0078660846,-0.0351917781,-0.1892102808,0.0458981656,-0.0087962188,-0.0506859571,0.0630788431,0.011061999,0.1008186862,-0.128828913,0.0160043221,-0.0647829324,0.0120860506,-0.01484528,-0.0908948556,-0.0149066085,-0.0253782086,-0.1483467072,-0.1074226052,0.093411684,0.0972744599,-0.1380985677,0.0601414479,0.0078531383,-0.0201341938,0.040684931,-0.0854510888,-0.0116290143,0.0209932867,0.0424343422,-0.0933277011,-0.1446963698,-0.0556407981,0.075306654,-0.1127451956,0.0525214262,0.0817911252,0.0781452134,-0.0129459975,-0.0951721445,0.03711484,0.0003377216,0.0812552795,-0.1166095957,-0.0570321679,0.0307872165,-0.1188709363,0.0179681089,0.0476516113,0.0993146971,-0.1075633317,-0.1009994075,0.1459752768,-0.1574111879,0.0322549529,0.0300286245,-0.0374910012,0.0666575506,0.0566058159,0.0835358277,-0.0246271603,0.0835009217,-0.0101678632,-0.0687120184,0.0883188695,0.039555978,0.1216099709,-0.0986051559,0.0439088866,0.0937094167,-0.030611366,-0.0578232147,0.0194373485,0.1290805489,-0.0407615006,-0.1243618205,-0.0391177088,-0.0912828371,-0.0235856753,0.1244779527,-0.0980146751,-0.0697106048,0.0653119087,0.0664344504,-0.0131943244,-0.1115059406,0.0866310894,0.1233862787,0.0019107303,-0.0413505472,0.0006064535,0.0629647225,0.0530254915,0.1422659755,0.0037267674,0.0369463973,0.1369783282,-0.0646991879,-0.0738598853,-0.1159733459,-0.1125947163,-0.1056999862,0.0243985094,-0.0114932107,0.0445820391,-0.0709449127,-0.0737078935,-0.0534713119,0.0311841331,0.1162785143,-0.0404163264,-0.068458207,0.064148128,-0.0342027545,-0.0546907187,-0.123678498,0.1543949097,0.1007814556,0.0264024604,0.0274181534,-0.0756334662,0.0477949083,-0.1432735324,0.0271476395,0.0349796377],[-0.0401083864,0.0004819312,0.0714671388,0.0144633241,-0.1030770391,0.0131164687,0.0942519531,-0.0851548389,0.0235830769,0.0394100845,0.0767509937,0.0779468566,0.0284841899,-0.1034493297,-0.0388563313,-0.0360340104,0.0923251733,-0.0385589227,-0.1181651577,0.0452610254,-0.0509423129,-0.0361865275,-0.0190240201,-0.0738957152,-0.070542179,-0.0484000891,-0.0417058058,-0.0964603052,-0.0541662499,0.0648375005,0.0150841195,-0.1230050027,-0.0062930938,-0.1053414568,-0.0179911926,-0.0761999711,-0.1138847321,0.093235448,-0.1158192158,-0.0929202512,0.0771609545,0.0788107961,0.0475412607,0.1222473606,-0.139460817,-0.0252304208,0.108308658,0.0087009817,-0.1355126798,-0.1174149364,-0.0599466227,0.0950047001,0.0087513495,-0.0397992805,0.0178870372,-0.0188247282,-0.0596911609,-0.0505697913,0.0036284868,0.0109408097,-0.0189288482,-0.0012184972,0.0865658522,0.0776107162,-0.0670158044,0.0165943448,-0.0202578604,-0.1175910681,0.0718201101,0.0958015546,0.0213479381,-0.0469445251,0.05486634,0.0659705624,-0.0014054767,0.082985878,-0.0845743045,-0.0805132985,0.0314787142,0.0673988163,0.0103283701,0.0858364478,0.0492377616,0.0146366553,-0.0606124438,-0.0655956641,-0.0534144975,0.0908526108,0.0976441279,0.0126697877,0.0313706659,0.0084074764,0.0310838558,0.0306557752,-0.0634151772,-0.0464188717,-0.0206702556,0.0199534427,-0.1254180521,-0.0390026383,-0.1294654757,-0.0517222881,-0.1361003816,-0.115169093,-0.1140903756,-0.1066216156,-0.1099517047,0.0703610405,-0.0803721473,-0.1318585277,0.0968821645,-0.0381216258,0.050634522,-0.0874890611,0.1335835755,-0.090621531,0.0101420255,-0.0832838118,0.0246495809,0.0506519228,-0.0028798743,-0.0918180645,0.0066259587,0.0197043587,-0.0332916155,-0.1252586097,0.0347842872,-0.0650632009],[0.0225648135,-0.1244342625,0.0208252445,0.0359354801,0.0189646427,0.0662134513,-0.1376964748,0.0920299068,0.1060538664,0.0494592302,-0.0961056352,-0.0780099928,0.0975378528,-0.1217584386,0.0876476988,0.1021429673,0.0183526203,-0.0430133194,0.107193023,0.0297314692,-0.0312318727,-0.0428638309,0.0718493834,0.0667944774,0.0535170436,-0.147164911,-0.0114898011,-0.0754360855,0.1176068634,0.0334211029,-0.1298588663,0.062990889,0.0056117848,0.0925305188,-0.0200591665,0.0584526099,-0.070395276,0.0427134819,-0.0671625882,-0.0101739634,0.05576564,0.0830683187,-0.0544006042,0.0935065746,-0.0079539008,-0.0733083412,-0.0081428457,-0.0041687279,-0.0145521099,0.084058702,-0.1029025689,0.0127585772,-0.0347349271,-0.0653806031,-0.1039975956,0.014443092,0.101686351,0.0130932629,-0.0478898138,-0.0622998402,0.0456265844,-0.1006454378,-0.0378310755,0.040057458,-0.0484243259,-0.0793889165,0.1221581697,-0.0730928183,-0.1193136275,-0.0476364382,-0.0142386118,0.0479489341,0.0992709249,-0.0344713926,0.0421713293,0.0003187001,-0.022112295,0.0908409134,-0.055003047,0.0407827944,0.004598198,-0.1012176424,0.0602067187,0.1104544029,-0.0552998222,0.0697106645,0.0574270338,0.06985531,0.0046469131,-0.0891478136,-0.1259953231,0.0891590714,-0.1088463068,0.1222356483,-0.0107408445,0.0102654444,0.0383174755,0.0050967862,-0.0763637722,0.0603179298,-0.1065033972,-0.0435865298,-0.0939528793,0.0468262285,-0.0928882211,-0.0622597486,-0.0716513991,-0.1474579871,-0.0738525018,0.0903583542,-0.0314673595,-0.045130685,0.0245891251,0.0815009177,0.0615975447,0.0733856782,0.0061242278,-0.0877509713,-0.0419373251,-0.1350223869,0.0378128178,-0.0043208236,-0.1231692657,0.0013307673,-0.0709840208,-0.1317197531,-0.0589341782,-0.0643239543],[-0.1358286738,-0.1016174927,-0.1031940803,0.0112979785,0.0263620857,0.1285283118,0.0203414243,0.0224796478,0.0938628614,-0.0121038323,-0.1106323004,0.1184492782,0.1031081825,0.1042003483,0.0173383672,-0.0385786705,0.0157899335,-0.0769664273,-0.0798951238,0.0544625744,0.0893145129,-0.0201112423,0.0982293561,0.0161839351,0.0514843091,-0.1281577647,-0.0125292651,-0.0590619072,-0.076634258,-0.0425652452,0.0862945542,0.0959433094,0.0643202439,-0.0302509889,-0.1359253675,-0.1125259995,-0.0511541143,0.0813466385,-0.0050329836,0.0938705057,-0.0386266448,-0.0835104287,-0.061778143,0.0966243222,-0.1248946264,-0.1309925914,-0.0406094193,0.0741425827,0.0149394386,0.0636053085,0.1073203087,-0.0538081415,-0.081780389,0.0908985883,0.0147702564,-0.0270899851,-0.0497176796,-0.0842519924,0.0881597772,-0.0937986299,-0.0648280531,-0.0926297829,-0.068612054,0.0720494613,0.0419730917,-0.0289945696,0.0011189705,-0.0321729705,-0.032381501,-0.1009756923,0.0515852086,0.0142317051,0.0796619877,0.0927528292,-0.0046840562,-0.1184982583,-0.095845066,0.0891818255,0.0999173969,0.0841201767,-0.0176388361,0.0937384069,-0.0020723094,0.0890563875,0.0574231222,0.0755847022,0.0399190523,0.0201521516,0.0367637426,-0.0137068918,-0.0466232076,0.0250404868,0.0424166545,-0.0075040376,-0.1252836883,0.0114860889,-0.1123719439,-0.0165839344,-0.0237157755,0.0493626967,-0.0879008546,0.1269896924,-0.008588559,0.0805175751,0.0386791788,0.0649298429,0.0057216408,-0.0606091097,0.0331404991,0.0019977838,-0.0004340318,-0.0656900555,0.0466402136,-0.0759261772,0.0512037762,0.0367601477,-0.0785107389,-0.1069831327,-0.0151298493,0.0187005084,-0.0317908116,0.0611456782,0.107664682,-0.1529282629,0.1231425777,0.0152543411,0.0941267386,-0.0650891736],[0.0043151719,-0.0954015777,-0.0246984418,-0.0556199215,0.0216457359,0.0116264727,0.0800868347,-0.0199591033,-0.0902759135,0.0170458239,0.0779522955,0.0836979896,-0.1188534498,-0.1009072959,0.0251745172,0.0560187735,0.0404923409,-0.0117453607,-0.0691823661,-0.0170210693,-0.0860626101,-0.0792666972,-0.0763318911,-0.1555700898,-0.1361028254,0.0610781349,-0.0148716513,0.089858897,-0.089641206,-0.1266720742,0.0487800129,-0.0919907466,-0.1201536059,-0.072622858,-0.1228918657,-0.0971162096,-0.0294518191,-0.0497747809,-0.0738539696,0.0323941596,-0.105619818,-0.0423173271,0.0281657875,-0.0484573133,-0.019328611,-0.0207933355,-0.0402915776,0.0359858498,-0.1067544818,-0.1343802959,-0.0804304406,0.1028979868,0.0096442876,0.0944369063,-0.0993126482,-0.0370782949,0.079902187,-0.1154862642,-0.0991727039,-0.0670768693,-0.0531009324,-0.0546276532,-0.0523898043,0.0906090438,-0.0812358856,-0.0439757295,-0.0505370051,0.087382853,0.1093161553,0.1312515587,0.1159111708,0.0178718101,-0.0426663905,-0.0095912619,-0.0038435927,-0.1065174565,-0.04815045,-0.0275741052,-0.0676535964,0.0583708845,0.0252117515,-0.0563751273,-0.0917254835,0.0109333806,-0.0145614184,0.0892042741,-0.0643730387,-0.1199554354,-0.0630119294,-0.0960917249,0.1153213233,-0.0533674434,0.0895519108,0.0266622696,0.024482986,0.1164871156,-0.0727761388,0.0155029166,0.0207049977,0.0742535219,0.0058239931,-0.0099245589,0.0747923553,-0.090382427,-0.1248113811,-0.0033666114,-0.0859226808,0.0740121081,0.1055951491,0.078695178,0.0582271405,0.0150795337,-0.0333854221,0.0733327344,0.0121538229,-0.072367385,-0.106519565,0.0801815465,0.0969737843,0.0641432181,0.0754141286,-0.124416329,-0.033001449,-0.1334956735,-0.0407976583,0.0210656878,0.0731190816,0.1039128974],[-0.0611377098,-0.1206903309,0.0371768624,-0.1087430939,-0.0735579729,-0.11240381,0.0213114694,-0.0477767773,0.0519418716,0.1355759501,0.0208883081,0.0509881154,-0.0698445365,-0.0288945548,0.0224889256,-0.0533368923,-0.0080066463,-0.0973062068,0.0828986466,-0.0466405861,-0.0372219607,-0.0784114599,0.1030278429,-0.1300470531,-0.0744749755,-0.1143334806,-0.0894513428,-0.0133060254,-0.0414608903,0.0226502828,-0.0385033451,-0.066896975,0.0886859223,-0.0628121868,0.0521797575,-0.0314937793,0.0726280361,0.0976593718,-0.0976316631,0.1047991812,0.0823335573,0.0018878639,0.0533623584,-0.0965949744,-0.0574723445,-0.0641571358,0.0660286546,-0.0619678162,-0.0301883053,-0.1138832346,0.0810896084,-0.0258223247,-0.0063932338,-0.0097292028,-0.0919445455,-0.0425898172,-0.0942668691,-0.1199400797,0.0815591365,-0.0928177461,0.0126839587,0.096986182,-0.1109424233,0.0413197204,0.1125404537,0.0516396537,0.0539215766,-0.0750538558,-0.0128605878,0.077138871,0.1263108253,-0.1253942698,0.0563393943,-0.0188877024,0.0637236834,-0.0988364667,-0.0729987323,-0.026301844,0.078090407,0.1167715117,0.1346989572,-0.051829014,0.0542477481,0.0624090768,0.0715533569,-0.0964921191,0.0568449534,-0.075119257,-0.0542802103,0.0520119034,-0.0609918498,-0.0013109387,0.0242774095,-0.1184764802,0.0427549556,-0.0439616852,0.0638262779,0.1075851321,-0.0722795054,0.0803900436,0.0213128459,-0.0651815161,-0.132855311,0.037813209,-0.1483976543,-0.126038745,-0.062954329,-0.1543175876,-0.0018058893,-0.0624613687,-0.1438393444,-0.1023841798,0.0378060117,0.0015299694,0.0561809018,-0.0392401703,-0.0993026644,0.0447255261,0.0536641441,-0.0247880835,-0.0117041953,-0.0679686889,-0.118044354,-0.0235750508,-0.0802738369,-0.0983604789,-0.019597698,0.0860253945],[-0.0386336744,-0.0916438848,-0.1042854711,-0.0322211049,-0.0658137277,-0.1771350503,0.0673326552,-0.1191502288,-0.0403657109,-0.0650851056,0.0427222922,0.0040535056,0.0960913152,-0.0892810673,-0.0924709141,-0.1637481898,0.1356802136,0.0674636289,-0.1228371859,0.0328803286,-0.0080363527,0.0139850518,-0.0695087239,-0.0243481025,-0.0950976238,0.0580919422,0.0892077535,0.0613307394,0.0850926712,-0.0395392329,-0.0826546848,0.0499917232,0.0770463347,0.055611074,-0.0091531398,-0.082299754,-0.0846087858,-0.1002655923,-0.0320529193,-0.1149786189,-0.0916226134,0.1325021535,0.0709088817,0.0797968432,-0.1073237211,0.0566416271,-0.0660000145,-0.0615797043,-0.0911650434,0.1081626564,-0.106012702,-0.018267123,0.0565865487,0.0302376095,0.0049569583,-0.0498105735,0.074705787,-0.1049800515,0.0424795933,0.0939494371,-0.0107866079,-0.11601457,-0.1035856679,0.0545087233,0.1016058847,0.0038814158,0.0509151593,0.0341496319,-0.0951856747,0.0623182617,-0.1161858961,-0.0511069372,-0.0215914994,0.1007214561,0.0968374088,0.0216887221,0.1272681504,0.049960874,-0.0588445999,0.0666927174,0.0179878324,0.0843430683,0.0791353211,0.0879707038,-0.0833245739,0.0875946656,0.0260010455,0.0550834723,0.0353247039,-0.0299841836,0.0506781526,0.0786181986,-0.1143617257,0.049409043,0.0213339478,-0.1280143708,0.0275688879,0.0203400217,-0.0995861068,0.1881875098,-0.1269241124,-0.1479806602,-0.0345980376,-0.015933685,0.0484208092,0.0494477153,-0.1196813658,0.0361366905,-0.0859331638,0.0774175674,0.0902458355,0.0369252786,0.134729892,0.0324464254,0.0366317257,0.0788942426,0.0630383715,0.0260886997,-0.1207167059,0.0582878292,-0.0990745127,-0.1082982719,-0.0541742146,0.0403865129,-0.0799620897,-0.126825273,0.013364221,0.0024828652],[0.0740855709,-0.022308005,0.0520202331,-0.0061615515,-0.0351026356,-0.1044234633,-0.0097457329,-0.0385940559,0.1160659716,0.1380475312,-0.1016004607,-0.0572017916,-0.0522081666,-0.1288792938,-0.0945015401,0.1011093482,-0.0437237658,0.087847732,-0.0953705087,-0.1361306608,-0.1098121479,-0.1032883525,-0.0867159963,0.1180524677,-0.0230749436,0.0491516963,0.0934988633,-0.0471832082,-0.0340497307,-0.070271194,-0.0511303246,-0.0232244916,-0.0756035075,-0.1100043878,-0.0221435893,0.0130923865,-0.0068928306,-0.1304219514,0.0726448148,0.0757746845,-0.118492581,0.009570431,0.1016962528,-0.0185025372,-0.0373901129,-0.1129480377,0.0768825933,0.0481431782,0.0014745423,0.0834219977,0.013608315,0.0856651291,-0.0461306907,-0.0854170471,0.0517730601,0.101892367,-0.039933078,0.0423014536,-0.0041545015,-0.0940046534,-0.0732033476,-0.0631819293,0.1031277552,0.0520473942,-0.1232303232,-0.0084747076,-0.0676509067,-0.0641269609,0.0030529478,0.0404953547,-0.1147387698,0.0769432634,-0.0831078514,-0.0126263108,0.0490447506,0.0986128077,0.004492911,-0.1245597228,-0.0415671654,-0.0064680944,-0.1153043211,-0.0921331048,-0.1038955674,-0.0136413174,-0.0123925824,-0.0576466843,-0.0783705935,-0.0154549023,0.0477437861,0.0409042314,-0.0497355722,-0.0640309826,-0.1028429195,0.0052049737,0.0822130293,-0.1008986905,0.1112870425,-0.1040179804,-0.1332682818,0.0549202859,0.0079631303,0.0707967654,0.0693591014,0.0651015788,-0.0058248923,-0.0670249835,-0.1487087756,0.0154357124,-0.018791331,-0.1191204637,-0.0601513721,-0.0760320202,0.127951473,-0.1189329699,0.0064005805,-0.1204661727,0.063158758,0.1004576012,0.0598332845,-0.0200933479,0.054674726,-0.057907071,-0.0048639006,0.0987142101,0.0107563809,0.0429553092,-0.0842250213,0.0228130482],[0.0699779317,-0.1026820466,-0.0835255682,0.0062109879,-0.1272874475,0.0071877474,-0.0105032427,0.1045250371,0.109278053,-0.0474697687,-0.1039603353,-0.0075651431,0.0433463864,-0.1296940595,-0.1027038619,0.0641252846,0.0621574707,0.111515969,-0.0385333896,-0.0059782621,-0.0848228335,0.0532370843,-0.0748954862,0.0746080577,0.0757752731,-0.0839770585,-0.0602254085,0.0879290029,0.1018345132,0.0171797965,-0.0037278403,0.005946171,-0.0350150205,-0.0135643594,-0.0179400984,-0.0709080249,-0.0472062267,-0.1131485179,0.0480400212,-0.1138725355,0.0578823648,0.136418283,0.0763283819,-0.1008272246,-0.1201871783,-0.0045176838,-0.1007862315,-0.0062414887,-0.0693024769,-0.0535293259,0.0131006679,0.0087043121,0.0779147744,0.0464655645,-0.1109398007,0.0960514918,-0.0566272885,-0.0979119018,0.0663231462,-0.1159042716,-0.0088621806,-0.1431275308,-0.1111241505,-0.0109988898,-0.1169551387,-0.0406972803,0.0633890703,-0.0525143296,0.0988745317,0.0583080463,0.1145100072,-0.0514759682,-0.0272368696,0.096770145,0.0175158065,-0.0086588981,0.0783586949,0.0228614062,-0.0766490102,-0.0277863257,-0.1310625523,-0.0016089848,-0.0271475427,-0.0930572823,0.1062302366,-0.0524055436,-0.1212054566,-0.0683710203,-0.0057257153,0.0836063325,-0.0690032989,-0.0182561595,-0.1000029668,-0.0776538029,0.0305289384,-0.1119076982,0.0893720165,0.0640046299,0.0983623937,0.0865980908,-0.0522125065,-0.0819805264,-0.0682727471,0.0602024533,-0.0870215595,0.1129820496,-0.0522370785,0.0121906493,-0.0077379015,0.0289647616,0.0819132254,-0.0003963951,-0.0452033877,-0.1212617308,0.001531875,-0.0894464627,-0.1246946752,0.013722863,0.017186312,0.0187982246,-0.004179365,-0.1013990566,0.0537531376,-0.0888399407,-0.1740772128,0.0907272175,0.022638116,-0.0090689966],[-0.006818661,-0.031756945,-0.1354392767,0.0012164172,-0.0038360995,0.0010746964,0.126058653,0.073941201,-0.0618590452,0.0393037423,-0.0400624499,-0.0190236177,0.0845948085,0.0166518297,-0.0400331765,-0.1269804537,0.1039598361,0.0856090114,-0.0286273248,0.0336508155,-0.0821476579,0.0303187277,-0.0218201019,0.0020392439,0.090229474,-0.0298226923,0.0996589586,-0.1129595786,-0.0024320001,-0.0106533747,-0.0384869985,-0.1218108311,-0.0411387756,-0.0461635925,0.068766512,0.1214414388,-0.0293915868,-0.0156978276,-0.0387870781,0.057332363,0.0320526846,0.1190851703,-0.0303733516,0.0116471387,-0.0908662751,0.065132305,0.0363413841,-0.0197105352,0.0304819457,0.0178992916,0.0865641609,-0.0575826652,-0.0508278422,-0.0712501407,0.0881088823,0.0862987116,-0.0756991059,-0.0192989409,-0.0406488664,-0.0363617092,-0.1022379026,-0.0292077251,0.0495099388,-0.1121949032,-0.0409422182,0.0056710211,0.0494002178,0.0983224884,0.1002661809,0.0849760696,0.0858614743,-0.0833959132,0.0975586399,0.0179838873,-0.0862396061,0.0727160946,0.0087875053,0.1032794043,-0.0649338961,0.0557008684,-0.0731924251,0.0823291987,-0.0384186469,0.0970209688,0.1263120472,-0.0523444563,0.1243118867,-0.0425305888,0.0051601138,0.0163390171,0.0243522357,0.1075381935,-0.0955738351,-0.0512327962,-0.0450729318,0.0174869392,0.0744725466,-0.1082641408,0.0561459623,0.1294456571,0.0437373444,-0.05232317,-0.0447784327,-0.0226678643,0.1086992398,0.0660540387,-0.0920610875,0.061045818,-0.0808964372,-0.0242992938,0.0376540236,-0.123497121,0.0839698389,0.005565987,0.0479978509,-0.0208522007,-0.0140574798,-0.0157561805,-0.0383674018,0.0554135107,0.0848753378,0.1065152511,0.0498682447,-0.0874423459,-0.129025206,-0.111110881,0.002481269,-0.1090303361],[-0.1196067631,0.091860421,-0.0584036596,0.1146238446,0.000857406,0.067105405,-0.0729615465,0.0490832217,-0.1025367752,0.118662633,0.093788825,0.0750775039,-0.1387781352,0.0203911699,0.0348490141,-0.0836836025,-0.1134240478,0.0307842046,0.0730798393,-0.0607036389,0.1073901281,-0.0927615911,-0.0271350946,0.0051500658,-0.1200973541,0.0729348138,0.0457307398,0.0783517882,0.1086084023,-0.0740216151,0.0758307725,-0.0384015851,-0.1217648387,-0.0222931691,-0.0477804244,0.03854388,-0.0449967086,0.0855462402,-0.0481496714,-0.02521782,0.0897431597,0.0371811613,0.0634130388,-0.074490115,-0.0841068029,-0.0572414547,-0.116754666,0.0946511552,-0.0597530343,-0.0404573977,-0.094418183,-0.0794642791,-0.1282075942,-0.1216505691,0.0712587088,-0.0191806536,0.0058339206,-0.0065753018,-0.069188863,0.0323603004,-0.0587097891,0.0176732745,-0.1157420054,0.0830042735,-0.0390173085,0.0321596749,0.1159749925,0.0708553195,0.0009068649,-0.063492015,0.0229091831,0.0997916386,-0.1092974767,-0.1070798263,-0.0206457824,0.0140650868,0.1114215031,0.0706476197,-0.0213945471,0.0088614654,0.0366507471,-0.0807860419,0.0616458729,0.0578181706,-0.0395637788,0.087528415,-0.0378731862,-0.0390638039,-0.0245560259,0.0282433107,-0.0021428543,0.0543588996,0.0093111834,0.0623610765,-0.1084858775,-0.0215726309,0.0801382586,-0.1095185056,0.0577894077,0.0265244897,-0.0213712063,-0.0054255081,0.0832771286,-0.0183775239,0.0808971003,0.0566993356,0.0093253488,0.0872825757,-0.1190700531,-0.0387908705,-0.1108183041,0.0296721086,0.1225306317,-0.08903189,-0.1319124401,-0.07071767,-0.0981779695,0.0940003172,-0.0482438542,-0.0589093938,-0.0111820614,0.0794693306,-0.1096341759,-0.011617153,-0.0059247259,-0.004151463,0.1138709188,0.0666557401],[-0.1064244732,-0.0455691069,0.0769050568,0.1196716204,-0.0673579648,0.0432092175,-0.0651191473,-0.0935390592,-0.1026054174,-0.0849782154,0.0599462129,-0.0022515457,-0.1036113948,-0.0434057862,-0.033125218,0.0457186438,-0.0366744436,0.0902782232,0.0798155889,-0.1323770434,-0.0576956309,-0.11410667,0.0689697638,0.0022103502,-0.1226953417,-0.0253173392,0.0419298671,0.0755742341,-0.0049756118,-0.0981488898,-0.0160960406,0.0044259951,0.0981897861,-0.0390858501,0.0052136513,-0.0607221983,0.0063297027,-0.0321189612,0.0641861185,-0.0925281271,0.0238804482,-0.0354089625,-0.0357225686,-0.0052805301,-0.1094184592,0.0208349265,0.03125057,-0.0888205692,0.0888061002,0.0598988757,0.1178251654,-0.0643602908,0.0049224296,0.1154638678,0.077632308,0.0499388352,-0.0295745172,0.0893770605,0.0129368706,-0.0130863832,-0.0185502674,0.0265701301,0.0761358365,-0.1256110072,-0.1137776598,0.0715953186,0.0843172073,0.1019036174,-0.0004789729,-0.0737204328,-0.1009414941,0.012325394,-0.0465061739,-0.0478825979,-0.0997202545,-0.0053624986,-0.007556295,-0.1144157425,-0.0985428765,0.0008043767,-0.0866890922,-0.0177905094,0.0737720653,-0.1115562618,0.1162904575,0.023016002,-0.038588915,0.0629468635,0.1180272624,-0.1246594787,0.0230017584,0.0313584059,0.0912473276,-0.0421184264,-0.0840626806,0.0693458095,-0.0428186506,0.0814497024,-0.0365919918,-0.0245273672,0.0705121309,-0.0908100381,0.0953136384,-0.0582366586,-0.0921673998,0.0194697101,-0.0111324852,-0.0030908424,-0.0282537807,0.0230423193,0.0113847703,-0.128279835,-0.048769068,-0.0121307662,-0.0968330503,-0.1344487369,-0.1437139511,-0.1306000352,-0.1097460091,0.0193739366,-0.0123293754,0.0000119847,-0.013703132,0.037924692,0.0808191523,-0.0085975425,-0.0781581327,-0.0831767768],[0.0351326689,0.0890581682,-0.0731425062,0.0722400472,0.033071287,-0.0653087422,-0.0276102964,-0.0578649193,-0.0539541245,0.1145280898,-0.1039997935,0.0104902359,-0.1374655366,-0.0943382308,0.0598415844,0.0933235809,-0.1090836897,0.0339403339,0.0861519426,-0.064737156,-0.1333655119,-0.0302965511,-0.028387256,0.0381490365,0.0370996445,-0.0792014897,-0.0367647558,-0.033893846,-0.0391175747,0.0203415286,0.0322825909,-0.000179544,0.0384897999,-0.059083499,-0.1115099639,-0.026895877,-0.1236499399,0.0651038587,-0.0469302125,0.0210912842,-0.0901577473,0.0881641731,0.1204307526,0.0504508018,0.0634177178,-0.0097821178,0.0296402611,-0.0192961674,-0.04488739,-0.0829341859,0.0091392584,-0.0676484406,-0.0068777376,-0.092561461,-0.0526460446,-0.0851291642,0.0739924982,-0.1384289265,0.0460059419,-0.0091487225,0.055215124,0.1044021621,-0.1178460047,0.0661462471,0.042025812,-0.0222256985,-0.0830470175,0.10845007,0.0433288887,-0.1002713665,-0.0012161853,-0.0563039705,0.1019080952,0.015377352,-0.0671648309,-0.0436839275,-0.0875181928,0.0595438518,0.0597828999,0.0817692801,-0.0307602063,-0.0737114102,-0.0773429051,0.0741522163,0.0327303037,-0.1185177416,-0.0107838996,-0.1049851775,-0.1175487563,-0.0345284939,0.033603102,-0.1017762274,0.0494256653,0.1181096807,0.0681538284,0.0211312864,-0.0852016807,0.0702584237,-0.0963309184,0.0554477386,-0.036305353,0.0454936586,-0.0214606896,0.0269770809,-0.1298580766,0.1057916284,-0.0504674949,-0.1096159071,0.0321206003,-0.0199878998,-0.11073374,0.0405367985,0.010551394,0.095769152,-0.0797920153,-0.0844188631,-0.1213603318,0.1096998006,-0.1377691329,-0.1313817054,0.0371227041,-0.0421747863,0.0059952103,-0.1243769526,-0.1115210056,-0.0033699095,