{"model":{"name":"model_5","layers":[{"name":"x_100","class_name":"InputLayer","config":{"batch_input_shape":[null,100,353],"dtype":"float32","sparse":false,"name":"x_100"},"inbound_nodes":[]},{"name":"x_40","class_name":"InputLayer","config":{"batch_input_shape":[null,100,353],"dtype":"float32","sparse":false,"name":"x_40"},"inbound_nodes":[]},{"name":"x_raw","class_name":"InputLayer","config":{"batch_input_shape":[null,100,353],"dtype":"float32","sparse":false,"name":"x_raw"},"inbound_nodes":[]},{"name":"lstm_13","class_name":"LSTM","config":{"name":"lstm_13","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_100",0,0,{}]]]},{"name":"lstm_14","class_name":"LSTM","config":{"name":"lstm_14","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_40",0,0,{}]]]},{"name":"lstm_15","class_name":"LSTM","config":{"name":"lstm_15","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_raw",0,0,{}]]]},{"name":"concatenate_5","class_name":"Concatenate","config":{"name":"concatenate_5","trainable":true,"axis":-1},"inbound_nodes":[[["lstm_13",0,0,{}],["lstm_14",0,0,{}],["lstm_15",0,0,{}]]]},{"name":"dense_17","class_name":"Dense","config":{"name":"dense_17","trainable":true,"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["concatenate_5",0,0,{}]]]},{"name":"dense_18","class_name":"Dense","config":{"name":"dense_18","trainable":true,"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_17",0,0,{}]]]},{"name":"dense_19","class_name":"Dense","config":{"name":"dense_19","trainable":true,"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_18",0,0,{}]]]},{"name":"dense_20","class_name":"Dense","config":{"name":"dense_20","trainable":true,"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_19",0,0,{}]]]}],"input_layers":[["x_100",0,0],["x_40",0,0],["x_raw",0,0]],"output_layers":[["dense_20",0,0]]},"weights":[[[0.0248984229,-0.0498831198,-0.0342395492,0.0365571938,0.1259905845,0.0573816597,-0.0005816874,-0.0335731097,0.0222588908,-0.027761355,-0.0828088149,0.0880031064,0.0016544656,-0.0580246374,-0.0045569632,-0.0999285057,0.0556984507,0.0903104097,0.0170895774,0.0583862774,-0.066215761,0.051841598,0.0840933695,0.0152429016,-0.0776372105,-0.0182903074,-0.0661642626,-0.0625895932,-0.0413445085,0.0533219948,-0.0868840814,0.03489317,-0.067402713,0.0306993611,-0.067603685,0.0665297806,0.0921414196,0.027574528,0.0098568685,0.0124267861,0.0864892825,-0.0036577184,0.0409094915,0.0764330328,0.0950711444,-0.0212196708,-0.0213460904,-0.0924437419,0.0650985315,-0.0153249884,0.1037999019,-0.0338494815,-0.0243233144,0.0687119588,-0.0923252478,0.0869635642,0.0433061793,-0.057184495,-0.0682399124,-0.0220433641,-0.0412645303,-0.0498143099,0.0239964481,-0.0510794334,-0.0656313002,-0.0748149082,-0.1041766107,-0.0857794955,0.0877021551,0.0439436436,-0.0296196882,-0.0530695654,0.0827893466,-0.0351294763,-0.0884162709,0.0024529302,-0.0891624168,-0.0020588501,0.1002927274,-0.0073389299,0.0289726686,-0.1039464921,0.0289080814,0.0211732294,0.0369442441,0.0023336704,0.090719834,0.1014315188,0.08761812,-0.0234346539,-0.0548433326,0.067834489,0.0055489643,0.0051643811,-0.0650337413,-0.010246654,-0.0404562801,0.0081837242,-0.0194330625,0.0321863852,0.065931581,-0.1090942398,-0.0579828545,-0.1248151734,-0.0944250152,-0.0881449282,-0.1134995073,-0.087237291,-0.0711473301,-0.0375557654,0.0077098389,-0.0693950355,0.0385406911,-0.0748922229,-0.0327230506,-0.0181670506,0.0891476497,0.0833750889,0.0075522186,0.0277674478,0.0199825242,-0.0801983774,-0.1350551844,-0.0753629133,-0.1800990254,-0.0473278686,-0.0731720105,0.0166092254],[0.0433208123,-0.0506569557,0.072008267,-0.0195529293,-0.0174159091,0.0684564114,0.0746966973,-0.0437305197,-0.1087214723,-0.1180312261,-0.0663608909,0.0380594805,0.0509168394,0.0323238894,0.0591711402,-0.1026367918,-0.0428697355,0.025999967,0.0015451115,-0.0921006128,0.0224177781,-0.0210382901,0.0624685027,0.022887148,0.0332929157,-0.0283897165,0.0571405403,-0.0555996932,-0.0549434423,0.1167517677,-0.0315528661,-0.0361191481,-0.0381783955,0.0241623893,-0.0236916579,-0.0784274414,0.0069636749,-0.0068683433,0.0813444182,-0.0435525849,-0.017710302,-0.0903063342,-0.0651019067,0.062000636,0.0942740738,0.0498044565,-0.081194289,0.0029898209,0.078329958,0.0960411578,0.0586667098,-0.0473373607,-0.0504127331,-0.0864132866,-0.1011672318,-0.0962228477,0.0460765511,0.1190066785,0.0683619082,-0.0232373793,-0.0346572399,0.1019936204,-0.0191948526,-0.0883249417,-0.0400852077,0.0258921869,-0.0704615116,0.0836384594,-0.0921684578,0.0706445798,-0.0519245937,0.0834886357,0.0152571928,-0.0083216587,-0.0941002369,0.0912274271,-0.0004721648,-0.0528500564,-0.0982713774,-0.0562454388,0.0593049377,-0.0767306387,0.0355290137,0.0597623959,0.0291946772,0.1017925963,-0.0169398896,-0.0552779958,0.0215451512,-0.0710328147,-0.0049744537,-0.0955046117,-0.0670370013,-0.0364953838,-0.0920252651,-0.0255121458,0.0047195782,-0.1346924603,0.0511349067,0.0234946366,-0.0863110945,-0.0162792969,-0.0799517706,-0.1219858304,-0.1442730725,-0.0883601904,-0.0932851136,0.0039270925,0.095151566,-0.0681213289,0.1008262411,-0.05328352,0.0290794764,-0.006164304,-0.036300905,-0.0104839513,-0.0721739978,-0.0470144525,0.020195784,-0.1102228686,-0.0365015082,0.0538768098,0.0392341614,-0.0241473205,0.0815918595,0.1445839107,0.0030433834,0.0240534917],[-0.0441744328,0.0314741693,0.0191118065,0.048865892,-0.0089329751,0.0382715799,0.0917973071,0.1161464453,-0.040699359,0.0395694971,0.0201050844,-0.0824365392,0.0818776637,0.0304450113,-0.0112360977,-0.0201678574,0.06619858,0.0427457541,-0.100769572,-0.0217595771,-0.0028002576,-0.0734598264,-0.065500997,0.0208319612,0.0989325047,0.0392939746,-0.0644622967,0.0612995401,-0.1023562029,-0.0817447603,-0.0287215877,0.0342718922,0.0593607388,-0.1257886291,0.0384846628,-0.0417102166,0.1140359044,0.0364699177,0.0706862882,-0.0154056791,0.0972975567,0.0739184693,-0.0342215747,0.0929225013,-0.0341044851,-0.0797095597,0.0117972577,0.0771762356,-0.0203745626,0.0116068237,-0.0047370442,-0.0699960813,-0.0934703052,-0.0794791281,0.0871077478,-0.0644669607,0.0745370463,-0.0592317656,0.0176659692,0.101051949,-0.0329868533,0.0327076018,0.0267335717,-0.0460594594,-0.0602518842,0.098924838,0.0651084259,0.1036403552,0.0903520361,-0.0744769052,0.1041024625,-0.0235796105,0.0880294815,0.039744366,-0.1001141295,0.0387647934,0.0304795373,-0.0716391206,-0.0133522842,0.0609927438,0.0519048236,0.0057467055,0.0981221795,0.095324561,-0.1086758673,0.000234933,-0.0990004167,-0.0732523203,0.0550249219,-0.071115151,-0.0989371315,0.0621387511,0.0633150116,-0.0553798117,0.1013246328,0.0000656038,0.00588236,0.0575871132,0.0161636341,-0.0202534012,-0.0289115794,0.0692291409,-0.0325374305,0.0552739203,0.0112043768,0.0400182009,-0.0172345042,-0.0313999243,-0.0194369536,-0.077242136,0.0642930046,-0.1052877083,0.0179935656,-0.1056810245,0.0715522841,-0.0295552686,-0.0548776649,0.0933568627,-0.0200118069,-0.0779090375,-0.0019589637,0.118100211,0.0704598501,-0.0781962499,0.1303567588,-0.0164689422,-0.0228795744,-0.1505388319],[0.0539813153,-0.0278483424,-0.0429914966,0.0471707508,0.101682283,0.0486754589,0.0957061946,0.0246165264,0.0484526865,0.0679397583,-0.0038444554,0.0245410558,-0.0857082158,0.000240579,0.0346809067,0.041580271,0.0486728214,0.0186137185,0.0940071568,-0.0732030869,-0.0214119069,0.0193625577,0.0541148335,0.0880458131,0.0650626943,0.0790879875,0.0330753066,-0.0159807801,0.0840856582,-0.0890870392,-0.0160597302,-0.0097436002,0.0336939283,-0.0515859611,0.0231392439,-0.0060797743,0.0806302726,0.0936617851,0.0624882244,-0.0345368572,-0.020153027,0.0502376631,0.0764498264,-0.0642713755,-0.0314595699,0.0458833873,0.0290433634,0.0487228259,0.0329468772,0.1108374819,-0.0520678461,0.0348638669,0.0107640158,0.0084276078,-0.08804629,0.0234421287,-0.0442895144,-0.0233178511,0.0981685892,0.0185806863,-0.0834570453,0.0414156578,0.0517525077,0.0608232506,0.0374585688,0.097508423,-0.0032154843,0.011351076,0.0596782342,0.070074141,0.0399023555,0.0391454399,-0.0815516636,0.0555219613,0.0993234664,-0.0339809172,0.0393606722,-0.0935424939,0.0550054945,-0.0247883014,-0.0543227047,-0.0251920745,-0.1050699875,-0.0205074269,-0.050891526,0.0917450637,0.0210644882,0.0732664391,0.0253676753,0.029343497,-0.0608478822,-0.0369153284,-0.0758146644,0.1131251082,0.0085052121,0.0127980812,-0.0337757803,0.0782239512,0.0651009828,-0.0168682542,0.0344556905,0.0756131932,0.0062419074,-0.0341030806,-0.1068003699,-0.0837181956,-0.1455737054,0.0391745344,-0.0623725839,0.072259374,-0.034522742,0.0464507639,0.0941666961,0.0060041081,-0.0336537585,-0.0271688867,-0.0635498539,-0.0968668908,-0.082518369,0.0736250505,0.0140528409,0.0999986902,-0.0550834015,0.0588068552,0.0413680524,-0.0818618536,0.1150124073,-0.0918557495],[0.0004064113,0.0198686365,-0.0485154837,0.0614965446,0.0732763931,-0.028574815,-0.062305171,0.0691263527,-0.1063724905,-0.0838619247,-0.0076567358,-0.072325632,-0.0926670283,-0.1190314665,0.0872462094,0.0203290172,-0.0063208267,-0.0136953127,0.0555659756,-0.0905482695,-0.0085980315,-0.0753080696,0.0499731116,0.0492804199,0.0478950217,-0.0639282539,0.0712538362,-0.0822937191,0.0276676584,0.0863885656,0.0652083606,0.0642462149,-0.0855028927,-0.0041863155,-0.0835067108,-0.0256557167,0.094568558,0.003210481,-0.0735032335,-0.0669470802,-0.0042933198,-0.1131605431,-0.0084739057,0.0664925203,0.0099964328,-0.0223560166,0.1067945063,-0.0965679884,0.0525489859,-0.0409867987,-0.0970910117,-0.0417487919,0.0520312935,0.0127593633,-0.0294915847,-0.1074428558,-0.0389137007,-0.0753469169,-0.0674067736,-0.0425464362,-0.0294245649,0.0903590769,-0.0295575708,-0.0794026628,-0.0836179182,-0.0351644531,0.0985439718,0.033191029,-0.0182846058,-0.095487237,0.028772926,-0.0090078916,-0.0431193151,0.0792425349,0.0529285632,0.0189617351,0.0042497651,0.0306898411,-0.0798143595,0.0914522558,0.0087758256,0.0761964917,-0.0569537096,-0.0016378841,0.0910325944,-0.0062278593,0.0897819474,-0.0242146403,-0.0933620706,-0.1140829101,0.1152495593,-0.1095440984,0.0164030083,-0.0104379486,0.0485039689,-0.0133998198,-0.1380782425,-0.0431985259,-0.0971312895,-0.0712435022,-0.1224185303,-0.1106417626,-0.0302060787,-0.0333093144,0.0706978738,-0.0462401584,0.0588715933,-0.0528034084,-0.0161959492,-0.0484528355,-0.0397577472,-0.046557311,-0.0621606782,-0.0775415078,-0.1191715896,-0.0585495494,-0.11522834,0.0875795558,-0.1065642312,0.0768256858,-0.0940220803,-0.0341305733,-0.052984681,0.0365953743,-0.0020162591,-0.0583617389,0.0319749862,0.0575989112],[0.0518945977,-0.0403267778,-0.083749786,0.0350514278,0.045248203,0.0314684063,-0.0681218803,0.0093795191,-0.0271901209,0.0497179553,-0.0296141077,0.0983500779,-0.1138012111,-0.1896693856,0.0211306009,-0.0283609405,0.1137642786,0.0806726441,-0.0052603451,0.0723735467,-0.0312504619,-0.0629451424,0.0365335941,0.0534628667,0.0686527342,0.1225024015,0.0543686673,0.0942709893,-0.0218062028,0.109280616,-0.0988886431,0.0575534292,0.096850045,-0.024684092,0.1137590781,-0.0020424642,0.0942296684,0.0414632335,-0.0043879333,0.0559271611,0.0851748213,-0.0430500135,0.1070219129,-0.0811158866,0.0647256598,-0.093766205,-0.033317972,-0.0870154127,0.0826500133,-0.0999228209,0.042071145,-0.1172075421,0.0566479675,-0.0037939849,0.0777137801,-0.0446657501,-0.0743520334,-0.0107691865,-0.0877550393,0.0974241868,0.0887587667,0.0829748735,0.0355830565,-0.0549432114,0.0568398908,-0.1054902226,0.0306613799,0.0576996878,0.0183631573,0.052455835,0.0084011434,-0.0792317837,0.0282663181,-0.0460595563,-0.1013943478,0.0681422353,0.0344755203,-0.0886327848,0.065976344,-0.0916928947,-0.1071409583,-0.0091823051,-0.1169664785,0.0837037116,0.0577503145,-0.0710012242,-0.0437519662,-0.038850978,-0.0442689806,0.0162209254,0.0174900368,0.0565383844,-0.0257800221,-0.0029220544,-0.0175824407,-0.1054032221,0.0610330105,-0.0432902724,-0.1065745279,-0.0803444684,-0.1133449972,-0.1274482459,0.0814845935,0.0210200809,-0.0015641258,-0.0229793377,-0.0970391631,0.052625455,-0.0804400668,0.0670685321,0.0777516738,-0.10991171,-0.0433747172,-0.0503495857,0.0288636088,-0.0892830119,0.0130310245,0.0046118572,-0.1324169785,-0.0329552405,-0.0695437342,0.0897986814,-0.1078361198,-0.0760920569,0.1111211702,0.2958509922,-0.0421190783,-0.1223691553],[-0.0755831897,0.0152921807,0.0785993189,-0.0256002098,0.0897281468,0.1102488115,0.0155568551,-0.0848886743,-0.1139753982,0.0161644295,0.0181317031,0.0349178836,0.1048858613,-0.0609243363,0.0705692694,0.0303268954,0.0737761036,-0.0016031802,-0.0494989157,-0.1030262858,0.044110164,-0.0511406511,-0.0965573192,0.1016733125,0.0340134278,0.1377513409,-0.0866079703,0.0518469326,0.0011809854,-0.059045516,-0.0323653966,-0.0701052472,0.0234355032,-0.0121053569,0.0934191048,-0.0886540115,0.054182414,-0.0561515242,0.0453797504,-0.0511495806,-0.0122787682,-0.0150335589,0.1067637727,-0.0786093622,-0.0645414144,-0.0939168483,0.087920472,-0.0433208346,-0.0396050252,-0.0683315471,-0.0268792603,0.0275076963,0.0256434176,0.0051747509,-0.0685321987,-0.1092047244,-0.0424404778,-0.0177330356,-0.0189430546,0.0765046775,-0.0826385766,-0.0474957488,-0.1104568467,-0.0067156446,-0.0826799273,0.0527968705,0.0719316155,0.0733400956,0.0174228605,-0.0116642509,0.0833141729,-0.0501356348,-0.0967823714,-0.0376773402,-0.0869918689,0.0526947975,-0.0583069846,0.0797628462,0.0133989649,0.0417681597,-0.0638693273,0.0243155453,0.0635091811,-0.0724454522,-0.0307218041,-0.057088308,-0.0804467276,-0.0462732203,0.0715334266,-0.1109966487,-0.0833251178,0.0300517194,-0.090585351,-0.0764804929,-0.081448473,0.0058443975,-0.0306147039,0.0594931655,0.0555791073,-0.020405259,0.0341128595,-0.0501917303,-0.1167726964,0.0688290745,-0.0895254165,-0.1040378138,-0.0512286872,0.0651963949,0.0755766928,0.1129430458,0.073330462,0.0147088971,-0.0441495404,-0.1190462112,-0.0989906713,-0.0545836873,0.0682391971,-0.0554147437,-0.0083202766,0.0396513604,0.0647845641,0.0865732431,0.0104704974,0.1071359739,-0.1129724309,-0.0828326419,-0.0881499276,-0.0513760634],[0.087595202,-0.1145505831,0.0338042527,0.0038006895,-0.0556482524,-0.0188298766,-0.055559855,0.0036571745,-0.0223288741,0.0736180767,-0.0098711671,0.095285885,-0.0872234851,-0.0177216213,0.0268866885,0.0112686306,0.0103004137,0.0604381785,0.0977015346,0.0786304399,0.0685437396,-0.0904080942,0.0524670593,0.0229435656,0.0094702654,0.0787543878,0.0339176618,-0.0366673656,-0.0505826697,-0.051245641,-0.0513887033,-0.070178315,0.0896632522,-0.0207385756,0.0034648669,0.0381297171,-0.0713206008,-0.0488596745,-0.0458058678,-0.090349853,-0.0104684485,0.0749750584,-0.025575554,-0.0272261482,-0.0259335041,0.075620234,-0.0849543065,-0.0819407254,0.003483623,-0.0349046178,-0.0630094931,0.0613014996,-0.0161146205,0.0241907574,-0.1001891047,0.0130031556,-0.0711196512,0.014717021,-0.0914295614,0.104213357,0.0493062101,0.0030557618,-0.1209537759,-0.0531056523,0.0360348485,0.0089902021,0.0871767849,0.0136815161,-0.0223357715,0.0659522191,-0.0974187255,0.0167495012,-0.1105868295,-0.0071820291,0.0661181435,-0.0592666045,0.0087060044,-0.0018528519,-0.082655102,-0.0175641682,-0.0809133574,0.0085045723,-0.0676424429,-0.0818122178,-0.0962991267,0.071541965,-0.0186570939,0.0201734193,0.0161794163,0.0689708441,0.001417121,-0.0791847631,0.0646052137,0.0981536657,0.0946502313,0.0948527902,-0.0301134009,-0.0412207507,0.0044779228,0.06891267,-0.0440675877,0.0356963873,-0.101361908,-0.0695072711,0.0583901927,-0.0899124965,-0.0747187287,0.0523949303,-0.0632774457,0.0171041116,0.1178485006,-0.1047577709,-0.0471735746,-0.0157993436,-0.1207434982,-0.0406419225,-0.118020758,0.062963903,-0.1124481186,0.079095535,-0.0876872912,0.0552440137,0.0336929858,-0.0105513223,-0.0151912766,-0.0008648784,0.0948887989,-0.0515320897],[-0.0017768868,0.0599989258,-0.0279523488,0.0662455708,0.0656728446,0.0792634115,0.0843936205,0.0464700758,0.0921187773,-0.1156601831,-0.0495041199,0.0545585863,-0.0578196719,-0.0348908752,-0.0310669076,-0.1224220768,0.0248693991,-0.0687758699,-0.0343565978,-0.0526646823,0.0640317276,-0.035292659,-0.0797666535,-0.0923155397,-0.0796219185,-0.0336937383,-0.0219175592,0.0397150144,0.0509683825,-0.0839991942,0.0160073005,-0.0054155723,0.0311559681,0.0467171036,0.0944718793,0.088440381,0.102684699,-0.0916222483,-0.1049015373,0.0092326663,-0.0780448765,-0.0776531994,0.0115146842,0.0774553046,0.0581067763,-0.1129293218,-0.0463028774,0.0268778726,0.0857056677,0.0203688201,-0.0525089651,-0.0194499753,0.104139477,0.0274597425,-0.0628075153,-0.0978349522,-0.1221550778,0.0222367533,-0.0361242332,-0.0743044764,-0.0719885677,0.071840398,-0.0398014002,0.0803017914,-0.0814531073,0.0092500653,0.0810935497,0.0007645096,-0.0169078857,-0.0938690156,0.0351836532,0.0305915214,-0.1086991876,-0.0096794767,0.0797802433,0.1145822778,0.0634122044,-0.0502733663,0.0710457861,0.0817422345,0.0137122236,0.0520538352,-0.0770534948,-0.0310959928,0.0645635948,-0.0494767129,-0.1032914743,0.0466661677,0.0600020476,-0.0965588465,-0.0320440121,0.0343113542,0.1018275395,-0.0509360693,0.0895377398,0.0079084309,0.042528335,-0.004601229,-0.0642238259,-0.059771128,-0.090120554,0.0191321243,0.0251595378,-0.074550271,0.0213496517,-0.1212731078,0.0027264568,-0.0434475131,-0.08817368,-0.0619983189,-0.0490482859,0.0125724236,-0.0972397104,-0.0083761355,-0.0760090128,0.0675484836,0.0650991648,-0.0342342742,-0.1282733679,-0.02280543,0.0070736771,0.0197463557,0.0037910386,0.0466571264,-0.0324558355,0.1479087472,0.1066167802,-0.0020712693],[0.0190428719,0.0156491678,-0.0198630784,0.0612519607,-0.0769882128,-0.0353007875,-0.0419975072,0.1090624556,-0.1102982759,0.0224651489,0.0218122676,0.0832824409,0.0204137303,-0.0781711191,-0.0374317616,0.0763698071,0.0062141344,0.0941010937,0.0366857462,-0.0320207402,0.1006870568,0.0854849294,0.0861678645,0.0476917811,0.0668196678,0.1374081969,-0.0103560966,0.0153174382,0.0223745648,-0.091548644,0.0083824573,0.0663237348,0.0649910867,0.0472060889,-0.0149327293,0.0661898181,0.040749535,-0.0386705995,-0.0891711712,-0.0780403391,0.0697469935,0.0851833448,-0.0242248904,0.0580224954,0.016495958,-0.0906747729,0.016414972,0.0279888995,-0.0505231693,-0.0843848661,0.065871343,-0.0687040463,-0.0485958531,-0.0859260261,0.091143474,0.0184409749,0.0021138934,-0.0193739645,-0.0576890111,0.0516510308,-0.0142840846,0.031711705,-0.102880083,-0.0154722519,0.020890737,0.0772881433,-0.0062773139,0.0059210379,-0.1080318168,-0.004697239,-0.0568917617,-0.0991462395,0.0871028081,-0.016333919,-0.0469838418,0.0688714758,0.0659432039,0.0894900039,0.0225477312,0.0892906263,-0.0818554237,0.0034223555,-0.0491032749,-0.0787902623,0.0091672186,0.0372560434,-0.0942622647,-0.0136303874,-0.1085129529,0.0759004802,-0.0962454081,0.0836709663,-0.0258191004,0.0090959631,0.0016697472,-0.0164610669,-0.1159617007,-0.1028176919,0.0677737668,-0.0577150844,0.0138838496,0.0244942531,0.0382457338,-0.0400571339,0.0120655568,-0.0772984475,-0.1266920865,0.0308625214,0.0423284881,-0.0972139984,-0.04440194,-0.1051925123,-0.0956662893,0.0189769492,0.0567680225,0.0157802515,0.0197603684,-0.0707733184,0.025107,-0.1153770238,0.0636522546,0.1256417483,-0.0259167384,-0.0612292886,-0.002238797,-0.0710679591,0.1016074792,-0.0220463611],[0.1117227077,0.0241419096,-0.0665882006,0.0256995428,-0.0506294258,-0.0844387636,-0.1007669121,0.0827953964,-0.1072243005,0.0293411333,0.1153810471,-0.0771524981,-0.0340294428,-0.0176418908,-0.0291195326,0.0798527002,-0.0447262675,-0.0413436666,0.113358587,0.0189623218,0.0765036866,-0.0218916275,0.0920408517,0.0299598835,-0.0704996362,0.115350619,-0.0002121001,0.057090085,-0.0870211273,-0.0879895613,-0.0353901945,0.02687978,0.0648170561,-0.0281288624,0.0494566634,-0.120804958,0.1010164842,0.0725806355,-0.0402501896,0.0941607133,-0.0093403114,0.0676105618,0.0525382161,0.0360001139,0.0546910949,-0.0421936586,0.0573515035,-0.0761517212,0.1018421501,-0.0503464527,0.081027545,0.0156530254,0.0669248328,-0.0676847249,-0.0014697209,-0.1113244444,-0.0647021607,-0.0183625687,-0.0877631605,-0.0143676838,-0.077415891,0.0902327299,0.0036788289,-0.045701962,0.0718420669,-0.1075825989,-0.0120092155,-0.0922952965,-0.1196843907,0.0611423701,-0.0560972951,0.0041314624,0.0051224018,-0.029914869,0.0851627365,0.0124790585,0.0979923159,-0.0747888535,-0.0418580584,0.0413704813,-0.0770164356,0.0344494842,0.0429401174,-0.0072874376,0.059693478,-0.0517190136,-0.039197389,-0.0000708655,0.0925013945,-0.1227257922,0.036447417,-0.0567819811,0.0391453579,-0.0245964881,0.0518452264,0.0254146475,-0.0474671535,-0.1098978072,-0.0367755108,0.0970011652,0.0674272403,-0.0853707492,0.0519523434,-0.0861112475,0.0494634509,0.005236506,0.0217071045,-0.1019001231,-0.0700156838,0.0850803107,-0.0156678278,-0.0589983501,-0.0413052998,-0.0023001805,-0.1365492046,-0.0482040346,-0.0415338948,-0.0503026322,-0.0006578951,-0.0844065174,-0.0845627934,0.1197208464,-0.1418337971,-0.0119493678,-0.051875215,0.0346067101,0.0074570309,-0.0383148752],[0.0099692876,0.0131121725,0.0930805951,0.045116365,-0.0375499725,0.0570593178,-0.1058925241,-0.0507973321,0.0196447484,0.120175764,0.0841656923,0.0242793355,-0.0925953612,0.0405334271,-0.0144767519,0.0318562724,-0.0769081935,0.0229590759,0.1138037592,-0.010532219,0.0373319462,-0.1031585038,0.1149073467,0.0654177964,0.0788506493,0.0588933639,0.0576060936,-0.0247171167,-0.0387021229,0.0897859707,-0.020800028,0.1129437536,0.0797578469,0.0475459769,0.0377030298,-0.0642478541,-0.0928638056,0.0394748375,0.0280637164,-0.0541857332,0.1066676974,-0.0574410968,-0.0853923112,-0.0345136449,-0.0258342046,0.0629107207,0.0937139615,0.0669215918,-0.0478940196,0.0264097918,-0.011533848,-0.0806367919,-0.0458818451,0.1159723923,-0.0560696386,-0.0970389396,-0.0852347314,0.1077457741,-0.0923474878,-0.0594774969,-0.0437111035,0.0058230422,-0.046938736,0.0599853396,0.0047696172,-0.1034463719,-0.0172352791,-0.0251005236,-0.0886804685,-0.0972279236,0.0843451843,-0.0325830318,0.0228636134,-0.1038434282,0.0524423644,-0.0567426011,0.0398323089,0.0721379593,-0.0365569331,-0.0870608166,0.0769830048,0.085602887,-0.0704087168,0.1060619652,0.004143517,-0.0282759722,0.1169512048,0.0499056466,0.0824116394,-0.01141709,-0.0999042913,-0.1140005738,0.0554181077,-0.0086902063,-0.1039008424,-0.0126186479,0.0546792261,0.0606814064,0.0871176869,-0.0515122972,-0.0123715894,-0.0914931074,-0.1136567295,-0.1034598798,-0.0546457246,-0.1091017351,-0.0010721456,0.0957787484,0.1004023924,0.0722335652,0.0046503604,-0.1236883998,0.0034645065,-0.0075993328,-0.0847190171,-0.0347101502,0.0987986401,-0.0362919979,0.0204368737,-0.0397150666,0.0542442836,0.0142200328,0.009791634,0.0568063371,0.0283770915,0.0527322106,-0.0064553767,0.0135051813],[-0.0552603528,0.0191549454,-0.0345278792,-0.0802003443,-0.0252612717,-0.0821227431,-0.0080105672,0.0941581056,0.0087415325,-0.0793711394,0.0720127672,-0.0655918866,0.1024106443,0.0635495558,-0.0618036278,0.0240613054,0.0459590815,0.0890582949,0.0689023882,-0.1107570231,-0.0819609985,0.0672795922,-0.0306067243,0.0698245168,0.0077577345,-0.0185850468,-0.0315752029,-0.0669923425,-0.0755371898,-0.0830401257,-0.0753397346,-0.0571721829,0.0098606199,0.0533377044,0.1064007133,-0.0166374557,0.0816473737,0.1014996395,-0.0968223736,-0.059279155,0.0816878378,-0.0728092715,-0.0116659449,-0.0459110141,0.0048718024,0.0489321537,0.0721086189,-0.0312309563,-0.0233524237,0.0795110241,0.0307904817,-0.0281162355,0.0200037099,0.0900458097,0.0046570324,0.0371719636,-0.0405064076,0.0515646636,0.0262149256,-0.0488263778,0.0923004597,0.0788198486,-0.0607670024,-0.0461522937,-0.0039816732,-0.0235105529,-0.0726848468,0.0172246154,-0.0263453797,-0.0601733066,-0.033103317,-0.0007337662,0.0017001665,-0.0962969586,-0.1090849936,0.05911332,-0.0903958306,0.0840277672,-0.0628545433,0.0280944966,-0.0203288384,0.1099094823,-0.0738509968,0.0710280091,-0.0270779282,0.0686737373,0.0440667383,0.0161790587,0.0689364672,0.0663145185,0.0254019257,-0.0005342343,-0.0479060337,0.0171681903,-0.06770619,0.108097665,0.0045366008,-0.0682540089,-0.1247326732,-0.0940529257,0.1066005901,-0.0886004716,-0.108412303,-0.0117209572,-0.080708161,-0.0288548004,-0.0539923906,0.0138462149,0.0127110807,0.0907657966,0.0588521361,0.0281367097,0.0819156244,-0.0359140486,0.0296439286,-0.0858126655,0.0508224368,0.022777034,0.0408644788,-0.0373436846,-0.0247490555,-0.0268944297,0.0379289947,0.0018273334,-0.1138945445,-0.0880923197,0.1267665178,0.0949919447],[0.0504008457,0.0310913678,0.0753004998,-0.1248333827,-0.0874253288,0.052475132,0.0506003425,-0.0548694693,0.0163891353,0.0196639635,0.0014921123,-0.0228172131,-0.1185262576,-0.0079610953,0.0586043857,0.0243833885,0.0342076309,0.1036800072,0.0697621331,0.0756792203,0.0708964989,-0.1088937894,-0.0683518574,0.0120300902,0.114108488,0.0580169633,-0.0381693952,-0.012119649,-0.0115707247,0.0333845578,0.0229410455,0.0600292198,0.0389979482,0.003054725,-0.0437912196,-0.0311966594,0.0057835216,-0.0176351648,-0.0059621907,-0.0819152221,-0.0316486098,-0.1016849875,-0.1041344255,0.0394001342,0.0410549492,-0.1378804445,0.0400591381,-0.0975727141,-0.0707139745,0.1039737239,0.049823124,0.0654279888,0.0822156817,0.0970284864,0.0617288426,-0.106585905,0.09746968,0.0506789163,0.0928018168,-0.0739158764,-0.0519939624,0.0402653441,0.0323059633,0.0774888992,0.1037026122,-0.0899062082,0.067675598,0.0323027223,-0.0501148254,-0.0711223781,-0.1116003543,-0.0673414767,-0.0786539614,0.0042372756,-0.0696847737,0.1067771018,-0.0759744123,0.0836422443,0.0566683412,-0.1014239937,0.0002225908,0.093448922,0.0298976693,0.0646687746,-0.0649820417,0.0617737733,0.0298910309,-0.0380248278,0.0480073281,0.0758593604,-0.0059980284,-0.0463256128,0.0927083418,-0.0837251097,0.1115644202,-0.0904998556,-0.0863715038,-0.0172135849,-0.0173565596,0.0772790238,-0.0326888673,-0.0849172771,0.0101329535,0.027200833,-0.0597433075,0.0353331082,-0.1928700954,-0.0791132897,-0.0678119734,-0.0449176654,-0.0724415779,-0.0690498427,0.0180459619,-0.0464249477,-0.0226199683,0.0347552337,0.0011890358,-0.1032828242,0.0343494415,0.0758014992,-0.0750987455,-0.0614284165,0.0695046633,0.0038117038,0.1308907866,0.2073155642,0.0682092234,-0.0311604738],[0.01100823,0.0438964404,-0.0005355278,-0.0220024809,-0.0862757117,0.0282244142,0.0481755361,-0.037713632,-0.0765571818,-0.0008125851,-0.0270296726,-0.0439504534,-0.0873034,-0.0378362313,-0.0422190055,0.0714126155,-0.0919214413,-0.0064909901,0.0683709979,0.0092576696,0.015158141,0.0829291418,0.1064834967,0.018130593,0.0482442155,0.1032998934,0.0222784188,0.0448881872,-0.0332883112,-0.0448289327,-0.1148902029,-0.0563324429,-0.0761744156,-0.0213092789,-0.0872269347,-0.0371928215,-0.0903432667,0.0944178253,0.0168522745,-0.0571241006,-0.0119037572,0.0226009674,-0.0409264602,0.095384948,-0.0244275145,-0.0908731893,-0.0603289343,-0.0266681463,-0.0042546671,0.0072037927,-0.0159139261,-0.0902976915,-0.0529509522,0.0360794291,0.1054424644,0.0206869561,0.0632705092,-0.0181087423,0.1066489816,-0.0932822078,-0.0428707935,0.0432918034,0.0139484229,-0.0990547836,0.0459502526,0.0757571012,0.0731738359,-0.0322720781,0.0487454645,-0.0780880526,0.0120889591,-0.0885369182,0.0823997557,0.0715250298,-0.0744152665,0.0803439394,0.0719083771,-0.0618740469,-0.0142296301,-0.0876057744,-0.0945923105,-0.0053548003,-0.0047861594,-0.0727830455,-0.0775917321,-0.0083026262,-0.1016132459,0.0261695739,-0.0076240851,0.0852642208,-0.0497146063,0.0712139904,0.0177600253,-0.1018685028,-0.0561664253,0.0470650867,-0.0671741366,-0.1287380904,0.0399743915,-0.0402157642,-0.049720604,-0.1562050283,0.024913406,-0.0457890257,-0.1090241894,-0.0257303864,-0.196852684,-0.0271199923,-0.1115693226,0.0503143035,0.056405887,-0.0514049381,-0.0797249153,0.0748633072,0.0177101884,0.003141226,-0.1058901697,-0.0183237065,-0.1023469269,0.0383161791,-0.0769449845,0.0572005548,0.0662038177,0.1276039183,0.0393512882,0.1319938451,0.0280210078,-0.0985212475],[0.0559353568,0.0191135313,0.0123062544,-0.1184755266,0.068152599,0.0810900778,0.071253635,-0.0813481733,0.0364606716,-0.0617621727,0.0938118622,0.111968331,-0.0909728408,0.0375923254,-0.0940714329,0.0327704996,-0.0772639215,-0.0388688892,-0.0224451441,-0.0316308998,0.0405658372,-0.0232542157,0.035564363,0.0515971631,-0.0390887894,0.1353387386,0.116596587,0.0352793448,0.1129928529,0.0994071886,-0.0825225413,0.065642111,0.0120231286,-0.0909512714,-0.0086204642,0.0854853466,0.0072043738,0.0034801271,0.0650824755,0.061402306,0.0158404391,-0.0474563055,0.1110558808,0.0631893128,-0.0003443906,-0.0640892163,-0.0377256982,0.0764099434,0.0177974086,-0.0060967351,-0.0790095851,0.0700498596,0.1066729054,-0.0699742809,0.078140907,0.0300191566,-0.0894973427,0.1006181315,-0.0745791197,-0.0793508366,0.0083726533,0.0247704778,-0.1372387111,-0.0277336948,0.0976998806,0.0838083178,0.1113034487,-0.059390489,-0.0820676312,-0.0063830917,-0.1166803166,0.0273146797,-0.0733674243,0.0972954333,-0.061256621,0.0711996257,-0.0561094098,0.0955677703,-0.0882261023,-0.0206653308,-0.075648427,-0.0069937115,0.0837529674,0.1020813361,-0.0292374287,0.0474679768,-0.0378175043,0.0474639423,0.0666289553,0.0182408951,-0.0634540841,0.0585394278,0.0800905898,0.031587787,0.1130351424,-0.1006591469,0.0618579686,-0.1027616188,0.0636274964,-0.1213606745,-0.0093676783,0.0060980245,-0.0803726688,0.039462164,0.0229528639,0.0091311364,0.049813427,0.0512724556,-0.1095586196,0.0596005544,0.015286793,0.007478069,0.072599642,-0.0535651334,0.0236506145,-0.035654258,0.088571921,0.022034483,-0.1080536321,-0.0273583513,-0.0896373242,-0.0087967087,-0.0522874221,0.0383411199,0.0054352479,0.0160899609,-0.0400276892,-0.1010835916],[0.0429169163,-0.0975565091,0.0368068404,-0.0555863157,0.0326856971,0.106768854,-0.0431407727,-0.0708579123,-0.0683758035,0.0868453085,0.0261664409,0.1077801436,0.0028477567,0.0318022743,0.0263612308,-0.0621725507,-0.0929425135,-0.0935402066,-0.0997105315,0.0556193292,0.0285843313,0.0819559023,-0.045667775,0.0437540859,-0.0063925367,0.0347177945,0.0886179581,0.0407363921,-0.0843410715,-0.0010486916,-0.0637460425,-0.0115622804,0.0434002876,-0.0715019107,0.108713001,0.0263331179,-0.0268964656,-0.0561407097,0.0201607049,-0.0729714856,0.0957636759,-0.0956452265,0.0020784489,0.0181970447,0.0679133683,0.0178865604,0.0625318289,-0.0716077313,-0.0194943137,-0.0466926172,-0.0739249289,0.0085719302,0.074251011,0.084908016,0.043602068,0.0646429732,0.0540845953,0.0880344361,-0.0134695368,0.0302313473,0.0043362752,-0.0520165935,0.0361097939,0.0518244952,0.0648367032,-0.0696137175,0.0998640433,0.0706706345,0.0563118383,0.0192782953,-0.0954508334,0.0531380475,0.0844416097,0.0969610065,0.0812687129,-0.0649703294,-0.0073351446,0.078360565,0.0777013674,-0.0308917426,-0.083079569,0.1054934189,0.0240222812,-0.0412668176,-0.0278270319,-0.0514471009,0.0569151938,0.0612404235,-0.0253800526,0.0056966948,-0.0827655792,-0.0060230279,0.0681593344,0.0654684156,0.055668924,-0.072546564,-0.0847794563,0.0393216014,0.0036924025,0.0292151663,0.072299391,-0.0854367912,0.0339109339,-0.0913691521,-0.1408561915,-0.0337163843,-0.0370524712,-0.060601633,-0.0254023056,0.0285217725,0.018480029,-0.0689930692,-0.0760802105,0.0806021467,-0.0111683644,-0.1196288243,0.1031377539,-0.0219201781,-0.0379202701,-0.026506057,-0.0583452769,0.0187849198,-0.0474135503,0.0969254524,-0.0703277439,-0.0078197084,0.0431502052,-0.0250392091],[-0.0776713043,0.0081376517,-0.0209200308,-0.1001428589,-0.0384664945,0.1137332395,0.0721134096,-0.0297077429,0.0067234482,-0.0110316807,-0.0073803845,0.1153731719,-0.0078660101,0.0454189517,-0.0794760808,-0.0173303802,-0.0301134232,0.0000440941,-0.0369189344,-0.0108158393,0.0769754201,-0.0797353908,0.1018730998,-0.01228071,0.0153524783,0.0144102611,0.1126148701,-0.0743437186,-0.0855338722,0.0999917611,-0.1142284274,0.0783567876,-0.0496022999,-0.075002335,0.1098589152,-0.0277594682,0.0991919115,0.1156199723,-0.0632025152,-0.0219648685,0.0803888068,-0.0169314612,-0.0628358871,0.0869790986,0.0265958086,0.0476615615,0.1041319519,0.0014780549,-0.062927261,0.0205747467,-0.0894316062,0.0186256357,0.0242860131,0.0475672968,-0.0557306372,-0.0044143498,0.0730929896,-0.01843578,-0.118962571,0.0298405848,0.0517715104,-0.0332533717,-0.1343282163,0.068534337,-0.089023754,0.0287347026,-0.0782446265,0.0265026223,-0.0588673279,-0.0433246195,0.044739902,-0.052603513,0.0259475112,0.0439333133,0.087359339,-0.0582886003,0.111264348,-0.0055184327,0.0123037547,0.0485335365,0.0250260737,0.0007821373,-0.109055981,-0.0640324801,-0.0337812714,-0.1095939428,0.0755809173,-0.0703189299,0.0455678664,0.0848854855,-0.0059546931,0.0987292454,-0.0127540864,0.0069442154,-0.1061982363,0.0475152098,-0.106763497,-0.1183647066,-0.0761437565,-0.0606690943,0.0431505665,0.0841809586,-0.1081452593,-0.005555287,-0.032051146,0.0570435934,-0.1424308866,0.0902394131,-0.0545646027,0.0366770588,0.0173727982,0.0682082474,-0.0538171269,0.0241781417,-0.0482306071,-0.0232294053,-0.1092210338,0.0952005535,-0.1121805534,-0.051059898,-0.0166202374,0.032200709,0.0553699024,-0.035953328,-0.0184000563,0.0195553303,0.0950850844,-0.1154202893],[0.0160646047,-0.0324323885,0.0711420849,0.0951850191,0.013294545,-0.0228403434,-0.0075089256,-0.0768760368,0.047667224,-0.0212413631,0.0610877313,-0.0180482194,-0.0676355883,0.0547235049,-0.0535513908,-0.0983013585,-0.0963598639,-0.0594453141,-0.0529095158,-0.058154922,0.0875772238,-0.0156039968,0.074154973,-0.0710891858,0.0356573611,0.0716129392,-0.0941694751,0.0005661613,-0.0087102614,0.0835400224,-0.0970001817,-0.1072596982,0.0391097441,0.0110430894,-0.0502968132,-0.0192013774,-0.0488171764,-0.038538523,0.0220401287,-0.0600700229,0.100508444,-0.0743675381,0.0495233014,0.0495380722,-0.0750071183,-0.1350318491,0.0068789441,-0.0371695831,-0.063350752,-0.0182902962,-0.1010754555,-0.0787593946,0.0923541561,0.0742291585,0.0390168838,0.0900663286,-0.0557844378,-0.0096343383,-0.1124410033,-0.0248576403,0.0915348455,0.0963969529,-0.034459766,-0.0356267504,0.0461267903,-0.103049852,0.0993450209,-0.027310811,-0.0672089905,0.0765523911,0.0412581079,-0.0282542761,0.1102050468,0.0246926639,-0.0215277858,0.0635938272,-0.032335721,-0.1104075983,-0.0895908028,0.0378954262,-0.0718319565,-0.086084567,0.0178431794,0.0501249917,-0.0732979327,0.0551018454,0.0315249413,0.0132385073,0.0357298069,0.0100102825,0.0759372562,0.0989503115,-0.017327616,0.0424110331,-0.0871096402,-0.0589665025,-0.0486768745,0.0677958205,-0.0010861692,0.0615385659,-0.0344502106,-0.0910683051,-0.0241401307,-0.0013649574,-0.1135661602,-0.1342204064,0.0066847238,-0.0310372785,0.0806431472,0.0308946446,-0.0147245089,0.0931211859,0.0478023067,0.0111886803,-0.1137036756,-0.0821046755,0.0443909951,-0.1185133159,0.0808836147,-0.1144431159,0.0457847342,-0.0089416336,-0.1245500892,0.1045494229,-0.0245237499,0.1801715493,0.037506476,-0.1368035525],[-0.0472369902,-0.0749371946,-0.0778334886,-0.0427797064,-0.0740539059,-0.0193452332,-0.0429304391,-0.0429171063,-0.0759562328,-0.1222707182,0.0149060525,0.0499744676,-0.036913529,-0.1567749977,0.0244612042,-0.0307658035,0.0057430938,0.1132763401,0.087531209,0.029295627,0.0921271369,0.0655192435,0.0186670329,0.019195348,0.0295158178,-0.0646120682,0.1226324365,0.0051024738,-0.0919943526,0.1058051586,-0.1026575416,-0.0188846551,0.0987740755,-0.0852152035,0.1067774892,-0.0442456678,-0.1007024571,0.0424362943,-0.0534775779,0.1013918445,-0.0068684118,-0.1126733273,0.103304103,-0.0976742283,-0.0240691006,-0.1096197963,0.0801034644,0.0838570371,-0.0444516689,0.0859264582,-0.0447218977,-0.0066610342,-0.0198292527,-0.0399175584,-0.0774411261,0.0965619087,-0.0785117373,-0.0716592893,0.0968651995,0.0414185002,-0.0662695765,0.1027762219,-0.0132655483,0.0315803401,0.0864144862,-0.0987173021,0.1134256199,0.0314994082,-0.0322527029,0.100813821,-0.0335088111,-0.0617953129,-0.0563114882,-0.0649181381,0.0758332685,0.0407472663,0.1096474603,0.0206665639,0.0531892329,-0.0646081269,-0.0781062767,-0.0756597444,0.0358607583,-0.0692787543,0.0307612047,-0.0696371198,0.0192592945,0.076278463,-0.0895497873,-0.0747229755,-0.1013162211,-0.0747033507,-0.044752527,-0.0143833198,0.0972696021,-0.0047566281,-0.1251636147,0.0360934325,-0.0023774887,-0.0729799345,-0.0751933977,0.023968257,0.0648686439,-0.1196940541,0.0164536368,0.0379698686,-0.1026264206,0.0131839952,0.0360550061,-0.0147248004,-0.0630535632,0.0469513275,-0.1497082412,0.0567799322,0.036891818,0.0249662083,-0.0633166656,-0.0985537693,0.0499900766,-0.0406090878,-0.0116608702,-0.1112816036,-0.0023679687,0.0720543638,0.0433347113,0.077886641,-0.0254061315,-0.0786947757],[-0.1000772864,-0.1114571989,-0.0014673712,-0.1132377684,-0.0648991466,-0.0651568174,0.0200980809,0.0060213497,-0.0947199538,0.0443868674,-0.0073557491,0.0330249853,-0.0090827923,-0.103018932,0.0722751766,0.0835860074,-0.0979058295,-0.0593923628,0.0785037652,0.0885960311,-0.0771746114,0.095172219,0.0364333279,-0.0904647112,0.0748551041,0.0993567333,-0.0861069411,0.0508822314,-0.0112161208,-0.0975394547,0.0016269857,-0.0546324179,-0.1000192314,-0.0716242939,0.0400121436,-0.124839969,-0.041455552,-0.0221662037,0.0601989105,-0.0553972535,-0.0923369974,-0.0651161745,-0.0598139316,-0.0873759836,-0.1056415811,0.0581105873,-0.0886626914,0.0616651252,-0.0917561576,-0.0685564056,-0.0732630044,0.0234154984,-0.0777647197,-0.053266041,-0.0237111878,-0.0917086303,-0.1087106466,0.0832735002,-0.0569651313,0.0656875223,0.0383481346,0.0455268137,0.0377778262,0.0402288772,0.0375219695,0.0713549033,0.0225201454,0.0001062003,0.1010951623,-0.1150965989,-0.0764315128,0.0978979096,-0.0595031343,0.084991686,-0.0299704801,0.0421377085,0.0841798037,-0.0734591633,-0.0199982282,-0.0350237526,0.0649597347,-0.0771483481,-0.0714919418,-0.1121619716,0.013437626,0.0221812818,-0.1018550172,-0.0754407644,0.0701302588,-0.0400085002,0.0067641898,0.0127398716,0.0478611141,-0.0416833162,-0.0313498229,-0.0036685208,0.0232004579,-0.1167328283,0.0120689301,0.0151707884,0.0061174515,0.024669325,-0.1175483614,0.0598254539,-0.0392427631,-0.0161448196,-0.0447318405,-0.0667074919,0.0041317199,0.0539809316,-0.0687959865,0.0859398022,-0.051967293,-0.0549594797,-0.1130212918,0.0332127623,-0.089597553,-0.0094175125,-0.0487767346,0.0037782583,-0.0649286434,-0.0486889444,-0.1291341633,0.0981967822,-0.033658348,0.0479393862,0.0376115516,0.0336448327],[-0.0680799037,0.0594934672,-0.055231981,-0.1052181944,0.0558471605,0.0990695059,-0.0804491863,0.0352293141,-0.1037593335,0.0195270423,-0.0703168437,-0.020518776,-0.1065119356,-0.0684005246,0.0732500032,-0.0093606906,0.0228926819,0.113863647,-0.0183266159,-0.0185060874,-0.0704290569,0.0322464667,0.0347629376,-0.0968816727,-0.0016324006,0.125242576,0.1090992168,0.0380006693,-0.0450228676,0.0506190583,-0.1389734745,0.0622635558,0.0472798534,-0.040723335,-0.0939165726,-0.0333445743,0.109685652,0.0044056652,-0.0283454433,0.0847156122,0.102694355,0.0031623817,-0.0489203893,0.0090995962,0.0362018235,-0.0438254625,-0.0206512976,0.0069718021,-0.0353462547,0.0910181701,0.0892296806,-0.0036841636,0.0011853211,0.1128363758,0.0860529393,0.0037689754,-0.1155268177,-0.0197218191,0.0384543277,0.1043433025,0.0900322348,0.0515749045,-0.0814692155,-0.0667978227,-0.0437876657,-0.0865688547,-0.0957238227,-0.0726978853,-0.0987880826,-0.0980267078,0.0540998392,0.0491424017,-0.0701267868,-0.0930009633,-0.1153869852,0.0237375591,0.0421760418,0.1172807813,0.0659295246,0.028779231,0.0983843878,0.0198859759,0.0530273505,0.1060676277,0.0558022745,-0.0168485306,0.0882923529,-0.0397575423,-0.0197982639,-0.0034399927,-0.0625186339,-0.0366085917,0.0923035219,0.0702563524,0.034607932,0.0796606019,-0.0274573136,-0.0329734124,-0.1200192869,0.105377011,-0.1189579219,0.0450594053,-0.104403697,-0.0634144172,0.0106956679,-0.0713782758,-0.1405681521,0.0740448162,0.0251465123,-0.0305336621,0.011404979,-0.0198454037,-0.0042317398,-0.0987299606,-0.1374038756,-0.0731770694,-0.0006568369,-0.0632880032,-0.0367219821,-0.094752945,-0.1064491123,0.1217166856,0.0685008541,0.0303793978,-0.0490993224,0.049014464,0.0729330927,0.036045827],[0.0980690122,0.0634798929,0.0833556354,0.075145103,0.0621809773,0.0274588168,0.0053401045,0.069417797,0.024065163,0.0062189568,0.0314937308,-0.0338808857,-0.0831357762,0.0643448532,0.1022361442,-0.0169311315,-0.103687562,-0.0743185282,-0.0907639936,-0.0932429209,0.000073463,0.0973534733,0.0814950317,-0.0923539251,-0.1173672527,-0.0218087267,0.022536058,-0.0763910934,0.0343759246,0.0529598184,-0.052794151,-0.0926266164,-0.0190622769,-0.0408542566,0.0819621459,-0.056804888,-0.096639134,-0.0169590544,-0.0877729729,0.1143815145,0.0737944469,-0.0424285978,0.0691070557,0.008494176,0.0967145711,-0.1172473729,-0.0220458433,0.0206533689,0.0554622896,-0.0825956762,-0.044652395,0.0602983199,-0.0118557941,-0.0349914208,-0.0859993547,0.0286770985,0.0289539509,0.0124460021,-0.0872412845,-0.0426394194,0.0107717328,0.1084861383,0.04593499,-0.0880794227,0.0443689227,0.0806284994,-0.0975386128,-0.0413859636,0.0889170915,-0.0443416834,0.0187775604,0.0371268392,0.0395074263,0.0373938568,0.0193224084,0.0219181925,-0.0220856257,-0.0698547885,0.0616126843,-0.0627781525,0.0628326982,0.0460534394,0.0617600903,-0.00853696,0.024660863,0.0730548799,-0.0303033311,0.0262674596,-0.0445385762,0.0582915992,0.0535014644,0.0964409113,0.1007175669,-0.0500847697,0.079230547,-0.000474944,0.0685157254,-0.1203295738,0.0868562311,-0.084212333,0.0536662377,0.0215446055,0.0434268899,-0.0711055323,-0.1109689847,0.0869274214,-0.0386046655,0.01433283,-0.0773653388,0.0341413654,0.045050513,0.0593257397,0.0452623442,-0.0395002961,-0.1287088394,-0.0922824517,0.0275906436,0.0306945592,0.0772164613,-0.0616231151,-0.065086253,0.0812868848,0.0706299543,-0.0568389595,-0.0777839869,-0.1149900034,-0.0573252439,-0.0015663602],[-0.0343748704,-0.1251020432,0.0801135451,-0.0276044328,0.0377126485,0.0292089358,-0.0488781072,0.0087032504,-0.0453514457,0.000487407,-0.021832848,-0.051312793,-0.0417581163,-0.0125708319,-0.0881769285,-0.0654502138,0.0827369243,-0.0398611054,-0.0756752044,-0.0707650185,-0.104210332,0.0146396663,-0.0060408856,-0.1061431244,0.0746958032,-0.033158049,0.0642205253,-0.0704329684,-0.0773816481,-0.0294178147,0.0799188018,-0.0762641802,-0.0635842234,-0.0920337811,-0.0461546965,0.0577614084,-0.062902756,0.0440484434,-0.056730222,-0.0504951291,-0.0932870135,0.006092709,-0.0991235971,-0.0827909708,-0.0602997094,0.0854458138,0.1137892455,0.0327984206,-0.0524870716,-0.0620876923,-0.0255309381,-0.0529089756,-0.0481389798,0.025735531,-0.0833765641,0.1045016497,-0.1208562925,0.1202773303,0.096203886,-0.0727908611,-0.0069956062,-0.0002022415,0.0502639599,-0.060337048,-0.0829338506,-0.0493878387,0.1159288958,0.072541289,0.0668400228,0.0548792593,-0.0462712832,-0.0782880932,-0.0641822666,-0.0750866085,0.0432353728,0.0505690314,-0.0616229624,-0.1005011424,0.0031959114,0.0027945724,-0.0097427964,-0.0904537141,-0.0390186533,-0.0869074091,0.0070898817,-0.0141972601,0.10599453,0.0989540219,0.0061486163,-0.0376339629,0.0235276613,-0.1105767116,-0.0280564521,-0.0466917492,-0.0093508409,-0.1037433296,0.0643902645,0.0233886968,-0.0413840935,-0.0232432541,0.0458926782,-0.0661963969,-0.1229907945,-0.0269254558,-0.0070036952,-0.0546120331,0.0234963149,0.0211667512,-0.0530495979,0.1040589884,0.0461369641,-0.1138627157,0.0483514965,-0.0214496069,0.0607767738,-0.0399311036,-0.1058570221,-0.013393227,-0.0746735409,-0.0290626343,-0.0131930141,0.0641702339,0.045259513,-0.0186783392,-0.1113447025,-0.0603528135,0.1099224314,-0.0772221237],[0.0462776124,-0.0993077382,0.0641799197,0.0945385993,-0.0093698641,0.0073431982,-0.0886630416,0.0604875572,-0.0775303319,0.0178260021,0.06971962,-0.0109314062,-0.0190155972,0.0073253061,0.1080999747,-0.0054743998,-0.0801124126,0.0389772244,-0.0086349966,0.086289227,0.1150449961,-0.0051297932,0.0536370501,-0.0159111284,-0.001014143,-0.0333575681,-0.0581846982,0.0780170336,0.1095051765,0.062492501,0.0394468866,0.0085840663,-0.0064299209,0.0225895327,0.0751537457,0.0603941269,0.0951828212,0.0365715884,0.0868747979,-0.0401656106,0.0346531756,-0.0917762965,0.1073192507,-0.0311230943,0.0179370977,0.0834414363,0.1004869342,-0.1010246351,-0.0041044834,-0.0935162827,0.0969948545,-0.0165425595,0.0639377534,0.0352172665,0.0155621953,-0.077205725,-0.0330984108,0.0672035813,-0.045269344,-0.0156496689,-0.0820606351,0.0881186649,-0.0522371642,-0.1196769178,-0.0071765371,-0.0070286184,0.1157489121,-0.0152531052,-0.0478490256,-0.1010209396,-0.0397768989,0.0875042379,-0.0027180421,-0.013813776,0.0788166821,0.0542222857,0.0333159268,-0.0914383456,-0.0542581789,0.0737144351,0.0902514681,-0.0389803909,0.034707278,-0.024181826,-0.0077159912,-0.0639041588,-0.0370867141,0.0329003073,-0.0548798814,0.0055810651,0.0233099442,-0.0923751295,0.0399705395,0.0055280947,0.0969545692,0.0994156599,0.0641499013,-0.1184439808,-0.0084546376,-0.0783760697,0.015776895,0.0854332224,-0.1157734841,0.0178479962,-0.0785290822,-0.0607130192,0.01990005,0.1142279878,-0.1042403802,-0.0365990363,0.0259429421,-0.0636132807,-0.0222104676,0.0545490868,-0.1070066765,0.0615337454,-0.0242099259,-0.040654052,-0.1082457229,0.0442284979,-0.1135602891,0.019521039,-0.1276302338,0.0666265264,0.0026004729,-0.0729516596,-0.0104669649,-0.1096618474],[0.0022309695,-0.1017904133,0.0033402028,-0.1238279641,0.0500884801,-0.0134673603,-0.0062660836,-0.0082819685,-0.0311307125,0.0249608047,-0.0333635844,-0.0284193624,-0.1032445952,-0.177182883,-0.0865556672,-0.0194217861,0.0297956541,-0.0974332392,0.1018316299,-0.1000247449,-0.0067847786,-0.1041634977,-0.0233285371,0.0512563698,0.0082173003,-0.0459343269,0.0852994844,0.0955667794,-0.0574006364,0.0349645503,0.0420815386,0.0304441396,-0.0300572887,-0.1218685359,-0.004525587,-0.091390036,-0.0866448656,0.0635764375,-0.0183110517,0.0216602143,0.0930441096,0.0524825454,0.0389521755,-0.0499344058,0.0530089214,-0.1508780122,-0.0502938852,0.0629454032,-0.0671150982,0.0791655183,0.0506904162,-0.0391083248,-0.0986816883,-0.0497199297,-0.0279219467,0.044810418,0.0619059764,-0.0455604829,0.1016908213,-0.0242134016,0.1081636623,0.0431958362,-0.0085102692,-0.0527023487,-0.0697852895,-0.0493358001,-0.0490654707,-0.089541167,0.0864383355,-0.0204966906,-0.1116420329,-0.05986505,0.0069702701,0.0603492111,-0.0559481867,0.1077930555,-0.01860038,-0.1098859236,-0.0369024016,-0.1003354266,-0.0352494568,-0.0780861303,-0.0044455552,0.0132099492,-0.0566764548,0.0512592159,0.0614494309,-0.0065596504,-0.1037143245,0.0960092545,-0.0237277113,0.0058772811,0.0388162285,0.0604260676,-0.0627239645,0.0257163811,-0.0511532053,-0.104634814,-0.1092785895,-0.0709083974,-0.0454426371,0.0579160005,-0.1194872484,0.0141716814,-0.0093490956,-0.0292534269,-0.1915603131,-0.022341175,0.0864459649,0.0097543588,0.0571003444,-0.1170997247,-0.070276536,0.0895123333,0.0588704124,-0.0879407078,0.0116058877,-0.1024996415,-0.0031709336,0.0168836527,0.0270864107,-0.0616140813,0.0413637236,0.0913142338,0.5296701193,0.380310446,-0.0326265879,-0.0694528148],[-0.032385543,-0.0044858414,0.0867685825,0.0334986299,0.1143516004,