{"model":{"name":"model_1","layers":[{"name":"x_100","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_100"},"inbound_nodes":[]},{"name":"x_40","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_40"},"inbound_nodes":[]},{"name":"x_raw","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_raw"},"inbound_nodes":[]},{"name":"lstm_1","class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_100",0,0,{}]]]},{"name":"lstm_2","class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_40",0,0,{}]]]},{"name":"lstm_3","class_name":"LSTM","config":{"name":"lstm_3","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_raw",0,0,{}]]]},{"name":"concatenate_1","class_name":"Concatenate","config":{"name":"concatenate_1","trainable":true,"axis":-1},"inbound_nodes":[[["lstm_1",0,0,{}],["lstm_2",0,0,{}],["lstm_3",0,0,{}]]]},{"name":"dense_1","class_name":"Dense","config":{"name":"dense_1","trainable":true,"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["concatenate_1",0,0,{}]]]},{"name":"dense_2","class_name":"Dense","config":{"name":"dense_2","trainable":true,"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_1",0,0,{}]]]},{"name":"dense_3","class_name":"Dense","config":{"name":"dense_3","trainable":true,"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_2",0,0,{}]]]},{"name":"dense_4","class_name":"Dense","config":{"name":"dense_4","trainable":true,"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_3",0,0,{}]]]}],"input_layers":[["x_100",0,0],["x_40",0,0],["x_raw",0,0]],"output_layers":[["dense_4",0,0]]},"weights":[[[-0.0227084793,-0.0041495417,-0.0586697981,-0.0688485429,-0.0070197186,-0.0365976654,-0.0212738831,0.0752179399,0.062433809,0.0515805297,0.0739661828,0.0352176242,-0.0833315775,0.0361981653,-0.0532882772,-0.1005047262,-0.0133231068,-0.0407072753,-0.043041423,0.0241979025,0.0071484251,0.0066482648,-0.0280012526,0.0078435214,-0.0209781677,0.0843745321,-0.0238274317,-0.0668172389,-0.072986789,-0.0791360885,0.0554849021,-0.0533778854,0.0027183578,-0.0564891249,-0.0039578187,0.0412361287,-0.053761173,0.0542126559,0.004909589,-0.0235853251,-0.0895347819,0.0044930149,0.0138122076,0.0636149123,-0.0120032439,-0.0188918877,-0.0303387344,-0.0938120112,0.0030169922,-0.0661879927,0.0771139786,0.013086684,-0.0009541699,0.0508196987,0.064222008,0.0027193222,-0.0359473117,-0.0609470941,0.0397339016,-0.0405104756,-0.0691203475,-0.0774777532,-0.0659989119,0.0552124977,0.0810824707,-0.0119370874,0.0567228198,-0.003807195,0.0159143619,0.0465146974,0.0168833472,0.0666990355,-0.0268350244,0.0649684146,-0.0327695571,0.0641297176,-0.0133227753,-0.057014063,0.0028087131,0.0473565832,0.0408069715,0.0526064783,0.0507830754,-0.0772829726,0.019541109,0.0544553138,-0.0235834941,0.0329547487,-0.0773561522,-0.0929759517,-0.0739074945,0.0788329914,0.0465871617,-0.0618959479,-0.0742028207,-0.0069590798,0.0811292902,0.0367767587,0.0021766266,0.0181574654,0.0794216022,-0.0768946037,-0.0329844058,0.0541498512,0.0025228076,-0.0364168324,-0.0091457264,-0.0330211036,0.0036800129,-0.0034163322,-0.0801503882,0.0196768362,-0.0075000478,-0.0545308813,-0.0186211597,0.0120612029,0.071440883,-0.059473481,0.0514032692,0.0108101303,-0.0027501713,0.0702389926,-0.0465209521,-0.0472775362,-0.0124298548,0.0592669547,-0.0682219788,-0.0700865611],[0.0229523536,0.0023320229,0.078140974,-0.0959116891,-0.0520294458,-0.04415619,0.0376319103,0.0208945144,0.0676477551,0.0252029356,-0.0592606068,0.0791249871,0.0365716182,0.0743195117,0.0728154108,-0.0018897594,0.0068762158,-0.0266224332,0.0075829984,0.013158394,0.0347404219,0.0153030306,0.0072046602,-0.0283503383,-0.0439713672,0.0658813864,-0.0365627706,0.0243581496,-0.0725797936,0.0065395888,0.0139481565,-0.077045925,-0.0396793373,0.0312948562,0.0195006244,-0.0412778743,0.022762822,-0.0201500896,-0.0051772976,0.0260534976,0.0115763759,0.0709923133,0.0610357039,0.0231616702,0.0750916302,0.0732845366,0.0410607532,-0.046793662,0.0784629062,0.0542480275,0.0660251081,0.0368097834,-0.0750875548,0.0222007688,0.0079546096,-0.0663839579,-0.0142948879,-0.0711800084,0.0290146731,-0.0812880024,-0.004562303,0.0304501429,-0.0100716325,0.0346137844,0.0317990147,-0.0793834701,0.0081648622,0.0712995231,-0.0691614449,0.0256071668,-0.0249609109,0.0109329661,-0.0092182606,-0.037866924,0.0811814815,-0.015552599,0.0554286614,0.0084657315,-0.0373819172,-0.0738549903,-0.0725606307,0.0649012327,-0.0630115345,-0.0620696358,0.057434231,0.0708426386,-0.0604190417,0.0388058499,-0.0454807281,0.0169601459,0.0481906198,0.0101319402,0.0817490071,-0.0273923744,-0.0192517228,0.0781580657,-0.0126266461,-0.0183691531,-0.045255173,-0.0767325237,0.0422626585,0.0492450632,0.0260934681,-0.0566089004,0.0220703669,0.0680269375,-0.073924914,-0.0184249096,-0.0796979144,0.034742292,-0.092643179,0.0166127961,0.083115533,0.0011369218,-0.0663600713,-0.0573041141,0.0166544765,0.0518016629,-0.0362379365,0.0067673614,0.0534552373,-0.0402792096,-0.0374729186,-0.0476609021,0.0445362628,0.009116631,0.0757415742,-0.0512143411],[0.0896223485,-0.0524240285,-0.0884846449,0.0438841172,0.0070330072,-0.0161854494,0.0929970294,0.0236496609,0.0340772085,-0.0065922332,-0.033606451,-0.0734508783,0.0519752651,-0.0741463155,-0.0906836689,-0.0502763167,-0.034029305,-0.0112076066,0.068789795,0.0723721161,-0.0351040624,0.077658087,0.0798691586,-0.0617055632,0.0406192243,-0.0620049424,-0.0168865882,-0.0873768777,-0.0718937665,0.0874807462,-0.0110932887,-0.0782855898,-0.0111933472,-0.007864804,0.0530276,0.034865547,0.051784873,0.0518964306,-0.0755820051,-0.0786667094,0.0100396872,0.060402818,-0.0765256882,-0.0460775644,0.0428542718,0.0613974966,-0.0272276644,-0.0550317504,0.0650274828,0.0262841284,0.0377210863,-0.0531542338,-0.0306999125,-0.0081527671,0.0373517461,0.0222402252,-0.0834122375,0.080129385,-0.0426129773,-0.019610459,-0.0104113538,0.0567833148,-0.042917423,0.0578477867,-0.0352952145,0.0105187474,0.07849852,0.001591094,-0.0741965026,-0.0801876634,0.0417838618,0.0608118251,-0.03403043,0.038614139,-0.0401212946,0.0476997457,0.0366297998,0.0008909939,-0.0339526869,-0.0647575557,0.0020709634,0.0748255104,-0.0419791937,0.0326208025,0.006711625,0.0827315673,0.0265429411,0.0443542786,-0.0716103166,-0.0247380696,0.0856160745,0.0570296645,-0.0513541587,0.0088055441,0.050516028,-0.0224930272,0.0999122635,0.0774144307,0.0138801653,-0.0107609686,0.0676938519,-0.050671488,-0.0332739614,0.0492219739,-0.0578350089,-0.0027427587,0.0534564778,-0.027564384,0.0148492698,0.040459577,-0.0331045538,0.034995053,-0.0735581815,-0.0704256967,-0.0802860558,-0.063671805,0.0848305225,-0.0272212289,0.0625948682,0.0657031834,-0.092461504,0.0129561508,-0.0811881348,-0.0716349632,0.051065173,-0.0023732679,-0.0359620303,0.026109077],[0.0770154744,0.0540611707,0.0748613253,0.0011354928,-0.0896425545,-0.0527559333,0.0588256009,-0.023601735,-0.0750556141,-0.0342131443,0.0029522763,-0.0406262316,-0.0242311638,-0.0078008496,-0.0666239187,-0.0334578045,0.0924487635,-0.0521372296,-0.0465703644,-0.0142033929,0.0095395101,0.0278220624,0.0533372834,0.0787623078,0.0575657338,0.0125106256,0.0437823907,0.0756132081,0.0918818191,0.0757494494,0.0154951327,0.0284283068,-0.022182107,-0.0428281948,0.0752237439,-0.0020349526,-0.0782538056,0.0416161194,-0.0029769712,-0.0827320367,-0.0244875792,0.0739747658,-0.0466441177,0.0708347857,-0.0650553256,0.0314567015,-0.0117393872,0.0794681758,-0.0470431931,-0.0197233483,-0.0528410636,-0.0416100435,-0.0299924929,-0.0106073907,0.0848316625,0.0627177358,0.078246586,0.0668056533,0.0079046618,-0.0476387739,0.0406689979,0.0156438239,0.080482617,-0.0740607232,-0.0505902618,0.0676582828,-0.0765102804,-0.0172688626,-0.0744107217,0.0475445502,0.0541538969,0.0210008137,0.0624283738,0.0322279036,0.0542209893,-0.0652808547,0.0340129174,0.0076187844,0.0099909781,0.0872228965,0.0794438496,0.0491171442,-0.0106472932,-0.0547230914,-0.0923496187,0.0557059012,0.0229168106,-0.0183883663,-0.0138411513,-0.0647917911,-0.0381590165,-0.0424378216,0.0585766733,-0.0310269743,0.0532591976,-0.0604422316,-0.0425333567,-0.0731529072,0.0135416733,-0.0157366581,-0.074278973,-0.0708016381,-0.0268896334,-0.059400741,0.0170835312,0.0445348285,-0.0559081659,-0.0403717607,-0.0075931242,0.0148819666,0.0233412273,-0.0594155155,0.0152754681,0.0149161825,0.0179361422,-0.0318874866,-0.0044229096,-0.0001657514,0.0090773664,-0.047781758,-0.0820120722,0.0237392951,0.0784175023,-0.0152652683,-0.0675140321,0.029515544,-0.0808289349,0.0156956725],[0.0464472882,-0.0036688962,-0.0242269449,0.0683785379,-0.0180038605,0.0521868356,0.0754931867,0.0014222891,-0.0574812591,-0.0231666174,-0.0600514039,0.0045843767,-0.0850390345,0.0201809667,0.0088264951,-0.0323653892,0.0499716811,-0.0212059841,-0.0222867075,-0.0229648836,-0.0756246001,0.0177517664,0.0530766174,-0.0478316769,-0.0584342852,0.0439252034,-0.0249375924,0.0766409114,-0.054762587,-0.0115447883,-0.0226077996,0.0045447382,0.0514355898,0.0452820584,-0.0083041396,-0.0859783143,-0.0151236085,-0.0104869409,0.0726285949,0.0336468071,0.0727871731,-0.0402605981,-0.026462758,-0.0715163276,-0.0162457787,0.0271864254,-0.0207611583,0.0815448761,0.0403371081,-0.0676154122,-0.0041806712,-0.0835923702,-0.0285277776,0.0155053465,0.0163196195,0.0733701438,0.0645687953,0.0031193618,-0.0664687306,-0.07608895,0.0218501706,-0.0487234183,-0.0184088275,0.0713984817,-0.0205671489,0.0567272082,-0.0754515156,-0.0740513057,0.0463182405,-0.0345884226,-0.0438145921,0.0367184952,0.0098390663,0.0376475453,0.016670851,0.0524637066,0.0260195863,0.0296397377,0.0031799024,0.0918753073,0.0398909152,-0.0157697462,-0.0567933545,-0.012158813,0.0427245311,-0.0586312599,-0.0790896863,-0.0182832237,-0.0354890712,-0.0440641344,0.0250432007,-0.049490992,-0.0004967966,-0.0453568883,-0.0029104617,0.0853633881,-0.0752087384,-0.0720845684,0.0432826132,-0.0707345009,0.0582122244,0.0025643555,0.0067968355,-0.0540885068,-0.0024721141,-0.0423288085,0.0855267346,-0.0877359882,-0.0019353938,0.0784900486,0.0062988396,-0.00725292,0.0466545783,-0.0077310698,-0.0726036951,0.0028979166,-0.0735655427,-0.0870285109,0.0660837963,-0.0469229855,0.0591885597,-0.0872678831,-0.0704262331,-0.0186655875,-0.0602078475,0.0196551271,0.0026720469,-0.0435485542],[-0.0238605719,-0.06164103,-0.0317327902,0.0551472791,0.0094645452,0.0921155736,0.0293181129,0.0081386706,0.0704974234,0.0482101291,-0.0022001727,0.0790477693,0.0752843842,-0.074906908,-0.0641287342,0.0304646492,-0.0806331635,0.0645718947,-0.0087355226,-0.0892418399,-0.0639154464,0.0484246984,-0.015399917,-0.0921340138,-0.0461276323,0.0819531083,-0.0681168512,0.0432110205,-0.0482154153,-0.0347484574,-0.0176647455,-0.0636912659,0.0359341055,0.0071261283,0.0512503088,0.0434048213,-0.0849032551,0.0781245753,0.09317974,-0.0412972458,-0.0619350076,-0.0185885262,-0.0073229256,0.0645456612,-0.0718661472,0.0208389331,0.0475393385,0.018405471,-0.010816087,0.0717675984,-0.0238872133,0.0499959774,-0.0429287106,0.0521393791,0.0138305128,-0.0887901336,0.0040361797,-0.0427653864,-0.0028514497,-0.0531408675,-0.0588654391,0.0593452863,0.0891122073,-0.0850880444,0.0268759392,0.0636799261,-0.0083631957,-0.0234438386,0.0072740298,0.0013084403,0.0038822894,-0.0373769775,-0.009521476,0.0156423245,-0.0636907816,0.0914880559,-0.0428373627,0.0362224653,-0.0246021431,0.0356193893,-0.0421187133,-0.0719635636,-0.0758307502,0.0662907958,0.0432041548,0.0491454117,-0.0056159846,0.0052558142,0.003616363,-0.0793786719,0.0668723285,0.0564257987,0.0316640474,0.0434946455,0.0255615246,0.0650100261,0.0825431272,-0.000185156,-0.0024753381,0.058567293,-0.0261460673,-0.0769031495,-0.0956187993,0.0597905107,-0.0064442609,-0.0732404962,-0.0476787463,-0.0491834059,0.0470104553,0.0493868068,-0.0038587279,-0.0683819801,-0.077494964,0.0607012138,-0.0690218583,0.0607281774,-0.0554492995,0.0532673262,-0.0633008704,0.052615352,0.0129194604,-0.0330479741,0.0367731266,-0.0541879274,0.0188082382,0.0733357817,-0.0297148656,0.0135354027],[-0.0267832726,-0.0006333808,-0.0154663436,0.0288272407,-0.0117292199,0.0121062323,-0.0703486875,0.0382052772,-0.0559177734,-0.0157039072,-0.0207186639,-0.077284582,0.0567169413,-0.0644900724,-0.0054075145,0.0374461971,-0.0652386993,0.0818619803,-0.0694127232,0.0168418549,0.0878649801,0.0296386853,0.0121126724,-0.0407765545,-0.0341329426,-0.0051936563,-0.0118340971,-0.0246686731,0.0505490676,0.010092509,0.0255058408,-0.0708714277,0.0846315026,0.0605315678,0.0663059652,0.0580580458,-0.0460175239,-0.0433217734,0.0844669715,-0.0658241659,-0.0391654931,-0.0386350714,0.0814982355,0.0754879564,0.062398266,-0.0242359694,0.0105556119,0.058031965,0.079640992,0.051316075,-0.0827732533,-0.0921718329,0.0239973925,0.0047361073,0.0596290641,0.0683132559,-0.0619542077,-0.0664025396,0.0310849939,-0.0309636984,0.0032568956,-0.0710806772,-0.0436679013,-0.026198281,-0.0051956894,-0.0351852216,-0.0615841411,-0.0160177816,-0.08707726,-0.0215915628,-0.0476369336,-0.0133167077,0.0891208947,-0.071726881,0.0084647341,-0.0284020621,0.0142183173,-0.0670055151,0.070728071,-0.0061545633,0.0841156021,-0.0300486535,0.0411379486,-0.0126603479,-0.0660163164,-0.0431458056,-0.0557108819,-0.0054540238,-0.0040500895,-0.0184554867,0.0853629932,-0.074473694,-0.0377314389,-0.0278384462,-0.0562915355,-0.0473516583,-0.0146815153,0.054858502,-0.0942047462,0.0505885482,0.0803113058,0.0266521145,0.0101488763,-0.0171743911,-0.0828160197,-0.065798901,-0.0299138408,-0.0827312693,-0.0569866747,-0.0247615818,-0.0138592906,-0.0049897665,-0.0642730147,-0.0588327684,0.014809954,-0.0411469638,0.0659418404,-0.0134511702,0.0830972567,-0.0886200592,-0.0165825412,0.01346194,0.03891268,-0.0912752971,0.0181008559,0.0127171874,-0.0210805852,-0.0643587485],[-0.057415016,-0.0359543525,0.06852182,-0.0292307567,-0.0048987102,-0.0038901777,0.0745732933,0.0068104281,-0.0498225056,0.0657937676,-0.0140375616,-0.0802605599,-0.0631230846,0.016999064,-0.0114301378,-0.0025252732,-0.0619472899,-0.0476552695,0.0540547483,0.0370780751,-0.0324951187,0.0360069498,0.0275369771,-0.0331027284,-0.0386394039,-0.0202879719,-0.0088730967,-0.0668060705,0.0481715873,0.0722366795,0.0381475314,-0.0143662337,-0.0190635882,-0.0404542498,0.0660549849,-0.0285224449,0.0386756659,-0.0501372963,-0.0233049039,-0.092149727,-0.0833012164,0.0262945611,-0.0524815731,-0.0282963123,0.0567457825,0.045420412,0.0370522588,0.0440194607,0.0759331062,-0.031854596,-0.0235435851,0.0728934556,-0.0314374343,-0.0755976513,0.0719515458,-0.0297719799,0.0398040079,-0.0551338792,-0.0196618419,0.0463460311,-0.0787634626,-0.0761163533,0.0011299371,-0.0142541016,0.022492554,-0.0408901311,-0.0677926913,-0.0355184264,0.0820506811,-0.0483518466,0.0025106452,0.0518247709,-0.0745360851,-0.0015391586,0.0932576805,0.0605784468,-0.0772132128,0.0344155505,0.0169450659,0.0553851835,-0.0001109148,-0.0356390812,-0.0160122737,-0.07553076,-0.0590454377,0.0443712436,0.0645785332,0.0161425434,0.0026387735,-0.0337169096,-0.0243651718,0.0284595266,-0.0318675414,-0.0314941742,0.0041769473,0.0694319904,0.0666586086,-0.0581838973,0.0349494964,-0.0274070743,-0.0243546125,0.0208705161,0.0244711004,-0.0904096141,-0.0172328893,-0.0748803839,0.0872912109,-0.0056556854,0.0159782749,0.0700133815,0.0402639918,0.0707099736,0.0154145332,-0.0688975304,0.0666757971,0.0744968206,0.0091363154,-0.0251867287,-0.064459376,-0.0405197777,0.0202961862,-0.0057758824,0.0426851921,-0.0725389123,-0.0354407392,-0.0034675875,-0.0189272687,0.0105460882],[0.0804983974,0.0188856889,0.0064608725,-0.0239767563,-0.0773235261,0.0879374072,-0.0056391,0.070607163,-0.0701937079,-0.0089626946,0.0523092411,-0.0312987044,-0.021278467,-0.0525927506,0.0770086348,0.0604972392,-0.053604316,-0.0690385103,0.0442637987,-0.0360950418,0.0263145752,0.0105399294,0.0584155843,-0.0174586978,0.0282647051,0.0389889479,-0.0606147349,-0.0265588779,-0.0040295697,0.0773983076,0.0812326893,0.0426391959,0.0763355345,0.0393780097,-0.0127126807,0.0412513055,-0.0309059527,0.0586420968,0.0951354429,0.0198449567,-0.0468354784,-0.0066869142,-0.0303210188,0.0468675941,0.0473688021,0.0054187737,-0.0845356211,0.0583969541,0.0183519591,-0.0891243666,0.0589537397,0.0070268395,0.0285410993,0.0596723519,-0.0231031198,-0.0128298504,0.0047125136,-0.0611620657,0.0206577256,-0.0875857994,0.0740810037,-0.0302294251,0.0578622147,0.0561599769,-0.05328089,-0.022376392,0.0169191621,-0.0850688666,0.0664262772,-0.0257752817,-0.008234445,-0.0736828297,0.092097789,-0.0086247111,0.0244825557,-0.0323243551,0.0108004464,-0.011490101,0.0813111886,-0.0080739139,0.0221913531,0.0910752118,-0.0612562299,-0.0820212066,0.0288286619,-0.0174362529,0.0881729797,-0.0496727489,0.0379692204,0.0721955448,0.0230992399,0.0158293974,-0.0940340981,-0.030145146,0.0678193867,0.0500780679,-0.036835473,-0.0554916449,0.030099405,0.0779013187,-0.0021618356,0.0005036651,-0.0663700774,0.0007435572,0.0274382718,-0.0254697278,0.0671034157,0.0705243573,-0.0657869279,0.0827940404,-0.0749817342,-0.0782302469,0.0405727364,-0.0076899724,-0.0438419282,0.0757081807,0.0891563445,0.031088762,0.0003272677,-0.0333340541,-0.0038758952,0.0405239984,0.0768992826,-0.0292262025,-0.095518589,-0.00547458,0.016847128,-0.0714448169],[0.0720430315,-0.0247383174,0.0609674379,-0.0818744972,0.0511748567,-0.0671409667,0.0245480873,0.0739955977,-0.0516874455,0.0805698335,-0.0034358287,-0.0663193911,-0.0223061796,0.0012116788,0.029823754,0.0249030609,0.0243055765,-0.0717163533,0.0489095338,-0.0262353756,0.0861216486,0.0597394817,-0.001982392,0.0774344653,0.0327055603,-0.0071391314,0.055515416,-0.0247519184,-0.0562461689,-0.0303805377,-0.0362491645,-0.0251824576,0.0711408108,0.0201521963,0.0246495586,-0.0072545614,-0.0719898343,0.0346589237,0.0794298425,-0.0352868885,-0.0189595316,0.0367239639,0.0375435315,-0.0757563934,0.0402304754,0.0720747858,-0.0562089719,-0.0082656983,-0.0529109538,-0.0636967421,-0.0180427358,0.0209662765,0.0324429683,0.0542597398,-0.0088285208,-0.0533314161,0.0317659341,0.0745048821,0.0569412336,0.0564139709,0.0662186593,0.0266762972,0.0198492929,0.0590078831,-0.0711883903,0.022270564,-0.0614634752,0.0316232145,-0.015934201,-0.0659514368,0.0538624302,-0.0740625262,0.0161371008,-0.0556733496,0.0236250833,-0.0306070317,-0.0627840534,-0.047892496,-0.0549790375,-0.0665109009,0.0829695091,0.0307514481,0.0494066477,0.062266998,0.0743885189,-0.0304366816,0.0840811506,-0.0467592366,0.0292731021,0.0062001864,0.0248255767,-0.0154942945,0.0646607801,-0.0573951751,-0.093434222,0.0207262076,0.0127899395,0.03996953,-0.085544847,-0.0529088788,0.030443646,-0.0115780476,0.0217828155,-0.0595794953,0.02631687,-0.0089124674,0.0822212249,0.0038859923,0.0286752507,-0.0483003184,-0.05000576,0.0622557588,0.0756900758,-0.0186035149,-0.060972888,-0.0352616981,-0.0652708113,0.0173718818,-0.0623363592,0.0127025135,0.0294492096,0.0653554872,-0.0152292242,-0.0190735348,-0.0096217087,-0.0544772707,0.0402341001,-0.0516997427],[-0.0292705614,0.0719818473,0.0251556523,-0.0379172601,-0.074835062,0.0409388579,-0.0576701313,0.0737779513,-0.0829785168,0.0875317752,0.0892307386,-0.0281622503,-0.0543591678,0.0257584564,0.0133755831,0.0614888631,0.0929509178,0.0269164741,-0.0513999425,-0.0860304311,0.0492508262,-0.0856094062,0.0491677597,-0.0408742689,-0.0728506967,0.0781594366,0.0826921165,-0.0787682831,0.0384890586,-0.007747876,0.0039064945,0.0377186239,0.0571341217,-0.0618125498,-0.0650952011,0.024366552,-0.0551852472,-0.046137087,0.0898577198,0.0486872643,0.0551380217,-0.0211992543,0.0353131332,-0.0334414542,-0.0398548245,0.0349184424,0.0573692322,0.0553633422,-0.0742004886,-0.0545589738,0.0733057112,-0.0338266492,-0.038614966,-0.0163995996,0.0772349909,-0.0379564874,0.0624030344,0.0466992259,0.0343174264,0.0127655538,-0.022255348,-0.0107202642,-0.072063446,-0.0128808776,-0.0331779905,0.0179297291,-0.0686285645,0.0480991378,-0.0195522513,0.0408287011,0.0447596535,-0.0271084066,0.0870017707,-0.0057554422,0.0121259037,0.0019319572,-0.0214108173,-0.0600325167,0.0730550811,0.0737887844,0.0894375667,0.0796282142,0.0226547569,-0.0725890473,0.0743763298,-0.048446916,0.0143260555,0.0064052739,-0.0167843327,0.0606023222,0.063004829,0.0402743705,0.0512461849,0.0566013195,-0.0261326749,0.0044421479,0.0395700186,-0.0096134776,-0.0625927597,-0.0928550512,-0.0868690014,0.0228227638,0.0263879821,-0.0424933136,-0.0002247371,-0.0289632753,0.0330481306,-0.0361661613,0.0070308819,-0.0569972657,-0.0462573059,0.0362166502,-0.0546128117,-0.0966972113,0.0421973728,0.011008732,-0.0014487781,0.0373821817,0.0692147836,-0.0378865264,0.0287853237,0.0344765112,-0.0163996518,0.0689278692,0.0064539383,-0.0057114041,0.0120841237,0.0556861088],[-0.0705839396,-0.0122232251,-0.0012279535,-0.0016402156,-0.034410391,-0.0666978136,0.062131945,0.0201052595,0.0217963737,-0.0615171045,0.0879327282,-0.0522243083,-0.0198704358,0.0023458658,0.0731797665,0.0414594375,-0.076366365,-0.0669306219,0.0042843758,0.0583522394,0.0664930418,-0.0355260894,0.0091750566,-0.0462338254,0.0402826965,-0.0128544979,-0.0715184659,-0.0129169682,-0.0374079049,0.0867370442,0.0643834546,-0.0422951095,0.0860012174,-0.0454011932,0.0419864953,0.0450065322,-0.0921593681,0.0223377645,-0.001195462,-0.0409568138,0.0716434494,-0.0818171129,0.0316782854,0.01841373,-0.0455699787,0.0438721664,0.0667487308,-0.0552870817,0.091624476,-0.0102353822,-0.0466637686,0.0557650961,0.0373352878,-0.0765815601,0.0152730793,-0.0037923013,0.0697259232,-0.016986141,0.0366840139,-0.0523521937,0.0809012502,0.0341766328,0.0115908151,0.0089289173,0.029158283,-0.0731015652,0.0368932821,0.0668375343,-0.0081533063,-0.0103300838,-0.0188752133,-0.0692950562,0.0403250866,0.0832065418,0.0457633585,-0.0512977317,-0.079482168,0.0470860526,0.010598856,-0.0136677958,-0.0787933171,0.0783241242,-0.0121079497,0.0444699526,-0.0630515069,0.0569362901,0.0765220299,0.0046337792,0.0035129047,0.0548621342,-0.0707695037,-0.0790294111,0.0596103258,0.0538401045,0.0266308933,0.0733568668,0.046830263,0.0570149422,0.0444951653,0.0379963219,0.0464187376,0.0678822696,-0.0354202054,-0.062714465,0.0329848863,0.0088098152,0.0907711834,-0.0662569404,-0.0699365065,-0.050519865,-0.08165434,0.0007213844,-0.014566415,-0.0048184693,-0.0081999339,-0.0048244139,-0.0708482265,-0.055775363,0.0853947029,-0.0605734661,-0.0645023063,0.0185120981,0.0052906564,0.0658947229,-0.0806593373,-0.0504627973,0.0247100089,0.0633042678],[0.0624961667,-0.0022703698,0.0299238712,-0.0023649926,-0.075970009,0.0874910876,-0.019292444,0.0264362972,0.007656571,0.0610996485,0.001053706,-0.0638138428,-0.0658548698,0.0191671439,0.0090304632,0.0022846002,0.0670476034,0.0482994094,0.0156863146,0.0673848167,0.0608288795,-0.0229740832,-0.0662194788,0.0405705087,0.0190056469,-0.0398276858,0.0521208718,-0.0570272058,-0.0197159816,-0.0378579684,-0.0755926147,0.0768037587,-0.0771999881,-0.0295845568,-0.020518031,-0.0179467816,-0.0568743795,0.0476175621,0.050783217,-0.0850448459,0.0072501083,0.0842582211,-0.0167078767,-0.0661662146,0.0376336798,-0.029180849,0.0656232461,0.0048614722,-0.052608721,0.0821290016,0.0387289263,-0.0241415873,-0.0106231123,0.0521209016,-0.0520442985,-0.0171775613,0.0798832551,-0.0312315933,0.0195507873,-0.0681317449,0.0918151438,-0.0065142093,-0.0526109561,-0.0055312417,-0.0738433674,-0.0671261624,0.016279038,-0.0261605885,0.0458016917,0.0029786893,0.0669477135,0.032413844,0.0759607404,0.0430269688,0.0174622368,0.0754323825,0.0029210767,0.0502428785,-0.0781120583,0.089005284,0.0298829004,0.0604732744,0.0808990076,0.0498744547,0.0717197061,-0.0781209841,-0.0515418425,0.0217472482,-0.0899503902,-0.0390841067,0.0360886268,0.024285784,-0.0677355453,-0.0851204097,-0.0153773269,-0.0153952371,-0.0395516343,0.0672051683,-0.0773548782,0.0550324917,0.018951932,0.0493760891,0.0730965137,-0.063014105,0.0161987152,-0.0436654352,-0.0594086163,0.0303859618,-0.0063019469,0.0319747105,-0.0243255757,0.0387941338,-0.0355669595,0.0616236515,0.014639589,0.0438359268,0.0338076912,-0.0854534432,-0.0519709177,-0.0986233577,0.0187618509,0.0374861434,-0.0585203506,-0.0100586154,-0.0680327117,0.044005841,0.0044478504,-0.0116565004],[0.0729252845,-0.0325335115,0.0630115196,-0.0270655509,-0.0044359094,0.0505543835,-0.042764388,0.0318454169,-0.0322607644,0.051979214,0.0736520514,0.0378505811,0.0661297217,-0.0325416103,-0.0020764652,-0.0365691893,-0.0815526992,-0.0689906552,0.0732581019,0.0508044437,0.0377029032,-0.0160075705,-0.0429639965,0.012902257,-0.0367605016,-0.0629410297,-0.0418834686,-0.0103770373,0.0750646815,-0.0397507772,-0.0717494935,0.0248617046,-0.0416322984,-0.0538957082,0.0478213876,0.0497626998,0.0365037471,0.0211388096,0.0350312106,-0.0443434902,-0.0410490073,-0.0804328471,0.0320872031,0.0711051971,-0.0017218021,0.0755452514,-0.0120992502,-0.0364537388,-0.0027313081,0.0540420786,-0.0348040275,-0.0668020099,-0.043023672,-0.0744363889,-0.0045132926,-0.0019262058,0.0521487705,-0.0368748233,-0.0793342143,-0.0318698958,0.0891852975,0.0523702912,0.0616507307,-0.0939206779,-0.0088565806,0.0245135389,0.0538019724,0.0733657181,0.058274392,-0.0005483186,-0.0132575864,-0.0172914825,-0.0256093405,0.0679111406,0.0644676387,-0.0527997203,0.0307489913,0.0558618829,0.02308915,0.0873572454,-0.0559081286,0.0766722858,0.0835714862,-0.0003673818,-0.0064398563,0.0119181741,-0.0741820112,-0.0191361066,-0.0678274482,0.0234513097,0.0845894739,0.0534895547,0.0235921629,-0.083794713,-0.0670943707,0.0296116807,0.0574914031,0.0122862803,-0.0889560506,-0.055522427,0.073604919,0.0349650458,-0.0597753711,-0.0065961569,0.04799724,-0.0446923636,0.0055057839,-0.0291388258,-0.0413223021,0.0524924174,0.0615524091,-0.0470195338,0.092799291,0.0121968631,0.0663869828,0.0327699669,-0.0428074896,-0.0366363972,-0.0726906508,0.0618395619,-0.088500686,-0.0354286805,0.0593722425,0.0538064502,-0.0454998501,0.0019727135,-0.0315668881,-0.0037781245],[-0.0786527842,0.0052313395,-0.0911098197,-0.0133136101,0.0308454931,-0.0058407281,0.0139694531,0.073375307,-0.0214628819,-0.065110825,0.0567463599,0.0083625959,-0.0544336848,-0.0780439526,0.0349913649,-0.0491909012,0.0818723366,-0.088612549,-0.0744818598,0.0621776059,0.0294930078,-0.0620591342,-0.0262451284,-0.0505468957,-0.0419319198,0.0350882374,0.0513949916,-0.0531430952,-0.0712332428,0.0374627858,-0.0329970121,0.0622078441,-0.0516875647,-0.0847261921,-0.0769429356,-0.0448934138,-0.0679378808,0.0654964969,-0.023806924,0.0669987351,0.0806613043,-0.0323680714,-0.0770499557,-0.0444516949,-0.0204662867,-0.077702038,-0.0003900161,-0.0181696471,0.0714544728,-0.0128828716,0.0786309093,0.0069591361,-0.0819573104,-0.0802132487,0.0084376642,-0.0552372225,-0.0250676963,-0.0439080521,-0.0699011907,0.0304269474,0.0252614114,-0.058403004,-0.0634906664,-0.0685110167,0.0926156342,-0.0296992622,-0.0594927967,0.056088753,-0.0032850674,0.0839499831,-0.0275674574,-0.0357137173,0.0830679387,-0.0802508444,0.0047053201,0.0637756884,-0.0881062001,0.0751184374,0.0077100261,0.081440933,0.0032786655,-0.0151343178,-0.0099251904,-0.0841436908,-0.0366183333,0.0492169224,-0.0285759121,0.0443216749,0.0694538504,-0.0198017471,0.0802509263,0.0492062457,-0.0706770942,-0.0907598436,0.0228793081,0.0356943794,0.0924569145,-0.0904126242,-0.0456621423,0.0416792631,0.0581034161,0.061496146,-0.0199895632,0.0053211139,-0.0352575667,0.006622029,-0.0133156572,0.0795962587,-0.0521764643,-0.0509475619,-0.0758762807,-0.0593836755,-0.0762243941,-0.0234753247,0.0329800509,-0.064468421,0.0299681872,0.0278195329,0.0598189682,0.0351111405,-0.0903459638,0.0465390012,0.039877858,0.0211397745,-0.0055793631,0.0291396547,0.0168560315,0.0424218476],[-0.0229909476,0.0442760997,-0.0939392895,0.0053883051,0.0420097336,0.0502182581,-0.0549958982,-0.0422917232,0.026586799,-0.0161606651,-0.0541398861,0.0012751205,-0.093677789,-0.0196981207,0.0692998022,-0.0375698321,0.0380238406,-0.0801037923,0.0507328697,-0.0637192503,-0.0783088952,0.0094733723,-0.0055732075,-0.0251441784,-0.0515879914,-0.0810063109,-0.0226264074,-0.0776225254,-0.0419458076,-0.0237307809,-0.0111030117,0.0687388331,0.0416936576,-0.0045631682,0.0536445528,-0.024363419,-0.042829942,-0.0467414074,-0.038691435,-0.0325228646,-0.0349328145,0.0016594473,-0.0129039669,-0.0354107581,0.0170552321,0.0050442712,-0.0453537144,0.0620369054,-0.0025923694,-0.0475371443,0.0377959795,0.0155090047,-0.0290108081,0.0374506637,-0.0536281876,-0.0657870099,-0.0774432719,0.015582799,-0.0622552596,-0.0690485686,0.0033798153,-0.0266568251,-0.0845328942,-0.0874227583,0.0832377821,-0.0690312907,0.0294702742,-0.0304465909,-0.0749888346,-0.0415540561,0.0423124954,0.0414648503,-0.0185415372,-0.0072138715,-0.0149782747,-0.0415962934,-0.0865035951,-0.0098786214,-0.087318413,0.0572415702,0.0730655268,-0.0033041886,-0.0379932821,-0.033689674,-0.0795770511,0.0504995994,0.0392864719,-0.0652536899,0.0568799712,0.0498495176,0.0303615369,0.0689227134,0.0428311713,0.0001338037,-0.0679158568,-0.0320606492,0.0718559176,0.0190393347,-0.0751231983,-0.0571847409,0.0800842568,-0.0511892624,-0.0043985718,0.0766645521,-0.0464722849,-0.0730830207,-0.0348161831,-0.0467163026,0.0387843736,0.0212514084,0.0359228067,-0.0502892695,-0.0280246176,0.0546552017,0.0001629942,-0.0865351111,-0.0652179196,-0.0060948022,-0.010999348,-0.0454109274,-0.0851128772,0.0085968757,0.0192499608,0.0390883498,-0.0026850521,-0.0568537973,0.0294255316,-0.0037554076],[0.080027923,-0.0021799719,0.0515948385,-0.0269504022,0.0167166982,0.0463022031,0.0252052657,-0.0647716448,0.0410001092,-0.0205180328,-0.0551527217,0.0695853233,0.0200784523,-0.0349732265,0.004613034,-0.0673750564,0.0722695366,-0.0012901392,-0.0103666484,0.0210347213,0.0405623838,0.0223558825,-0.0124883195,-0.0709727556,0.0700275898,0.0372750163,-0.0704405084,0.0789118633,0.0416454896,-0.0040251026,-0.0117610898,0.0671399087,-0.0434413552,-0.0075651631,0.0771205425,0.0435840227,0.0097547146,0.0942166075,0.0330113024,0.0246966854,0.0360165983,-0.0770265013,0.0879558921,0.0820734054,-0.0444896892,0.0637916997,-0.0262165982,-0.0456347764,-0.0080764936,-0.0670652837,-0.04039675,0.0113064209,-0.0366659574,0.0712360367,0.0366332568,-0.0946398303,-0.0285846908,0.0736669153,-0.0779461041,0.0290924236,0.0629316866,-0.0429558344,0.0547500476,0.0176055897,0.053211607,0.0067676548,-0.0720988438,0.0484931991,-0.0117581729,0.0399873219,0.0207622908,0.066355668,0.0529606827,0.0110562611,-0.0548770428,-0.0025645583,0.0209063869,-0.0165720489,0.0214379001,0.0660818666,0.0694454536,-0.0184514783,-0.0756918713,-0.066980131,-0.0686693862,-0.0218234602,0.0321230739,-0.0384233855,-0.0316090845,-0.0122493105,0.0059263501,-0.08857923,-0.0262649767,-0.0391831063,0.0190921109,0.0233583115,-0.0142838312,-0.0258243214,0.0719352588,-0.0896124318,-0.0420117937,0.0739668608,-0.0677143857,0.0602903701,-0.0807039067,-0.0486443751,-0.0305661261,-0.0803435445,-0.0087738158,-0.0034731659,0.066852361,-0.0346813798,0.0306543633,-0.0657288507,-0.0505061224,0.0760798752,0.0855134875,0.0659254715,0.0079001216,0.00458318,-0.028006494,-0.0159691051,0.0262437835,-0.0024343482,0.0437859558,0.036091879,0.0436623506,0.0630927309],[0.0096981376,-0.0527743436,-0.0536702462,0.064632386,-0.0588407665,-0.028224688,0.0170083176,0.0302974638,0.0309029855,-0.0186467376,-0.0662096441,-0.0469358638,0.0719389096,0.0136285024,-0.0694421604,0.069488205,0.0754902735,-0.0498784781,-0.0358321778,0.0339600667,-0.0076498822,0.0704579651,-0.0152172493,0.0681621283,-0.036271289,-0.0080688037,0.0118577266,0.0264626462,0.0168459918,0.0551019982,0.0543905944,-0.0544607677,0.0177543964,-0.0206304602,-0.0605373755,-0.0450041704,0.0532131344,0.08179795,0.0749235973,-0.0797488019,-0.0710704476,0.0146285798,-0.0007737104,0.0169429202,-0.0424071029,-0.0729382038,0.0269966982,-0.0179225411,0.0091218986,-0.0391781591,0.0293773264,-0.0332055166,-0.0719853118,-0.0249368548,0.0623654388,0.0664652288,0.0472449027,-0.003760943,0.0603919104,-0.0811393708,0.052612301,-0.0213328786,-0.0260609761,0.0069924723,-0.0549968183,-0.040099252,-0.070950307,0.0794743001,-0.0388125032,-0.0195901617,-0.0113446442,0.0630545467,-0.0174721032,-0.054892648,-0.0570033342,0.058608558,-0.0567249395,0.0895443559,-0.0327420421,-0.0713553727,0.0048363223,0.0029743123,-0.0209918991,0.0322324485,-0.0022422608,0.0223752987,-0.0330992565,-0.0087530166,-0.0201903339,0.0104414998,0.091870971,0.0236347299,-0.0381456316,-0.0327095874,0.0575616248,-0.0631182566,-0.045127783,0.0123968469,0.0112414537,0.0122414771,0.053164687,-0.0900421217,-0.0863409117,-0.0152829336,-0.0618428774,0.0715963766,-0.0439049676,-0.0659512356,-0.0603588186,-0.0677981973,-0.0428533182,0.0038308154,0.0327960029,-0.0846553743,-0.0533979274,0.0216643922,0.0365688801,0.066430442,0.0442753732,-0.0191590022,-0.0673518032,-0.0515202023,0.0122501692,-0.0897613242,0.0239513963,-0.062249545,-0.0800245553,0.0086762495],[-0.0340097994,0.0258451123,-0.0803602934,0.0298300441,-0.020572124,-0.0488967001,0.0653721616,-0.0794435367,0.0448563509,-0.0445271283,-0.0623878725,-0.0288891066,-0.0727692693,-0.0756255463,0.046579089,0.0045867483,0.0255090687,-0.0178763513,0.0527981259,0.0306336731,-0.0211199969,-0.0752405897,-0.0783874243,0.0559227653,0.0543035418,0.0614869371,0.0413433313,-0.0668398291,0.0280535724,0.0330912769,0.0821893886,0.0172746759,0.0720992088,0.0388868824,-0.0307510216,0.0143745411,-0.0197187196,0.0382901654,-0.0630537122,-0.0081691043,0.0484069586,-0.0516220219,0.059626136,0.0617092401,0.0402874127,0.0871472955,-0.064911522,-0.0681072846,0.0786876157,0.0625624955,-0.0872529447,0.0338305272,0.0837200209,-0.083672002,0.0194695387,0.0177974738,-0.0478956364,-0.0177276153,0.0600701943,0.0437418893,-0.0376769938,0.0532823168,0.0212662891,-0.0365564227,0.027067434,0.0671307668,0.0262635071,-0.0914289281,-0.0302687958,0.0537119471,0.0127240978,0.0074343989,0.0112836966,0.019486079,-0.0329648927,-0.011178486,0.0652954131,0.0708264858,-0.0184911378,0.0317422934,0.0558171198,0.0553118847,0.0585167557,-0.0285426509,0.0678240657,-0.0634556711,-0.0703493878,-0.0530031808,0.0502646007,0.0042844568,-0.0284140781,-0.0742347836,-0.0441648699,0.0126349311,0.0771212578,-0.0238129124,-0.0443359986,0.0295258909,0.0264255684,0.0179358702,-0.0173023511,-0.0183081422,-0.0464264266,0.040983405,0.0321346708,0.0567903705,-0.0494162105,-0.0782199278,-0.0317358822,0.0957658291,-0.0813113004,0.036817167,0.0586924963,0.0653389469,0.0604251623,0.0142633058,-0.025268659,0.0013806089,-0.0109150968,-0.0234228745,-0.0878421441,-0.0428918563,0.0557053685,0.0269183386,-0.028895488,-0.027187556,-0.0868023336,0.0564723834],[-0.0784657225,-0.0377438031,0.0595269799,-0.0085068606,-0.0852314904,-0.0340569876,0.0022092119,-0.0236194599,-0.0538808703,0.0514431,-0.0302459281,0.0030048455,0.0597969778,-0.0220948234,-0.0902420506,-0.0912638679,0.0210670475,-0.0496114902,-0.0537229888,-0.0686374977,0.0305914022,-0.0258076508,0.0825767145,-0.0615811795,-0.0422600657,-0.0615628771,0.0000105452,-0.0458018444,0.0220321026,0.028211467,0.0160942674,0.061067991,0.0604240298,-0.0257910714,0.0624193437,0.0053207665,-0.0015377438,0.0599414036,0.0362542011,-0.0444706939,0.0815887079,-0.0599440672,0.0045800358,0.0922160745,-0.0466895476,-0.0546593852,-0.0364675298,0.0714458823,-0.0085855247,0.078942135,0.0303715505,-0.0108486107,0.0464458652,-0.0897060484,0.020219231,0.0248382129,0.0575082898,-0.0248363521,-0.0763132498,0.0323765352,0.0852567106,-0.0372908264,0.0490059629,-0.026168352,0.088223353,0.0231339,-0.0003278374,0.0179207046,-0.0371007398,0.0884225667,0.010588727,0.0134501979,-0.0764444172,0.047992751,0.0501279384,0.0540420227,-0.0104020434,-0.0633367896,0.0727978572,0.0729422048,0.0014369206,0.0602601729,-0.0246452056,0.051845938,0.0065799882,-0.0082730856,0.0027751143,0.049622301,-0.0166459158,-0.070019871,0.0694539174,-0.017321147,-0.0915899649,-0.0120667219,0.0701859295,0.088949725,0.0869048908,0.0136656081,0.0346380472,-0.0260251854,0.0316538326,-0.0535093658,-0.0119577814,-0.0625703409,-0.0944262967,0.0351166986,0.0836853534,0.0430761501,-0.0893116444,0.0221029017,0.0512936078,0.0137122273,0.0315284319,0.0678142533,-0.0344358049,0.067522496,0.0592232347,0.0265464,0.0543635637,-0.0303570181,-0.0501923747,0.0516157784,-0.0323843136,-0.065939799,-0.1042676419,0.0768012106,0.0499363206,0.0413462073],[-0.0662569031,-0.0199255627,0.0099369856,0.0133671518,0.0493494496,0.0113093778,0.05686583,0.0493148081,0.0432778262,0.0680151284,-0.034485627,-0.0000693516,-0.0237115007,-0.0406031124,-0.0537158586,0.0163361337,0.0765782818,0.0537826195,0.0666475445,-0.0269585736,0.0049306396,0.0684511662,0.0459802374,-0.0557898693,0.0510953814,0.0216453858,0.057817407,0.039619498,0.0177111868,0.0392451808,0.0500887483,-0.0620977506,0.0389369205,-0.0189221837,-0.0361440964,-0.0556179136,-0.0262528937,-0.0528557748,0.0258331206,-0.0643400997,-0.0718937144,-0.0525384657,0.025021052,-0.0655303597,-0.0592001826,0.0044809179,0.0513028353,-0.0911996514,0.0063170772,0.0510888621,-0.0142352646,0.0303018745,-0.0280752219,-0.03280228,-0.048051808,-0.0421433635,0.0574148595,-0.0771269351,0.0055234111,0.0151425516,-0.0234860796,-0.0219020359,0.0188965667,-0.0306591671,0.0926623493,-0.0750191957,0.0923910663,-0.0043167188,-0.0216310918,-0.0653047487,0.0633628219,0.0112161189,-0.063746497,0.0510022193,-0.0269915778,-0.0578403212,-0.0246481616,0.0794003755,0.038266737,-0.0464608558,0.0522294715,0.0925686806,0.0444969982,0.0745481998,-0.0068867793,0.0597619079,-0.0659005567,0.0744330436,0.0566242076,0.0539843664,0.0909095332,0.0647022277,0.0160396658,0.0661718622,0.0821979046,-0.0347919576,0.0368394181,-0.0833332911,-0.0174387284,-0.0555502325,-0.0155487722,0.0522431247,-0.0121084759,0.07241413,0.0308659542,-0.0798407272,0.0664246231,0.0466854498,0.0485309847,-0.0393800214,0.064871937,-0.0444331616,0.0803471208,0.0739896819,-0.0094298907,-0.0290290974,-0.0571882352,-0.0883876011,0.0910232291,0.0284243282,0.0397539586,-0.0820518211,0.0587694645,0.0617145523,-0.0788591877,-0.0259945337,-0.046811536,0.0287997965],[-0.0412006266,-0.08084061,-0.0362408534,-0.0888308734,0.0312392116,-0.0747769848,0.0132678915,0.0434379391,0.0808344185,0.0370988846,-0.0588266551,0.0603761151,-0.070225969,-0.0067356601,0.0717258602,-0.0689916015,-0.0259904284,-0.0358692035,-0.0700971931,-0.0095966607,0.060037002,0.057540521,0.0945307091,-0.0599466041,-0.0283287037,0.0231905989,0.033272095,-0.0859223679,0.0488167778,-0.0123627344,0.0265333578,0.0161637645,-0.0712382942,-0.0118921511,0.0389691889,-0.017645577,-0.0296379682,-0.0100523708,0.0725538656,0.0544256419,-0.0256526265,-0.0286982916,-0.0637958571,0.0022938442,0.0135127278,0.0278217513,-0.0500109158,-0.0118178176,0.021469716,-0.0709130317,-0.0326394476,0.0197906271,0.074275367,0.0065560821,-0.0696801916,-0.0287044384,-0.0356133953,0.031202605,0.0618060157,-0.0867326632,-0.0555045679,-0.0392929614,0.0123609966,0.0556650274,-0.0752931535,0.0591222495,-0.0310200769,-0.0641003996,0.0057631861,0.0143168485,0.0163507648,-0.0576642752,-0.0598478951,-0.0675907806,0.0033880956,-0.0738270506,0.0680737942,-0.0169795956,0.0707834885,-0.0520742945,0.0466795936,0.0446306281,0.0212186649,0.013179658,-0.0747937411,0.0121865664,0.0067124837,-0.0047072885,0.0585442185,-0.0578366853,0.0212945156,0.0121823382,-0.0131943729,0.0574903265,0.0186254811,-0.0823693871,0.0540987961,-0.0340621248,-0.0191848632,-0.0143463928,-0.0185483471,-0.0460505895,-0.0070606633,0.0101465248,-0.0419396423,0.071232982,-0.0579278246,0.0449071452,-0.0314624198,0.0226186179,-0.056553077,0.0526527949,0.0887137055,-0.0020780116,0.0235063825,-0.0104258396,-0.03858044,0.0469053499,0.0921600685,0.0229485668,-0.0599413253,0.0801207647,-0.0479176901,-0.0898954049,0.0381046012,0.0857518911,-0.0350586995,0.0465135723],[-0.006861439,-0.028896315,0.0696634576,0.0044274777,0.0191487316,0.010330908,-0.0390971415,-0.0163500048,0.0699766427,0.0571147352,-0.0789816007,0.0442084447,0.0704044029,-0.0215437338,0.0659700334,-0.0753295496,-0.0202946048,0.0352007523,0.0584986918,-0.0924578607,0.0753802061,0.0323610827,-0.0550678372,0.0047491747,-0.0205408353,-0.0731178448,-0.0209779739,0.0026860719,-0.0525780395,0.0388436913,0.0784798041,0.0656805784,0.0007759597,0.0678167716,-0.0917974561,-0.0874901786,0.024931455,0.0396788493,-0.0300402418,-0.0373293795,0.0692416802,-0.0134207103,-0.0147593822,-0.0484368913,-0.0526624322,-0.0193941649,-0.0608211607,-0.0905765519,0.0391252264,-0.0166053846,-0.0129369562,-0.0583970621,-0.0662549734,0.0177186728,-0.0142809469,-0.0011601218,-0.0821264014,-0.0485658869,-0.0502729937,-0.0422537252,0.0929984748,0.0439087115,0.0079051396,-0.0665751621,0.0121805118,0.0127513381,-0.0637338832,0.056803219,-0.0760052055,0.0510893874,0.0130846752,0.0744742304,0.0094115669,-0.0905011669,-0.0169463009,0.0143442294,0.0414873399,-0.070251599,0.0194386188,-0.0276385434,0.0934182927,0.0446946435,0.0546724349,0.0633317977,-0.0393683203,-0.0495439209,0.0113670947,0.0168925095,-0.0828617364,0.037434198,0.0620782338,0.0642337948,-0.0921292379,-0.0728156194,-0.0106309634,0.0521112271,-0.0617507994,0.0565116219,0.065396063,0.0410436094,0.0695820972,-0.0400743373,-0.0857132375,0.055522453,0.0805702731,-0.0569819249,0.071236372,-0.0224006418,-0.0167940725,0.061621733,-0.0332675129,0.0034792975,-0.0503907539,0.035454914,-0.0027769294,0.0546207763,-0.019902207,-0.0023790363,-0.0075713387,0.0548913144,0.0075589335,0.0027864585,0.0509919412,0.0529383831,0.0116899638,0.075933218,-0.096615538,-0.0715999082],[0.0407672711,-0.0870576128,-0.009150249,-0.0634950325,0.0221764315,-0.0048795054,0.0708747357,-0.0815105736,-0.0565834902,0.0428019166,-0.0485061295,-0.0288697165,0.0560130924,-0.0517792143,0.0711094439,0.0039764927,0.0642892495,0.0142991468,0.0775747001,0.0311459638,0.0893448442,-0.0855115503,0.0046532885,0.0715808123,-0.0421345234,0.0474622622,0.0083092451,0.0114053246,0.0841701701,-0.045863796,-0.0036776597,-0.0729852021,0.0732011199,0.0755019709,0.0117349047,0.015434701,0.0124803223,-0.0405641347,-0.0779432952,-0.0025102461,-0.0259143952,-0.0391567163,-0.0220473874,-0.0154226199,-0.0935609713,-0.0387256108,-0.0448392853,-0.0824107677,-0.0053915475,-0.0199150592,-0.0025334598,0.0018566385,0.0626530051,-0.0179259144,0.0857841447,-0.0814255178,-0.0551350676,0.0738534778,0.0351891592,0.0641712472,0.0652240738,0.0686009079,0.0085130623,-0.0637147054,-0.0773992091,0.0601960458,-0.040811345,-0.0827483386,-0.0823497474,0.0548363142,-0.0872675627,-0.0638798028,-0.0061705103,0.0467426032,-0.0425760224,0.0874051973,0.0286130514,0.0791819394,-0.027487969,-0.0201450475,-0.0300759058,0.054780405,0.0831871405,0.0407771468,0.0109487725,-0.0122794798,-0.0670698285,-0.0454237647,0.0628681928,0.072950393,-0.0064075035,0.0091103092,-0.0727365986,-0.0056550205,-0.0400129929,-0.0373730734,0.0662495345,-0.0048353286,-0.0797742531,0.0338686109,0.0611219555,-0.0540563352,0.0725866407,0.0532850139,-0.0645252615,0.0543835498,-0.0783940256,-0.0160375703,0.0614203177,0.0530270413,0.080968082,-0.0563904308,0.0161242429,-0.083621189,-0.0879546329,-0.0868849903,0.0180832054,-0.001219957,-0.0649084374,-0.0254088603,-0.0886688232,-0.0534982346,0.0140564535,0.0762151778,-0.0162817687,0.0645612404,-0.0770248473,-0.0751893148],[-0.0659625754,-0.0071177683,-0.0591621995,0.073034212,0.0354444012,0.0420899652,-0.0758869126,-0.0975343063,0.0130996229,-0.0293053649,-0.0777115375,0.0836695284,-0.0158830173,0.0040716594,-0.0165597312,-0.057705082,-0.068186678,0.0649059936,0.0542811714,-0.0472460054,0.0766732991,-0.0211675912,0.027573172,-0.0256056897,0.0057981778,-0.0705246106,0.0752916187,-0.0302223135,0.055663906,0.0853953436,0.0350363813,0.0684287697,-0.0302750748,0.0460797325,0.0193663742,-0.0146812461,0.0038377156,-0.0314783975,0.0898155943,0.0150092971,0.0415534526,-0.0578261316,-0.0793041438,-0.0129250744,-0.0676989034,-0.0195566844,0.0250071269,-0.0832203254,0.019933315,0.056412749,-0.0250554923,-0.0463213809,-0.0164205618,-0.0190712344,0.0896094963,0.0144413356,-0.0449364223,-0.0743321702,0.0604568794,-0.0180897359,-0.0220524054,-0.0380293354,0.0600377247,0.0719050765,-0.0163064487,0.0273769069,0.0677020028,-0.0369018093,0.0609516576,0.0860872567,0.0105717694,0.0243642069,-0.0108341491,0.0192220602,-0.0173733234,-0.0090847695,0.0524899252,0.0359429009,0.0303365495,-0.0430916734,0.0610857084,0.0618926249,-0.0393476859,0.0602195449,-0.0546579584,-0.049709551,-0.0731242299,-0.0707046092,0.0427031256,-0.0232493989,0.0571290366,0.0263746809,-0.0725986287,0.0146157574,0.0244511198,-0.0723837614,0.0403263383,0.070472382,0.0468954742,0.0166543406,0.0682433471,0.011159515,0.0152376276,0.0372703485,0.0458318926,-0.0225473866,0.0624528751,-0.0730445907,0.0414180942,0.0251155216,-0.004200547,-0.0980137512,0.0673611984,-0.0524443723,0.0749261975,-0.0147409011,-0.0471622236,0.0691247359,0.0149099641,-0.041941341,0.0439534038,-0.0905635431,0.0781945214,0.0621408373,0.0075975107,-0.0443816632,0.0731541365,-0.0226605628],[-0.0591005273,-0.0899160206,-0.0656717494,0.0043361187,0.0784029886,-0.0309453551,-0.0026573436,0.0569338836,-0.0686148852,0.0331308991,-0.0751381814,0.0255399775,-0.0742609277,0.0247681253,-0.0221392307,0.0111593688,0.0394984372,-0.0569522791,0.0274795387,0.0503906533,-0.0673260838,-0.0331816748,0.0906493887,-0.085217759,0.0021845403,0.0804341137,-0.0176852234,0.0038530107,0.0942653939,-0.0111285988,-0.0230308846,0.0153369028,0.0912462175,0.0331997499,0.0024460857,-0.05105111,-0.0092036678,-0.0775271431,-0.0098758312,-0.0669194609,-0.028501818,-0.0126400758,0.0141316233,0.0338671356,-0.0180517919,0.0096511208,-0.0099521186,-0.0944215655,-0.0224443264,-0.0883962438,0.0633139461,-0.0154837528,-0.0173872374,-0.0109707257,-0.0275983121,0.0430388004,-0.0849614888,-0.0429108441,0.0872235745,0.008925817,-0.0001263676,-0.0464483239,0.0777495205,-0.0530079082,0.015891755,0.0625748411,0.056976337,-0.0301390123,0.0520259514,-0.006520214,0.0171473511,0.0660370812,-0.0466020145,-0.0310062636,0.0387465134,0.085209839,-0.074775897,0.0325291418,-0.0355254896,-0.0407003127,0.0524771288,-0.0661194623,0.0844793692,-0.0870574713,-0.0296111889,0.021829633,-0.0267652329,-0.0609338619,0.0141610531,0.0736312568,0.063549526,0.0591546334,0.0528904237,-0.0509124026,0.0454836227,0.0827637464,-0.0456338637,-0.065294303,0.0331047326,0.001453019,0.0717459545,0.0634432435,-0.0210629404,0.0244512595,-0.0285923351,0.0545677133,-0.066536203,0.0148388604,-0.0799461529,0.0476846471,-0.0271336548,-0.0002560126,-0.0206680223,0.001886809,-0.076847367,-0.0841568783,0.0713537335,-0.0569764152,0.0760374442,-0.0381934159,-0.0934995562,0.0721062347,0.0778408423,-0.0557333864,-0.0805579424,-0.0047839186,-0.0448823422,0.0748629346],[-0.0119604487,-0.0499303453,-0.0656802654,-0.0325394049,-0.0208211895,-0.04327121,0.0709264278,0.0496413969,-0.0034729855,-0.0050724815,0.0774649158,